[
  {
    "Release Year": 1901,
    "Title": "Kansas Saloon Smashers",
    "Origin/Ethnicity": "American",
    "Director": "Unknown",
    "Cast": "",
    "Genre": "unknown",
    "Wiki Page": "https://en.wikipedia.org/wiki/Kansas_Saloon_Smashers",
    "Plot": "A bartender is working at a saloon, serving drinks to customers. After he fills a stereotypically Irish man's bucket with beer, Carrie Nation and her followers burst inside. They assault the Irish man, pulling his hat over his eyes and then dumping the beer over his head. The group then begin wrecking the bar, smashing the fixtures, mirrors, and breaking the cash register. The bartender then sprays seltzer water in Nation's face before a group of policemen appear and order everybody to leave.[1]"
  },
  {
    "Release Year": 1901,
    "Title": "Love by the Light of the Moon",
    "Origin/Ethnicity": "American",
    "Director": "Unknown",
    "Cast": "",
    "Genre": "unknown",
    "Wiki Page": "https://en.wikipedia.org/wiki/Love_by_the_Light_of_the_Moon",
    "Plot": "The moon, painted with a smiling face hangs over a park at night. A young couple walking past a fence learn on a railing and look up. The moon smiles. They embrace, and the moon's smile gets bigger. They then sit down on a bench by a tree. The moon's view is blocked, causing him to frown. In the last scene, the man fans the woman with his hat because the moon has left the sky and is perched over her shoulder to see everything better."
  },
  {
    "Release Year": 1901,
    "Title": "The Martyred Presidents",
    "Origin/Ethnicity": "American",
    "Director": "Unknown",
    "Cast": "",
    "Genre": "unknown",
    "Wiki Page": "https://en.wikipedia.org/wiki/The_Martyred_Presidents",
    "Plot": "The film, just over a minute long, is composed of two shots. In the first, a girl sits at the base of an altar or tomb, her face hidden from the camera. At the center of the altar, a viewing portal displays the portraits of three U.S. Presidents—Abraham Lincoln, James A. Garfield, and William McKinley—each victims of assassination.\nIn the second shot, which runs just over eight seconds long, an assassin kneels feet of Lady Justice."
  }
]
