[
  {
      "Release Year": 2017,
      "Title": "İstanbul Kırmızısı",
      "Origin/Ethnicity": "Turkish",
      "Director": "Ferzan Özpetek",
      "Cast": "Halit Ergenç, Tuba Büyüküstün, Mehmet Günsür, Nejat İşler",
      "Genre": "romantic",
      "Wiki Page": "https://en.wikipedia.org/wiki/%C4%B0stanbul_K%C4%B1rm%C4%B1z%C4%B1s%C4%B1",
      "Plot": "The writer Orhan Şahin returns to İstanbul after so many years to help the well-known director Deniz Soysal to write his first novel. Orhan finds himself to look with nostalgia at the places where he was born and raised, reliving the relationships with friends, family and past loves."
  },
  {
      "Release Year": 2017,
      "Title": "Bleeding Steel",
      "Origin/Ethnicity": "Chinese",
      "Director": "Leo Zhang",
      "Cast": "Jackie Chan, Show Lo, Nana Ou-Yang, Xiahou Qiyu, Callan Mulvey",
      "Genre": "drama / action / science fiction",
      "Wiki Page": "https://en.wikipedia.org/wiki/Bleeding_Steel",
      "Plot": "Hospital doctors call to inform Special Agent Lin Dong (Jackie Chan) that his daughter Xixi (who suffers from leukemia) is in critical situation. He speeds over to the hospital with a teddy bear strapped into the backseat of the car. On the way, co worker Xiao Su (Erica Xia-hou) calls him to inform that a critical witness is in danger. Agent Lin stops right outside the hospital, pauses, and turns back to protect the critical witness Dr. James.\r\nDr. James injects himself with a chemical substance stored with a mechanical heart right before the police bursts in to escort him away. They are ambushed by man in black and almost all in the team are killed. Xixi meanwhile dies at hospital. Xiao Su manages to protect Dr. James from being killed, while Lin Dong manages to ram Andrew against an oil tank using his car and cause a huge explosion by shooting the oil tank. The car flips and the scene changes to 13 years later.\r\nAn author has recently released a book titled \"Bleeding Steel\" about an ex US marine who has a mechanical heart. A figure with red fishnet stockings and fur coat, \"Kitty\" walks into a hotel and pays a visit to the author of the book. She drugs the author and reveals that she is a man in disguise (Li Sen). She then proceeds to download information from his computer. Woman in Black attacks the building and demands the author to reveal where he got the inspiration of his book from. They are attacked by Lin Dong dressed in black, who also tries to find out the same answer. Police arrive, and they all part ways.\r\nNancy is seen receiving a serving of spaghetti with beef soup from Lin Dong (a server at the cafeteria) and gets in a fight with a fellow student. Lin Dong steps in to stop the fight, and Li Sen becomes interested in finding out more about her."
  },
  {
      "Release Year": 2017,
      "Title": " 2:22",
      "Origin/Ethnicity": "Australian",
      "Director": "Paul Currie",
      "Cast": "Michiel Huisman, Teresa Palmer, Sam Reid",
      "Genre": "thriller",
      "Wiki Page": "https://en.wikipedia.org/wiki/2:22_(2017_film)",
      "Plot": "The movie starts with Dylan Branson (Michiel Huisman) having a dream about a murder at the Grand Central Train Station that feels very real. He wakes with a start and progresses with his routine while watching news about a star called Hamlin that died 30 years ago, but its light is reaching the Earth 30 years later and that this supernova will have effects on the Earth and its inhabitants. Dylan is an air traffic controller who possess a unique ability to visualize patterns.\r\nDylan is shown on his way to work, riding a bike and heading to the Grand Central Station to take the train. After work, he goes to a club drinking with his co-workers and receives a ticket to an aerial ballet as a gift for his upcoming birthday. The following day at exactly 2:22pm, his world stops after he almost causes a midair collision of the two aircraft, resulting in him being suspended from his job.\r\nThe day after he was suspended, he attends the aerial ballet and meets Sarah (Teresa Palmer). They go to a restaurant and start talking, Dylan tells Sarah that his father was a pilot and that he also trained to be a pilot but could never become one as he was afraid of flying. Sarah tells him that she works at the Howard Pace Art Gallery. He also tells her about his being suspended from work, and he finds out that Sarah was on the plane that almost collided with the other aircraft at 2.22pm. Dylan felt apologetic about the incident, but Sarah was instead thankful towards Dylan for saving her life. As they depart, they admit to each other that for a \"first date\" they felt a deep connection and it felt like they had known each other forever.\r\nThe following day, while on the way to the Grand Central Dylan, notices the same happenings (siren, woman laugh, construction sound, \"Can I help you with\", glass breaking) and at 2:21 PM, he hears the announcement of the boarding of the Millhurst express, sees a businessman reading his newspaper, a couple hugging each other, a line of preschoolers where the last child in line drops something and a pregnant woman under the clock. At exactly 2:22 PM, the window of the station shatters. He goes to meet Sarah and asks her out to an early dinner, going to the Central Park with her. Sarah tells Dylan that she was a ballet dancer student before she landed awkwardly and tore two of her knee ligaments. Cheering her up, Dylan create an improvised speaker using a paper cup and ice cream cone holder, lifting Sarah's mood,they then dance and kiss. They go to Dylan's apartment and make love. The next morning, Dylan asks Sarah where she got her necklace from, to which Sarah replies that it was from her ex-boyfriend; Jonas (Sam Reid) who happens to be the main artist of the gallery at which she works. Dylan asks when is Sarah's birthday and they find out that both of them were born on the same day; April 18, 1986 and they are both turning 30 within a weeks time. Dylan suddenly hears a car crash on the road below his apartment at exactly 9:15 AM and he tells Sarah that it was 3rd day in a row that the same incident had happened.\r\nDylan takes a cab with a reckless driver going to Grand Central, as the driver take the shorter route Dylan tells him to stop the cab and notices again the same pattern of siren, a woman laugh, construction sounds, and a man saying \"Can I help you with\". Dylan then shouts for the cab to stop and this infuriates the cab driver, who turns around to tell Dylan off for shouting at him. Just then, another car hits them both, causing the breaking of the cab's glass windows. Even though Dylan is injured, he goes to the Grand Central Station and sees exactly the same pattern of events. He tells Sarah of these repeating patterns, but with different people carrying out the same actions. Sarah does not believe Dylan, but helps to clean his wounds from the car accident. Dylan goes home and starts writing all the events of his day starting from 9:10 AM (water drop, a bug dying, a plane flying overhead etc.) and realizes that everything has a pattern that's repeating itself.\r\nDylan goes to the gallery looking for Sarah, and realises that the gallery was having an exhibition with Jonas' art piece as the main exhibition. Jonas has created a light hologram exhibition about the Grand Central Station, and Dylan sees that it is exactly like the events that he has experienced the past few days (announcement of the boarding of Millhurst Express, a business man reading his newspaper, a couple embracing each other, a line of preschooler where the last in line drops something and a pregnant woman under the clocks). Dylan assumes that Jonas is stalking him as only Dylan knows about these events.He attacks Jonas resulting in a brawl and questions Jonas on whether he was stalking him. In the audience is the owner of the Keifer Gallery and he applauds saying it was a great idea to enact the murder at the Grand Central Station that happened 30 years ago and that he has an exhibit related to it at his gallery. Sarah apologises to Jonas about Dylan's attack and puts her relationship with Dylan on hold.\r\nLater that night, Dylan texts Sarah to beg for her forgiveness. In the mean time, he finds a stack of envelope hidden in his home. He finds out Jake Redman (Duncan Ragg) has written these letters to a woman named Evelyn. Upon investigation, Dylan finds out that Jake was a criminal although he was never convicted for his crimes as the police could not find enough evidence to pin him down, while Evelyn was a singer, and they both were lovers. Dylan also finds an article online stating that Jack had shot Evelyn and another policeman, Noah (Jack Ellis), down in the Grand Central Station in a fit of jealous rage before being gunned down by other policemen on 18 April 1986, which was the day both Dylan and Sarah were born.\r\nDylan then visits Evelyn's sister, and she gives Dylan a stack of letters that Jack wrote to Evelyn as she could never bear to read them and shows him the necklace she is wearing saying that it was all she needs to remember her. The necklace is identical to the one that Dylan had seen Sarah wear. She also tells him that Noah; the policeman was taking Evelyn to Millhurst to keep her safe from Jake and that it seemed that he was also in love with Evelyn. Noah goes to the Grand Central Station to buy a ticket for the Millhurst Express, but is told that the service was terminated 30 years ago and now the train is known as the Poughkeepsie Express. At exactly 2:22 PM the chandelier crashes to the floor.\r\nDylan connects the dots and realises that Dylan was Jake in his past life, while Sarah was Evelyn, and that he would kill her at Grand Central Station on their birthday, 18 April at 2:22 PM. He realises that the pattern of events that has been happening was leading up to the day they both would die. He tells Sarah this and she does not believe him. As she tries to calm Dylan down, Dylan insists that they both should break up as he would soon kill Sarah, which he does not want to as he knows that they are soul mates.\r\nDylan contemplates suicide, which was unsuccessful, while a distraught Sarah looks for Jonas in his apartment. Jonas offers to bring Sarah to Millhurst to help her feel better about the breakup. The next day, both Jonas and Sarah's flight to Millhurst gets canceled and they have to go to Grand Central Station to take a train there. Meanwhile, Dylan looks for Sarah and in the midst of it, he breaks into Jonas' apartment and sees that Jonas recognises Sarah as Evelyn in his past life and that he was Noah. Dylan figures out that Jonas/Noah is obsessed with Sarah/Evelyn and that Jonas/Noah had a gun with him and races to the Grand Central Station to see her. On his way he attracts the attention of the police and leads them there.\r\nAt the Grand Central Station, Sarah realises that the patterns Dylan saw were true and she tries to leave but is stopped by a crazed Jonas calling her Evelyn. He wants Sarah to admit that she loves him, while Sarah refuses just as Dylan arrives at the Station. Jonas thinking that Sarah called him there gets enraged and makes his way towards Dylan with a gun while Sarah sees the events unfold as Dylan had described them to her, and realises that she is the pregnant woman standing under the clock.Jonas first points his gun towards Dylan and then Sarah saying that \"she'll never be yours\" intending to kill her so that if he couldn't have her neither could Dylan but Dylan shields Sarah just in time but himself gets shot at 2:21 PM.\r\nThe events from 30 years ago plays out with Jake/Dylan protecting Sarah/Evelyn from Noah/Jonas and at exactly 2:22 PM Jonas gets shot by the police who have followed Dylan there. Dylan also falls in Evelyn's arms and momentarily closes his eyes having visions of Jake and Evelyn being affectionate. He does not die and Sarah then looks at the clock, saying it was 2:23 PM and they managed to survive. Turns out that the Jake was framed for murdering Noah and Evelyn as the police had wanted to save the reputation of Noah since he was a Police detective and one of them. Also the dying star; Hamlin mentioned at the start of the movie finally disappears but a new star is immediately reborn.\r\nIn the ending scene, it is shown that Dylan and Sarah are living happily, with Dylan having finally overcome his fear of flying and is now a pilot and Sarah smiling affectionately at their baby in the cradle."
  },
  {
      "Release Year": 2017,
      "Title": "Valobasha Emoni Hoy",
      "Origin/Ethnicity": "Bangladeshi",
      "Director": "Tania Ahmed",
      "Cast": "Irfan Sazzad, Mim Bidya Sinha Saha",
      "Genre": "romance",
      "Wiki Page": "https://en.wikipedia.org/wiki/Valobasha_Emoni_Hoy",
      "Plot": "The story starts off with two mercenaries, Mishu and Mahatab (Mishu Sabbir and Mir Sabbir) who receives a briefcase full of money for a job,murder, which they were supposed to do. But they decide to reform and start a new cleaner life and would use the money to kick start their new life They enjoy their time with the money they had received and roam around London. At a point of their journey, they see a Bengali girl, Oishee (Bidda Sinha Saha Mim) with a British guy, Peter. Mishu falls for her immediately, and they decide to follow her. While following her, they realize that someone is already following them. Someone who turns up everywhere they were going asking for a lighter. They keep that in mind and follow Oishee to her house in the jungles. There they find the guy who had been following them, Sajjad (Irfan Sajjad) and threatens him to find out why he was following them. They find out that Sajjad was hired by Oishee's father (Tareq Anam Khan) to get rid of Peter. Mishu, in order to see Oishee, peeks into Oishee's house but instead sees another girl, Mithila, and gets stunned by seeing her alive. This was the girl they were supposed to assassinate but she remained alive. Then they team up with Sajjad to solve these unsolved mysteries but to find out a numerous problems which they had to face with great difficulties.[4]"
  },
  {
      "Release Year": 2017,
      "Title": "Nabab",
      "Origin/Ethnicity": "Bangladeshi",
      "Director": "Joydeep Mukherjee",
      "Cast": "Shakib Khan, Subhasree Ganguly, Amit Hasan, Rajatava Dutta",
      "Genre": "action",
      "Wiki Page": "https://en.wikipedia.org/wiki/Nabab",
      "Plot": "A group of people travelling in a bus, later the bus stops for a tea break and the hooligans arrive at the same time when suddenly a passing convoy is attacked and the assassins try to kill the man inside one of the cars. The man using his swiftness foils the attack and manages to nab and arrest one of the attackers while killing another.The rest manage to escape the scene.\r\nThis man is Chief Investigating Officer Rajib Chowdhury (Shakib Khan) and the person in the car turns out to be Chief Minister Ananya Chatterjee (Aparajita Adhya) who was impressed with Rajib and delegates to him the task of locating the people behind recent terrorist conspiracy to Rajib. Rajib promises to fulfill the job to the best of his ability.\r\nMasud (Sagnik Chatterjee) a Muslim ACP is taken off from the Special Action Team when a notorious gangster Mustaq escapes his clutches. Despite being an honest and upright police officer with the best intelligence gathering network in the force, Masud is rueful that he is being given low class treatment because he is a Muslim and is being perceived as having let Mustaq escape because he was a Muslim as well.Rajib wants Masud on the team, but Masud refuses.It is revealed that Rajib's father Constable Shymal Chowdhury was killed by terrorist in Bangladesh which motivated Rajib to join police force.\r\nIt is shown that Avoy Mandal(Kharaj Mukherjee) the Deputy CM was the one who committed the fraud and is trying to ensure that he is not caught and hence he had asked the assassins to attack the CM. Rajib tries to break the back of crime and this starts irritating Mandal who senses how close Rajib is getting. Mandal then frames Rajib for the murder of Meghla(Meghla), daughter of the Police Commissioner Gautom(Rajatava Dutta).\r\nRajib escaped prison then went to the Commissioner's house to tell him the truth, but there he accused for the murder of Commissioner.With the help of his love interest Rajib reached to Mandal. But imprisoning his mother and few colleagues Mandal trapped Rajib to kill CM in a high security zone."
  },
  {
      "Release Year": 2017,
      "Title": "Boss 2: Back to Rule",
      "Origin/Ethnicity": "Bangladeshi",
      "Director": "Baba Yadav",
      "Cast": "Jeet, Nusrat Faria Mazhar",
      "Genre": "action",
      "Wiki Page": "https://en.wikipedia.org/wiki/Boss_2:_Back_to_Rule",
      "Plot": "The Story revolves around Surya(Jeet), a public figure who is now hated by the people of India due to an apparent missing of their money kept in Business bank, a bank built by Surya for his people. Gopinath, Surya's loved minister was killed by an unknown person due to various enmities. Surya was forced to leave India due to repeated threats by the people and the police. He dressed as a Rock musician and sneaked into Dhaka, Bangladesh, to look for Prince Shahnawaz Hussain(Amit Hasan), who had earlier promised to donate a huge sum for his company, Surya Industries. But later he came to know that he betrayed him and went off to Bangkok,Thailand. In Dhaka, Aisha(Nusraat Faria) who was actually Shahnawaz's daughter helped Surya to overcome various problems and come to Bangkok. In Bangkok, during an action scene on the top of Shahnawaz's building, we come to know that actually Bidyut Shivalkar(Indraneil Sengupta), Gopinath's son, who Surya had believed to be his friend due to his enormous contributions to his industry, was the one who tricked Surya by stealing all the money in the bank with a hope to become a wealthy man. He is also the man who killed his father by gunfire due to greed of property. The people who helped him were Prince Shahnawaz Hussain(Amit Hasan) and Avinash Burman(Kaushik Sen), another politician friend of Gopinath, with the same intention.Surya escaped them by jumping down the building using a rope. He is soon able to kill Shahnawaz with the help of Aisha, who hates her father for killing many people including her mother. He also is able to poison Avinash to death while asleep, in spite of the huge security. But then the plot turns around when Bidyut captures Aisha and Rusha(Subhasree Ganguly), Surya's lover.But finally, in an action scene, he is able to save both of them and gets hold of Bidyut. He also thus is able to win back the lost money. Bidyut is sent to jail and a victorious Surya is once again able to bring happiness to his people and criticizes them for losing their trust on him. Nevertheless, the film ends on a happy note with Surya being able to win back the trust of the people."
  },
  {
      "Release Year": 2017,
      "Title": "Dhaka Attack",
      "Origin/Ethnicity": "Bangladeshi",
      "Director": "Deepankar Deepan",
      "Cast": "Arifin Shuvo, Mahiya Mahi, Afzal Hossain, Shatabdi Wadud A B M Shumon, Nowshaba",
      "Genre": "action, thriller",
      "Wiki Page": "https://en.wikipedia.org/wiki/Dhaka_Attack",
      "Plot": "The story centers on the Dhaka Metropolitan Police (DMP) Elite Forces' fierce operation against a terrorist organization, the attack is part of a plot by few foreign intelligence agencies to destabilize the country, in order to destroy the country's defense layers.[5] The film stars Arifin Shuvo as the Assistant Deputy commissioner of DMP, and the in-charge of Bomb Disposal Unit. Sumon played the role of a commander of SWAT Force. The film also features Afzal Hossain as the DMP Commissioner, Shatabdi Wadud as Intelligence officer, and Mahiya Mahi as a news reporter.[6][7]"
  },
  {
      "Release Year": 2017,
      "Title": "Noor Jahaan",
      "Origin/Ethnicity": "Bangladeshi",
      "Director": "Raj Chakraborty",
      "Cast": "Puja Cherry, Adrit Roy",
      "Genre": "romance",
      "Wiki Page": "https://en.wikipedia.org/wiki/Noor_Jahaan",
      "Plot": "Noor Jahaan is the story of two young lovers, Noor (played by Adrit roy) and Jahaan (played by Puja cherry).[3]"
  },
  {
      "Release Year": 2017,
      "Title": "Mrittupuri: Kill Zone",
      "Origin/Ethnicity": "Bangladeshi",
      "Director": "Zayed Rizwan",
      "Cast": "Arifin Shuvo, Prosun Azad",
      "Genre": "action",
      "Wiki Page": "https://en.wikipedia.org/wiki/Mrittupuri:_Kill_Zone",
      "Plot": "Sydney is a dream city for many immigrants, but also it is an ideal place for many international crime lords. Gangsters from Bangladesh, China, Lebanon, Russia have all moved to Australia, to take a piece of the pie, and try to build empire. Among them is the rising Bangladeshi gang Double R. Rajan Rahman (Rahmatullah), the kingpin of Bangladeshi gang is not happy with the way his elder son, Rajib Rahman (Saifullah Sadi) and his crime associate Raja (Arifin Shuvoo), run the business. The situation comes to a head after the timely death of Irish Mob boss’ son Jimmy, which prompts Rajib to leave the country. Raja maintains low profile during this period, and in the process falls in love with bar dancer Layla (Prosun Azad). Upon Rajib’s return, he warns Raja not to get involved with Layla, as he perceives Layla to be his own property. Raja manages to divert Rajib’s mind away, with plans to do business with Lengra Kashem (Taskeen Rahman), a mercenary from Bangladesh. Rajib and Sabbir, his youngest brother, meet Lengra and promise him the East coast territory, leading to their business partnership to become a booming new empire. Eventually, Rahman and his crew fall through on their deal, and remove Lengra from the partnership. Lengra decides to avenge this deception, waiting for the right time to strike."
  },
  {
      "Release Year": 2017,
      "Title": "Hanson and the Beast",
      "Origin/Ethnicity": "Chinese",
      "Director": "Xiao Yang",
      "Cast": "Feng Shaofeng, Liu Yifei, Li Guangjie",
      "Genre": "comedy / romance / fantasy",
      "Wiki Page": "https://en.wikipedia.org/wiki/Hanson_and_the_Beast",
      "Plot": "Yuan Shuai, a debt-ridden animal-breeder, tries to get out of his financial predicament by finding a wealthy girlfriend through matchmaking dates. He unexpectedly meets and fall in love with the fox demon, Bai Xianchu, who has arrived to the mortal realm to repay her gratitude. However, the head of the Demon tribe Yun Zhonghe forbids a love relationship between a demon and a human; and takes Bai Xianchu away. To seek his lover, Yuan Shuai bravely crashes the demonic world."
  },
  {
      "Release Year": 2017,
      "Title": "Legend of the Demon Cat",
      "Origin/Ethnicity": "Chinese",
      "Director": "Chen Kaige",
      "Cast": "Huang Xuan, Shōta Sometani, Kitty Zhang, Qin Hao, Sandrine Pinna",
      "Genre": "drama / suspense / fantasy / costume",
      "Wiki Page": "https://en.wikipedia.org/wiki/Legend_of_the_Demon_Cat",
      "Plot": "The story is set in China during the Tang Dynasty (618–907). A demon cat appears and breaks the peace of the capital, Chang’an City, causing a series of strange events. Poet Bai Letian and Monk Kukai join together to investigate the death of Concubine Yang by following the trail left by the cat, unveiling a buried fact.[1]"
  },
  {
      "Release Year": 2017,
      "Title": "The Thousand Faces of Dunjia",
      "Origin/Ethnicity": "Chinese",
      "Director": "Yuen Woo-ping",
      "Cast": "Da Peng, Ni Ni, Aarif Lee, Zhou Dongyu, Wu Bai",
      "Genre": "action / fantasy",
      "Wiki Page": "https://en.wikipedia.org/wiki/The_Thousand_Faces_of_Dunjia",
      "Plot": "The film follows a group of swordsmen's adventures to secretly protect humankind by hunting some mysterious creatures from the outer space."
  },
  {
      "Release Year": 2017,
      "Title": "Duvvada Jagannadham",
      "Origin/Ethnicity": "Telugu",
      "Director": "Harish Shankar",
      "Cast": "Allu Arjun, Pooja Hegde, Vennela Kishore",
      "Genre": "action comedy",
      "Wiki Page": "https://en.wikipedia.org/wiki/Duvvada_Jagannadham",
      "Plot": "Duvvada Jagannatham Sastry (Allu Arjun) is a cook, working as a caterer in Vijayawada along with his family.Jagannatham rescues a high-profile cop (Murali Sharma) from the attack of a crime mafia in Hyderabad. Seeing the quality of a rebellion in the priest, and his sharp shooting skills, the cop trains the priest to become DJ, an encounter specialist who fights crime in disguise of a Brahmin priest. Jagannadham falls in love with Pooja (Pooja Hegde) the daughter of a corrupt home minister (Posani Krishna Murali) involved with yet another real estate crime lord Royyala Naidu (Rao Ramesh) who operates Naidu Industries, and Agro Diamond Financing company in disguise. On the other hand, DJ decides to take on Royyala Naidu in his mission but does not know who he is in actual life. Rest of the story is as how Duvvada Jagannadham uses Royyala Naidu's son Royyala Avinash (Subbaraju) who suffers with Histrionic personality disorder, and through him DJ destroys Royyala Naidu's corrupt business empire, thereby rescuing Agro Diamond scam victims."
  },
  {
      "Release Year": 2017,
      "Title": "The Chainbreakers",
      "Origin/Ethnicity": "Chinese",
      "Director": "Yang Rui",
      "Cast": "Duobujie, Wang Ziyi, Yangshik Tso",
      "Genre": "drama / history / western",
      "Wiki Page": "https://en.wikipedia.org/wiki/The_Chainbreakers",
      "Plot": "In the autumn of 1950, the 18th Army of the People's Liberation Army (PLA) march to Chamdo, Tibet from Sichuan, they plan to liberate Tibet and free all the slaves.[5]"
  },
  {
      "Release Year": 2017,
      "Title": "Manhunt",
      "Origin/Ethnicity": "Chinese",
      "Director": "John Woo",
      "Cast": "Zhang Hanyu, Masaharu Fukuyama, Stephy Qi, Ha Ji-won, Jun Kunimura",
      "Genre": "drama / action / suspense",
      "Wiki Page": "https://en.wikipedia.org/wiki/Manhunt_(2017_film)",
      "Plot": "Du Qiu is a Chinese lawyer who has defeated many legal suits filed against his employer Tenjin Pharmaceuticals but is now being moved to America by his management. He attends a party where the president of the company, Yoshihiro Sakai, appoints his son Hiroshi as head of development of new pharmaceuticals. At the party Du Qiu meets a half-Chinese woman, Mayumi, but loses track of her. Sakai tells a mysterious woman to seduce Du Qiu to remain in Japan. She dances with him at the party then sneaks to his house before he arrives later.\r\nDu Qiu wakes up to find the unknown woman dead in his bed. Du Qiu calls the police and insists that he is innocent. While he is being taken away, corrupt policeman Mamoru Ito creates an opportunity for him to escape by shooting another officer. Du Qiu loses the police by running down a subway tunnel in front of a moving subway car and escaping out an exit at a station that is still under construction. Yamura and his new partner Rika follow Yamura's intuition to the same spot, where they find Du Qiu disguised as a worker. Yamura reaches for his gun but Du Qiu puts a nail gun to Rika's head. Yamura surrenders his gun and trades himself for Rika. Du Qiu and Yamura drive away but crash into a dove cage, sending the white birds flying everywhere as they fight. Du Qiu escapes and hides in a shanty town where people are recruited to take part in drug tests by Tenjin. He is aided by the elderly Mr. Sakamoto and other residents in evading the police during a search there.\r\nThe assassin Rain is hired to kill Du Qiu but she recognizes him as a man who had previously helped her when she was threatened by a gang so she intentionally misses the shot with her sniper rifle, much to her sister and partner Dawn's annoyance. Yamura pursues Du Qiu in a high-speed jet ski chase and when Du Qiu's jet ski stops running he climbs over Yamura onto a bridge to escape. Mayumi meets him there and they run away together.\r\nMayumi explains that her deceased fiancé shot himself on the day of their planned wedding after losing a legal battle to Tenji due to Du Qiu's legal skills. She shows him the park where the wedding took place as Rain and Dawn arrive on motorcycles shooting at Du Qiu. Yamura arrives and drives into Dawn, then pursues Du Qiu and Mayumi in a high-speed car chase until Du Qiu crashes, flipping the car. Yamura helps Du Qiu pull Mayumi from the wreck then handcuffs himself to Du Qiu and they run from the sisters into the woods, where Mayumi tells Yamura that she was with Du Qiu at the time of the murder. They flee to Mayumi's farm, where they defend themselves in a gunfight against the pursuing sisters, accompanied by a gang of armed motorcyclists. During the battle they damage Mayumi's wedding dress, still covered in her fiancé's blood from that day. They are chased outside, where they witness Dawn injecting drugs in order to be able to keep fighting despite her injuries. She collapses then dies in Rain's arms after saying that the drugs were too strong. Rika drives them to the hospital, where Yamura tells her to remove the handcuffs and lets Du Qiu escape.\r\nMamoru Ito is revealed as the one who staged the murder to make Du Qiu look guilty to cover up for the real murderer, Yoshihiro Sakai's son Hiroshi. He demands money from Yoshihiro Sakai but is shot by Rain. Rika has an analysis run on drugs dropped by Ito and finds that they are a strong stimulant. Mayumi calls Rika and gives her the secret formula for the drug that her fiancé was killed for but is then captured by Rain.\r\nMr. Sakamoto helps Du Qiu get aboard a truck taking test subjects to Tenjin's laboratories where torturous tests are conducted on them. Mr. Sakamoto is given a drug that makes him a relentless killer. He kills several of the other prisoners before begging Du Qiu to kill him and then impaling himself on a sharp stick. Yoshihiro Sakai reassures a foreign investor that his new drug allows the mind of the subject to be controlled in order to create a more controllable killing machine. He recognizes Du Qiu and has him strapped into a machine to test his resistance to pain. Yamura arrives and offers to tell the formula to the Sakais in exchange for Du Qiu. Rain, upset about Tenjin's treatment of her sister, releases Mayumi. Yoshihiro gives Du Qiu the new drug and forces him to fight Yamura but Yamura convinces him to resist the drug and they join together to fight the guards. Yoshihiro orders Rain to kill them but she shoots the guards instead. Hideo injects himself with the new drug to prove its effects and continues fighting even after being shot several times by Yamura and Du Qiu. He begins to strangle Mayumi but is shot by Yamura. As he is dying he confesses that Du Qiu just showed up at the wrong time after Hideo had murdered the woman. He lunges at Yamura, who shoots him several more times until he is dead. Yoshihiro shoots Rain and Du Qiu but is then shot dead by them and Yamura. Du Qiu tells Rain to stay strong but as she dies she insists that old movies always end this way. Yoshihiro says that he is going to be with his son and shoots himself in the head. At that moment Rika arrives with the police to rescue the survivors and Yamura gives her a sample of the drug that he grabbed from the laboratory. The final scene shows Yamura at a train station bidding Du Qiu farewell, \"for a better tomorrow.\""
  },
  {
      "Release Year": 2017,
      "Title": "Angels Wear White",
      "Origin/Ethnicity": "Chinese",
      "Director": "Unknown",
      "Cast": null,
      "Genre": "drama",
      "Wiki Page": "https://en.wikipedia.org/wiki/Angels_Wear_White",
      "Plot": "Mia (Vicky Chen), a teenager, works as a cleaner in a motel in a small seaside town. One night, while manning the reception for her co-worker Lili (Peng Jing), she witnesses an assault of two 12-year-old schoolgirls by a middle-aged man. Through the surveillance TV, she sees the man forces himself into the girls' room and records the whole incident with her hand phone. Mia keeps quiet for fear of losing her job. However, for one of the victims, Xiaowen (Zhou Meijun) realises that her troubles have only just begun. As Mia and Xiaowen find themselves in ever harrowing circumstances and nowhere to run, they have to work together to find their own way out.[2][3][4][5]"
  },
  {
      "Release Year": 2017,
      "Title": "Love Is a Broadway Hit",
      "Origin/Ethnicity": "Chinese",
      "Director": "Peter Lee",
      "Cast": "Wang Likun, Godfrey Gao, Li Yuan, Wang Chuanjun",
      "Genre": "comedy / romance",
      "Wiki Page": "https://en.wikipedia.org/wiki/Love_Is_a_Broadway_Hit",
      "Plot": "Two Asian performers attempting to make it in New York City are brought together by serendipity, only to become rivals vying for the lead role of Mulan on Broadway.[1]"
  },
  {
      "Release Year": 2017,
      "Title": "S.M.A.R.T. Chase",
      "Origin/Ethnicity": "Chinese",
      "Director": "Charles Martin",
      "Cast": "Orlando Bloom, Leo Wu, Simon Yam, Lynn Hung, Hannah Quinlivan",
      "Genre": "action / crime / adventure",
      "Wiki Page": "https://en.wikipedia.org/wiki/S.M.A.R.T._Chase",
      "Plot": "Danny Stratton, a washed-up private security agent, is given the rare opportunity to escort a valuable Chinese antique out of Shanghai, but is ambushed en route. With the safety of the woman he loves in jeopardy, Danny has to work with his Security Management Action Recovery Team members to save her, as a dreadful conspiracy begins to unravel."
  },
  {
      "Release Year": 2017,
      "Title": "Never Say Die",
      "Origin/Ethnicity": "Chinese",
      "Director": "Song Yang Zhang Chi-yu",
      "Cast": "Allen, Ma Li, Shen Teng",
      "Genre": "comedy",
      "Wiki Page": "https://en.wikipedia.org/wiki/Never_Say_Die_(2017_film)",
      "Plot": "A male boxer switches bodies by accident with a female journalist after the two are struck by lightning. Living out each other's lives in seemingly opposite roles, the two struggle to adjust, but eventually come to grips with each other, unearthing an even greater conspiracy within the boxing world."
  },
  {
      "Release Year": 2017,
      "Title": "The Foreigner",
      "Origin/Ethnicity": "Chinese",
      "Director": "Martin Campbell",
      "Cast": "Jackie Chan, Pierce Brosnan",
      "Genre": "action",
      "Wiki Page": "https://en.wikipedia.org/wiki/The_Foreigner_(2017_film)",
      "Plot": "Ngoc Minh Quan, a Chinese Nuang chef, runs a Chinese restaurant in London. When his teenage daughter Fan is killed in a clothing store bombing, a distraught Quan seeks revenge. The bombing is claimed by a group calling themselves the \"Authentic UDI\" in the film version released in Europe and \"Authentic IRA\" in the version released in certain other countries.[4][5] He first attempts to bribe Scotland Yard officer Richard Bromley for the names of the bombers, but Bromley refuses to accept the bribe or reveal any information. Quan next focuses on the Northern Ireland deputy First Minister Liam Hennessy, who speaks publicly about his status as a former UDI (read: IRA) leader while condemning the bombing. Keyi Lam, Quan's colleague and personal friend, attempts to console and convince him to move on, but he refuses to be swayed and eventually leaves for Belfast to meet Hennessy. Hennessy claims to have no knowledge of the bombing or its perpetrators, but Quan does not believe him. His queries escalate until he becomes fixated on Hennessy, setting off a homemade bomb in his office and threatening more unless he gets the bombers' names.\r\nThe truth is that Hennessy, while having ordered the bombings to come with warnings as part of a political ploy to solidify the radical factions, does not actually know who the bombers are, as they are rogue members of the UDI. He is in fact outraged that no warnings were given and civilians were killed. Hennessy tries to identify the bombers by changing the code words they use after any bombings are carried out, but the rogue members catch on and outwit him. Meanwhile, he sends numerous mercenaries and personal enforcers after Quan, who manages to escape or defeat all of them. He also observes Hennessy meeting with his mistress, Maggie, and takes a picture of them kissing. Quan then brings the fight to Hennessy, hiding in the woods outside his Belfast farmhouse and attacking it with more homemade bombs. As Hennessy's men attempt to track him in the woods, Quan uses traps to disable a group of three and attempts to interrogate one of them, but he is shot in the shoulder by a fourth mercenary and flees. Hennessy decides to send for his nephew Sean Morrison, who was part of the Royal Irish Regiment with Bromley, after Quan in hopes that his tracking skills can be used to stop him for good.\r\nAs Quan heats up a knife to cauterise the gunshot wound, he faints and has flashbacks of his escape from Vietnam to Singapore by sea, where he and his family are attacked by Thai pirates. He and his wife look on hopelessly as his two daughters are taken away to be raped and murdered by the pirates. As he tried to fight off the pirates, he and his wife were shot and both fell overboard. His wife later died giving birth to their daughter, Fan. Hennessy receives files from the British government on Quan's true background: a former Vietnam War special operations forces soldier who was trained by the US Army.\r\nAfter a second bombing on a double-decker bus, Hennessy negotiates with British politician Katherine Davies and promises the capture of the bombers in exchange for the pardoning of some of his former UDI comrades. Meanwhile, Bromley manages to identify the bombers and relays their identities to Hennessy, who then relays the information to Sean. After a knife fight in the woods, Quan manages to capture Sean, who reveals the name of one of the bombers: Patrick O'Reilly, who was also behind the bombing that killed Quan's daughter. In return, Quan decides to let Sean go. Hennessy, meanwhile, interrogates his head enforcer McGrath, discovering that the true mastermind is Mary, Hennessy's wife, who also hired Maggie; she has never let go of her anger at the British for the death of her brother and resents Hennessy's working for them. Hennessy executes McGrath for his betrayal and for involving his wife and mistress, then orders Sean to execute Mary—with whom Sean is having an affair—before returning to America.\r\nAs the police prepare to raid the bombers' hideout, Quan manages to enter first under the pretense of fixing a gas leak and single-handedly kills all but Maggie. Quan leaves just before the police raid the apartment and find a severely wounded Maggie, whose real name is Sara McKay. They torture her into revealing the location of their next bomb, which has been planted in a laptop computer, to be detonated on a plane going to a security conference in Rome. British police manage to find and throw the laptop into an empty jet bridge, where it detonates without casualties. With the threat resolved, Bromley orders the operation leave \"no loose ends\", which results in Maggie's execution. Hennessy gets a call from Davies, who tells him that he will retain his position as a politician but will be under her thumb.\r\nQuan confronts Hennessy and shows him the picture of Hennessy kissing Maggie, which is enough to throw suspicion on Hennessy and his role in the bombings, as well as expose his affairs if the public sees it. Quan forces him to post the picture to the internet, telling him that he should be ashamed of himself and the whole world will know that he is a terrorist. Meanwhile, Bromley realizes Quan's role in the events and has him put under surveillance, but decides not to take any further action as a way to thank him for his involvement.\r\nThe film ends with Quan returning to his restaurant and Lam embracing him as he puts the past behind him."
  },
  {
      "Release Year": 2017,
      "Title": "Soul on a String",
      "Origin/Ethnicity": "Chinese",
      "Director": "Zhang Yang",
      "Cast": "Kimba, Quni Ciren, Siano Dudiom Zahi",
      "Genre": "drama",
      "Wiki Page": "https://en.wikipedia.org/wiki/Soul_on_a_String",
      "Plot": "Tabei (塔贝) is a hunter who had killed countless animals. Once, when he hunting a deer, he is killed by lightning. But is isn't long before that he is saved by the Gautama Buddha, who orders him to escort a treasure to a holy land of Tibetan place named \"Zhangwendi\"."
  },
  {
      "Release Year": 2017,
      "Title": "Paradox",
      "Origin/Ethnicity": "Chinese",
      "Director": "Wilson Yip",
      "Cast": "Louis Koo, Tony Jaa, Wu Yue",
      "Genre": "action",
      "Wiki Page": "https://en.wikipedia.org/wiki/Paradox_(2017_film)",
      "Plot": "When Hong Kong police negotiator Lee Chung-chi (Louis Koo) is informed about the sudden disappearance of his 16-year-old daughter Lee Wing-chi (Hanna Chan) during her trip to Pattaya, he decides to travel to Thailand to search for her daughter's whereabouts. There Lee receives assistance from local Chinese detective Chui Kit (Wu Yue) and his Thai colleague Tak (Tony Jaa) and also encounters American gangster Sacha (Chris Collins).\r\nClues connect the disappearance of Lee's daughter to a case involving the mayoral candidate of Bangkok's urgent need for a heart transplant. Lee also suspects the mayoral candidate's assistant Cheng Hon-sau (Gordon Lam) of colluding with Sacha to abduct his daughter. While suffering from the loss of his beloved daughter, Lee kidnaps corrupt officer Ban (Ken Lo) in order to get to the bottom of the case. As a result, Lee becomes a nationwide wanted criminal. Seeking revenge, Lee can only ask Chui to assist him in finding the whereabouts of his daughter."
  },
  {
      "Release Year": 2017,
      "Title": " Three Summers",
      "Origin/Ethnicity": "Australian",
      "Director": "Ben Elton",
      "Cast": "Robert Sheehan, Rebecca Breeds, Jacqueline McKenzie",
      "Genre": "comedy",
      "Wiki Page": "https://en.wikipedia.org/wiki/Three_Summers",
      "Plot": "The film's main plotline revolves around a blossoming romance between its two leads, pretentious theremin player Roland (Robert Sheehan) and down-to-earth pub band fiddler Keevy (Rebecca Breeds)\r\nThe film also had a subplot about a racist bigot (played by Michael Caton) meeting a refugee boy and a group of indigenous folk dancers and learns the error of his ways.\r\nThe film contains several running gags, revolving around feminist singer Diamond and her renditions of classic Australian songs and poems and a stern security guard who upholds the rules."
  },
  {
      "Release Year": 2017,
      "Title": " Tarnation",
      "Origin/Ethnicity": "Australian",
      "Director": "Daniel Armstrong",
      "Cast": "Daisy Masterman, Jasy Holt, Sean McIntyre",
      "Genre": "horror",
      "Wiki Page": "https://en.wikipedia.org/wiki/Tarnation_(2017_film)",
      "Plot": "Oscar's dreams of becoming a rockstar are destroyed when she's kicked out of the band and her boyfriend walks out on her, taking their cat, and goes out to a remote cabin in the woods near the ghost town of Tarnation to collect her thoughts. Unbeknownst to her, the satanic master of a demon unicorn seeks Oscar's blood to complete a ritual that will raise the devil from Hell. In order to stop Tarnation from falling upon the world, Oscar must battle a demonic force that can possess anyone in the woods and ultimately face the evil within her own soul."
  },
  {
      "Release Year": 2017,
      "Title": " Sweet Country",
      "Origin/Ethnicity": "Australian",
      "Director": "Warwick Thornton",
      "Cast": "Sam Neill, Bryan Brown, Thomas M. Wright, Matt Day",
      "Genre": "western",
      "Wiki Page": "https://en.wikipedia.org/wiki/Sweet_Country_(2017_film)",
      "Plot": "Sam is a middle-aged Aboriginal farmer in the outback of Australia's Northern Territory. He is sent by a preacher to help a bitter war veteran named Harry to help renovate the latter's cattle yards. Sam's relationship with Harry quickly deteriorates, resulting in a fight ending with Sam killing Harry in self-defence. For the murder of a white man, Sam is now on the run from the law with his wife across the deadly outback. A manhunt for the farmer is on, led by Sergeant Fletcher, but questions of justice start to surface among the community as the true details of the murder come to light."
  },
  {
      "Release Year": 2017,
      "Title": " The Osiris Child: Science Fiction Volume One",
      "Origin/Ethnicity": "Australian",
      "Director": "Shane Abbess",
      "Cast": "Kellan Lutz, Daniel MacPherson, Isabel Lucas",
      "Genre": "sci-fi",
      "Wiki Page": "https://en.wikipedia.org/wiki/Science_Fiction_Volume_One:_The_Osiris_Child",
      "Plot": "\"Set in a time of interplanetary colonization, Sy Lombrok (Kellan Lutz), a former nurse who is now a drifter with a haunted past, forms an unlikely alliance with Kane Sommerville (Daniel MacPherson), a lieutenant who works for off-world military contractor Exor. In a race against time, they set out to rescue Kane's young daughter Indi (Teagan Croft) amid an impending global crisis precipitated by Exor.\""
  },
  {
      "Release Year": 2017,
      "Title": "Downsizing",
      "Origin/Ethnicity": "American",
      "Director": "Alexander Payne",
      "Cast": "Alexander Payne (director/screenplay); Jim Taylor (screenplay); Matt Damon, Christoph Waltz, Hong Chau, Kristen Wiig",
      "Genre": "sci-fi, comedy, drama",
      "Wiki Page": "https://en.wikipedia.org/wiki/Downsizing_(2017_film)",
      "Plot": "In the future, searching for a way to solve overpopulation and global warming, a scientist invents \"downsizing\", a process to shrink people to a height of five inches. Paul and Audrey Safranek, a married couple in Omaha with financial problems, meet Dave and Carol Johnson, who have downsized. While the inventors advocate that downsizing is environmentally friendly through the reduction of waste, Dave argues that its benefits extend far beyond that and improve one's life through the increase in value of their money.\r\nExploring the possibilities of downsizing, Paul and Audrey agree to undergo the process and move to Leisureland, one of the most popular communities for small individuals. After undergoing downsizing, Paul receives a call from Audrey, saying that she was unable to go through the procedure and, by opting out at the last minute, will be leaving him.\r\nOne year later, Paul finalizes the divorce with Audrey, and settles in to his new apartment (ironically, a downsizing of its own from the mansion he was to originally share with Audrey). Although Paul had anticipated a life of relative ease, without Audrey's share of their assets, and with Paul's share shrunken further still due to divorce settlement negotiations, he works as a customer service representative for Lands' End. While attending a birthday party, Paul has a discussion with Dave and says that he regrets his decision to downsize. Soon after, Paul breaks up with his girlfriend and attends a party hosted by his neighbor Dušan.\r\nThe next morning, Paul notices that one of Dušan's housecleaners is Ngoc Lan Tran, a Vietnamese political activist who was jailed and downsized against her will. Ngoc Lan was the sole survivor of a human smuggling attempt to the United States in a television box and had her leg amputated upon arrival. Attempting to assist Ngoc Lan with her prosthetic leg, Paul returns to her house in the slums outside of the walls of Leisureland. After assisting Ngoc Lan's dying friend, Paul attempts to repair Ngoc Lan's prosthetic leg only to break it and render her unable to work. In return, Paul works for Ngoc Lan's cleaning service where he also assists in gathering food from around the city that Ngoc Lan distributes throughout the slums. Dušan attempts to release Paul from his obligation by taking him to Norway, the site of the first small community, with his friend Joris Konrad, but Ngoc Lan also wishes to come along. Ngoc Lan had received international attention after her arrival in the United States, including personal correspondence from the inventor of downsizing, Dr. Jørgen Asbjørnsen, who had previously invited her to Norway to express his regret at the abuse of his procedure.\r\nWhile traveling in a fjord, Paul's boat encounters Dr. Asbjørnsen and his wife, Anne-Helene. Dr. Asbjørnsen announces that humanity is doomed, as the positive feedback of Arctic methane emissions cannot be stopped, and will result in the eventual extinction of the human race. Arriving in the first colony, Paul is shown that Dr. Asbjørnsen planned for such a contingency with the creation of a large vault inside a mountain to insulate the colony and preserve humanity in the event of an extinction. Paul is excited to enter the vault and asks Ngoc Lan to join him. She rejects his offer, saying that he does not need to enter the vault and can do good in their community by returning. Paul enters the vault, but changes his mind and leaves as the door is closing and subsequently blasted to seal the occupants inside, choosing to return with Ngoc Lan, Dušan, and Konrad.\r\nHaving returned to Leisureland, Paul assists Ngoc Lan in her duties of providing needed aid and supplies to the people of the slums."
  },
  {
      "Release Year": 2017,
      "Title": "Father Figures",
      "Origin/Ethnicity": "American",
      "Director": "Lawrence Sher",
      "Cast": "Lawrence Sher (director); Justin Malen (screenplay); Owen Wilson, Ed Helms, J. K. Simmons, Terry Bradshaw, Ving Rhames, Katt Williams, Retta, June Squibb, Glenn Close",
      "Genre": "comedy",
      "Wiki Page": "https://en.wikipedia.org/wiki/Father_Figures",
      "Plot": "Kyle (Wilson) and Peter Reynolds (Helms) are fraternal twin brothers who were raised by their mother, Helen (Close), after thinking their father died before they were born. Kyle is dating his pregnant girlfriend, Kaylani, and has been financially successful after receiving royalties for his picture on hot sauce labels. Peter is a divorced proctologist with a teenage son who resents him. Shortly after his mother's wedding, Peter recognizes an actor on Law and Order: SVU as his father from his photo, and confronts his mother at her wedding.\r\nHelen explained that she had been promiscuous at the time of her children's conception, and did not want their father to help raise them. As they press the issue, Helen reveals that their father is Terry Bradshaw. The brothers fly down to Florida to meet Bradshaw, who they encounter at a signing event. Bradshaw is excited to have them as sons, and welcomes them in to his home. As Bradshaw recounts stories with his friend and former teammate, Rod Hamilton (Rhames), Kyle and Peter realize that Bradshaw had been traveling in Australia at the time of their conception, and thus couldn't be their father.\r\nThe brothers are directed to find Roland Hunt (Simmons), a New York investor who dated Helen after Bradshaw. As they travel north, Kyle finds that his royalties deal with the hot sauce company is ending, and he will be unable to support his growing family. Upon arriving at what they assumed was his office, the brothers find a boarded-up house. Hunt, thinking they are robbers, confronts them at gunpoint until they reveal they were looking for him because he dated their mother. He invites them inside, but expresses his dissatisfaction at having children. As the brothers prepare to depart, they offer to help their father in his job, which he claims is a repossession man. As Hunt breaks into a Ferrari, it becomes clear that he is a criminal thief. As the brothers argue with the owners of the Ferrari, Hunt attempts to escape, only to feel remorse for abandoning his sons. The brothers steal the Ferrari and end up hitting Hunt, who was returning to find them. At the hospital, the brothers find that they are incompatible to give Hunt blood, indicating that he cannot be their father. Hunt realizes that he was in prison at the time of their conception, but directs them to find another of Helen's ex-boyfriends named Sparkly P.\r\nUnable to find Sparky P, the brothers prepare to return home. Along the way, they pick up a hitch hiker (Williams), who provides advice as they travel north. After accidentally parking on railroad tracks, Peter and the hitch hiker narrowly escape getting hit by a train, while Kyle is stuck in the car and presumably killed. Initially devastated, Peter is surprised to see Kyle walk away from the car, only to be punched by Kyle for abandoning him. As they are being treated, the police officers recognize the name Sparkly P as Patrick O'Callaghan, a former police officer. As the brothers travel north, they stop at a hotel, where Peter meets and seduces Sarah (Aselton). The next morning, the brothers arrive at Patrick O'Callaghan's house to find a party occurring, only to quickly find out that it is his wake. Patrick's daughter is invited to speak, and Peter realizes that it is Sarah, his presumed half-sister. Disgusted, Peter makes a scene as he runs out of the wake, but is told by Patrick's twin brother, Kevin, that Patrick could not be his father, as he had been celibate while dating Helen. Kevin directs them to contact Dr. Walter Tinkler (Walken), who is a family friend and veterinarian from their home town.\r\nKyle and Peter return home to confront Dr. Tinkler. Helen arrives to explain that Tinkler is not their father, as she is not their biological mother. Helen explains that she had been working at a shelter when a woman came in and gave birth to twins. The mother died during childbirth, and Helen chose to adopt Kyle and Peter instead of having them become foster children. The brothers are happy to have learned their history, and reconcile their differences.\r\nA year later, Kyle, Peter, and Helen are on vacation in Maui. Peter is now dating Sarah, and his son respects him. Kyle and Kaylani had twin daughters. The brothers have gone into business together and created an app that provides advice from the universe, spoken by the hitch hiker."
  },
  {
      "Release Year": 2017,
      "Title": "The Post",
      "Origin/Ethnicity": "American",
      "Director": "Steven Spielberg",
      "Cast": "Steven Spielberg (director); Liz Hannah, Josh Singer (screenplay); Tom Hanks, Meryl Streep, Bruce Greenwood, Jesse Plemons, Bob Odenkirk, Sarah Paulson, Alison Brie, David Cross, Carrie Coon",
      "Genre": "biography, drama, history, thriller",
      "Wiki Page": "https://en.wikipedia.org/wiki/The_Post_(film)",
      "Plot": "In 1966 Vietnam, State Department military analyst Daniel Ellsberg accompanies U.S. troops in combat, documenting the progress of U.S. military activities in the region for Secretary of Defense Robert McNamara. On the flight home, McNamara expresses to Ellsberg and William Macomber his view that the war in Vietnam is hopeless, yet, upon landing, tells the press he has every confidence in the war effort. Ellsberg overhears this and becomes disillusioned. Years later, as a civilian military contractor working for the RAND Corporation, Ellsberg surreptitiously photocopies classified reports documenting the country's decades-long involvement in the conflict in Vietnam, dating back to the Truman administration. Ellsberg then leaks these documents to reporters at The New York Times; the movie follows two weeks in 1971 at The Washington Post and the publishing of the Pentagon Papers.\r\nNewspaper heiress Katharine Graham tries to balance her social life with her responsibility as owner and publisher of The Washington Post, following the deaths of her husband, Phil Graham, and her father, Eugene Meyer. She is troubled over preparations for the newspaper's stock-market launch, a move she recognizes as important for strengthening the paper's economic stability. Graham lacks experience and is frequently overruled by more assertive men who advise or work for her, such as editor-in-chief Ben Bradlee, and board member Arthur Parsons. Bradlee tries in vain to match The New York Times's ability to get scoops. Meanwhile, McNamara, Graham's longtime friend, confides in her that he is to be the subject of unflattering coverage by the Times. The story turns out to be an exposé of the government's long-running deception of the American public. However, the series is halted by a court injunction against further publication by the Times.\r\nPost assistant editor Ben Bagdikian tracks down Ellsberg as the source for the leak, who provides Bagdikian with copies of the same material given to the Times. A hand-picked team of Post reporters sorts through the piles of papers, searching for the headline stories. The lawyers for the Post advise against publishing the material, lest the Nixon administration bring criminal charges against them. Graham talks to McNamara, Bradlee, and trusted Post chairman Fritz Beebe, agonizing over the decision of whether to publish. The situation is made even more complicated when the Post's lawyers discover that Bagdikian's source is the same as the Times's, possibly putting Graham in contempt of court. If charges are brought against the company, Graham could destroy the newspaper she sees as a family legacy. Alternately, if she were to win any legal challenge, the Post could instead establish itself as an important journalistic institution. She chooses to run the story.\r\nThe White House retaliates, and in short order the Post and Times appear together before the Supreme Court to plead their First Amendment argument for the right to publish the material. Meanwhile, newspapers across the country pick up the story in solidarity with the Post and Times. The court rules 6–3 in the newspapers' favor, vindicating Graham's decision. Nixon demands that the Post should be barred from the White House. One year later, security guard Frank Wills discovers a break-in in progress at the Watergate complex after a guest at the Watergate hotel called complaining about people using flashlights."
  },
  {
      "Release Year": 2017,
      "Title": "Bright",
      "Origin/Ethnicity": "American",
      "Director": "David Ayer",
      "Cast": "David Ayer (director); Max Landis (screenplay); Will Smith, Joel Edgerton, Noomi Rapace, Lucy Fry, Edgar Ramirez",
      "Genre": "action, fantasy, sci-fi",
      "Wiki Page": "https://en.wikipedia.org/wiki/Bright_(film)",
      "Plot": "In an alternate present, humans live in uneasy peace with orcs, elves, centaurs, dwarves and other races after they fought for thousands of years. In Los Angeles, veteran LAPD police officer Daryl Ward has been involuntarily partnered with Nick Jakoby, the nation's first orcish police officer. Jakoby is faced with prejudice by humans for his race, and by orcs for his position as an officer; Ward is ambivalent towards Jakoby after an incident in which he allowed an orc to escape causes Ward to question Jakoby's loyalities. A previously detained human Shield of Light devotee tells Jakoby that both officers are in a prophecy and that Ward is blessed. While booking the devotee, Ward is approached by Internal Affairs who say they believe that Jakoby put his racial loyalties before his partner. Ward is pressured to try to have Jakoby confess on tape so they will have grounds to fire Jakoby.\r\nThat night, Ward and Jakoby respond to a disturbance at what turns out to be a Shield of Light safe house; inside is evidence indicating magic was used. They apprehend the lone unhurt survivor, a young elf named Tikka in possession of a legendary magic wand who apparently only speaks Elfish. As Jakoby puts it, a wand is like \"a nuclear weapon that grants wishes\", and can only be commanded by a 'Bright'—a person with the rare ability to use magic. If a non-Bright touches a wand, they will explode from the raw magical power.\r\nWhen four officers arrive as backup, their racial prejudice cause them to try and coerce Ward into killing Jakoby and lying about the incident, allowing them to steal the wand. Ward goes outside and questions him about the incident earlier with the orc; meanwhile the officers plan to kill Ward. Ward overhears this and decides to believe Jakoby and kills all four officers. The incident, however, attracts the attention of the local human gang Altamira, and the two flee with Tikka and the wand. Leilah, a member of the ominous group Inferni and owner of the wand, arrives at the safehouse minutes later, searching for the wand and Tikka.\r\nThe trio flee through the territory of the Fogteeth Orc clan, with the gang's leader, Poison, wanting to regain the use of his legs through the wand. The Inferni then appear and the ensuing fight gives the trio the opportunity to escape again. At a service station, Ward contacts his friend, Sheriff Deputy Rodriguez, who he hopes will help them in protecting the wand. Rodriguez contacts Kandomere, an elf working for the federal 'Magic Task Force'; dedicated to securing, containing and protecting magical objects. Kandomere tells Ward that he will be safe from prosecution for killing his fellow police officers, if they can keep the wand out of wrong hands. Before Rodriguez can bring them in, Leilah's henchmen attack the trio, killing him.\r\nWard, Jakoby, and Tikka run into the Fogteeth Orc clan again and are dragged before its leader Dorghu. Enraged at the chaos they are causing, Dorghu. He then orders his son, Mikey, to kill Jakoby after failing to find out here the wand is. However, Mikey reveals that he was the orc that Jakoby allowed to escape and thus refuses to kill him. Dorghu sends his son away and kills Jakoby himself. As he prepares to kill Ward, Tikka produces the wand she had magically hidden and uses it to resurrect Jakoby, revealing that she is a Bright. The cloaked clan priest pronounces this to be the will of the Prophecy, causing the clan to kneel to Jakoby and allow the trio to go free. Tikka, now trusting them, speaks to them in English for the first time and explains the Inferni's plan. They wish to resurrect The Dark Lord, an ancient mythical figure who will rise from the dead and take over the world. Once a member of the Inferni herself, Tikka had been protected by the Shield of Light and fled with the wand.\r\nThe use of the wand causes Tikka to become ill and the only way to save her to is place her in a pool back at the house where they found her. They return to the safehouse but are ambushed by Leilah and the remaining Inferni. The trio successfully kill the Inferni, but Leilah is resurrected. Just as Ward places Tikka in the magic pool, Leilah hangs Jakoby and knocks both Ward and Tikka out of the pool. Leilah unsuccessfully tries to convince Tikka to join her. Jakoby breaks free and shoots the wand out of Leilah's hand, but runs out of ammo before he can kill her again. Leilah is about to kill Tikka when Ward picks up the fallen wand and is revealed to also be a Bright, using the wand to kill Leilah with an explosion that sets the building on fire. In the ensuing commotion, Tikka disappears and the injured Ward and Jakoby flee from the building, with Jakoby saving an injured Ward. After rescuing Ward, Dorghu and his clan appear and perform an ancient orc ceremony signifying to Jakoby that he is now \"blooded\" - an Orcish status only achievable by an act of great bravery.\r\nWard awakens the next day in a hospital room to find Jakoby at his bedside and himself restrained as he is an \"extremely dangerous\" Bright. As Kandomere appears, Ward understands (but Jakoby does not) that Kandomere wants to contain the incident, and gives him a fake statement as to what happened, denying the use of magic. In a public announcement before a crowd, Jakoby and Ward are honored by the city for their actions against the 'extremist group' Inferni. Ward smiles as he spots Tikka moving through the crowd in disguise."
  },
  {
      "Release Year": 2017,
      "Title": "Crooked House",
      "Origin/Ethnicity": "American",
      "Director": "Gilles Paquet-Brenner",
      "Cast": "Gilles Paquet-Brenner (director/screenplay); Tim Rose Price, Julian Fellowes (screenplay); Max Irons, Glenn Close, Gillian Anderson, Christina Hendricks, Terence Stamp",
      "Genre": "crime, drama, mystery",
      "Wiki Page": "https://en.wikipedia.org/wiki/Crooked_House_(film)",
      "Plot": "The granddaughter of late business tycoon Aristide Leonides, Sophia Leonides, visits private investigator Charles Hayward in his office. Sophia hires Charles to investigate Aristide's death, for she believes he was murdered by a member of his sprawling and idiosyncratic family. Sophia notes that Leonides' regular insulin injection had been laced with eserine from his eye drops, the resulting chemicals in them causing him to die. Sophia believes this to have been a deliberate switch rather than accidental. Charles begrudgingly agrees to take on the case as a result of his feelings for Sophia as the two had enjoyed a brief love affair when they had met sometime prior in Cairo. Charles seeks the consent of Chief Inspector Taverner of Scotland Yard to look into the case, utilising his personal connection with Taverner, who had served with Charles's father, a decorated former Assistant Commissioner who was murdered.\r\nCharles visits the Leonides estate and proceeds to interview the various members of the family, finding various motives from each. Charles begins with Lady Edith De Haviland, the sister of Leonides's first wife, who despised her brother-in-law and his callous attitude towards her grandchildren. Leonides's eldest son, Philip, hated his father for passing him over to run the family business and for refusing to take interest in a new play he'd written for his wife, Magda, a fading theatre actress. Philip and Magda provided Leonides with three grandchildren, namely Sophia and the precocious younger children Eustace and Josephine. Eustace takes a dislike to Charles and seeks to hamper him where possible whilst Josephine makes clear to Charles that she eavesdrops on everyone around the house, makes notes about their private lives and dislikes most of her family except for Edith and Sophia.\r\nCharles subsequently finds that Leonides' younger son, Roger, the emotionally immature managing director of the family's flagship business, was reliant upon his father bailing out the business numerous times due to his poor management. The fact that Leonides was so willing to bail Roger out did not sit well with either Roger, due to his pride, or his domineering wife Clemency. Charles further finds that Leonides' second wife, Brenda, a much younger former Las Vegas casino dancer, is suspected by the rest of the family as having committed the murder. Evidence seems to back this up due to the facts that Brenda had been having an affair with Laurence Brown, the private tutor for the Leonides children, as well as that she administered the fatal dose of drugs to Leonides and that she stood to inherit the entirety of the Leonides estate due to him not having signed a will, meaning he died intestate and thus his estate passed to her.\r\nCharles's investigations and questions are met with hostility by most of the family whilst Josephine cryptically hints at clues along the way, to Charles's irritation, as he finds her treating the investigation as a game to be tiresome. Events take a new, horrific turn when the ladder to Josephine's treehouse is sabotaged and she falls from the tree, being hospitalised as a result. Charles suspects that this was due to Josephine's habit of spying on the other family members and the killer thus wanting to silence her. In the aftermath, Charles's suspicions are heightened and even extend to Sophia after a new will is discovered in which Leonides had left his estate to her, with some arguing that Sophia hired Charles to investigate the murder due to their personal history, knowing he would never accuse her due to their romantic past.\r\nAfter those developments, Taverner arrives in person to take charge of the case as he feels Charles' romantic history with Sophia does not make him objective enough to solve it. The discovery of love letters between Brenda and Laurence gives Taverner enough evidence to arrest them for Leonides' murder and the attempt on Josephine, to the delight of most of his family members who had always hated both. Charles, however, remains unconvinced that Brenda and Laurence are guilty, noting Brenda's childlike intelligence and Laurence's pacifist, left-wing views as making them unlikely candidates for being a murderer. Sophia and Edith seem to agree, with Sophia noting how the letters could have been forged and Edith paying for a top rate lawyer to represent Brenda and Laurence in court. In the meantime, however, Charles returns to London and only returns to the estate when Josephine's nanny dies after being poisoned by drinking a mug of hot chocolate that she had made for Josephine.\r\nCharles implores Josephine to tell her who the killer is as he has worked out she knows their identity. Again, Josephine refuses to tell. After it is established that the nanny died of cyanide poisoning, Charles begins to suspect Edith as he knew she had been using cyanide to remove moles in the estate garden. His search of Edith's garden shed finds a bottle of cyanide as well as Josephine's missing notebook, complete with her notes on each member of the family. Edith drives out of the family estate with Josephine, having also left a note for Charles to find. Charles and Sophia take off in pursuit of Edith in a car chase to try and stop them. In the car, Sophia reads the note that Edith had left in which she confesses to the murder but Charles argues that he believes Edith is not the killer.\r\nSophia reads extracts from Josephine's notebook in which the child admits to murdering Leonides purely because he had refused to pay for her ballet lessons. The notebook further reveals that Josephine had also faked the attack on herself and had poisoned her nanny when the latter began to suspect Josephine. Lady Edith had worked out that Josephine was the killer and planted evidence and wrote the confession note to spare Josephine a life in psychiatric institutions and exonerate Brenda and Laurence. Edith had earlier been informed that she was dying of cancer and so decided to sacrifice herself to protect Josephine and the rest of the family. Edith realises that Charles and Sophia are pursuing her and so she drives her car over the clifftop of a quarry, killing herself and Josephine. The film ends as Charles comforts a shocked Sophia at the edge of the cliff."
  },
  {
      "Release Year": 2017,
      "Title": "Hostiles",
      "Origin/Ethnicity": "American",
      "Director": "Scott Cooper",
      "Cast": "Scott Cooper (director/screenplay); Donald E. Stewart (screenplay); Christian Bale, Rosamund Pike, Wes Studi, Q'orianka Kilcher, Ben Foster, Adam Beach, Rory Cochrane, Jesse Plemons, Timothée Chalamet",
      "Genre": "western",
      "Wiki Page": "https://en.wikipedia.org/wiki/Hostiles_(film)",
      "Plot": "In 1892, settler Wesley Quaid and his family are attacked by a Comanche war group proceeding to kill and scalp him and to shoot his three children. Only his wife Rosalee manages to escape from the attack, hiding in a small rock outcrop in the forest.\r\nIn Fort Berringer, New Mexico, Captain Joseph Blocker rounds up an escaping Apache family and brings them back to the fort. He is then called to the office of Colonel Abraham Biggs, who informs him of his final orders before retirement, based on a directive from the President: escort dying Cheyenne war chief Yellow Hawk, along with his family, back to their tribal lands in Montana. Under threat of a court-martial and loss of his pension if he refuses to follow the orders, Blocker reluctantly accepts, despite his own gory history with the chief, who was responsible for the death of several of his friends and comrades. Blocker chooses the detail that will accompany him: his trusty old friend Sergeant Thomas Metz, long-time aide Corporal Woodson, and promising newcomer Lieutenant Kidder, fresh from West Point. Biggs also assigns to the detail a young French-speaking recruit, Private DeJardin.\r\nThey begin their journey but Blocker orders a stop and has the two native men put in chains. The group comes across the charred Quaid house and dead settler. Inside the house they find Rosalee and her three \"sleeping\" children. Rosalee is initially hostile towards the Cheyenne family because of the attack on her family but agrees to sleep in their camp after some coaxing from Blocker. She's convinced to bury her family and join Blocker's detail until their next stop-over. They are soon ambushed by the Comanche party, resulting in DeJardin's death and Woodson being seriously wounded. After this attack, Yellow Hawk convinces Blocker that it is in everyone's best interest to unchain him and his family. The next day, the bodies of the surviving Comanche party, who had managed to flee during their previous encounter, are discovered dead. Blocker deduces that Yellow Hawk and his son, Black Hawk, killed them thanks to Metz allowing them to leave the camp during the night.\r\nAfter a brief stop at Fort Winslow in Colorado to drop off the wounded Woodson and Rosalee, Blocker is instructed to take disgraced Sergeant Charles Wills, who killed a family with an ax, to be court-martialed and hanged at a stop at his original post along the way to Montana. Joining Blocker’s company to oversee Wills are Corporal Tommy Thomas and Sergeant Malloy. Meanwhile, Rosalee decides to continue on with Blocker, despite being offered sanctuary at Fort Winslow until the next supply train at Christmas. One night, the women are abducted and raped by three fur traders as they wash dishes in the stream by their camp. The company, assisted by Yellow Hawk and Black Hawk, manages to track down the fur traders and slaughter them to rescue the women; however, Sergeant Malloy is killed. During a downpour, Wills manages to fool Kidder into sympathetically undoing his chains, only to kill him and escape but not before Blocker shoots him. He is later tracked down by Metz, who then takes his own life, succumbing to decades of PTSD.\r\nBlocker arrives with the dying chief at his tribal lands in Montana where he dies and is buried. The white landowner and his three sons arrive to the place as the chief is buried and threatens Blocker and the rest of the group for burying an Indian on his land. Blocker tells the landowner that the chief is not leaving the land. The confrontation results in a brutal gun battle killing Black Hawk, his wife Elk Woman, his sister Living Woman, and Corporal Tommy Thomas, while leaving alive only Blocker, Rosalee, and Black Hawk's young son, Little Bear. In the final scene, Rosalee and Little Bear reluctantly depart on a train from Montana to Chicago, without Blocker, but, at the last second, Blocker jumps on the back of the train."
  },
  {
      "Release Year": 2017,
      "Title": "All the Money in the World",
      "Origin/Ethnicity": "American",
      "Director": "Ridley Scott",
      "Cast": "Ridley Scott (director); David Scarpa (screenplay); Michelle Williams, Mark Wahlberg, Christopher Plummer, Timothy Hutton, Charlie Plummer",
      "Genre": "biography, crime, drama",
      "Wiki Page": "https://en.wikipedia.org/wiki/All_the_Money_in_the_World",
      "Plot": "In 1973, 16-year-old John Paul Getty III (Paul), grandson of oil tycoon J. Paul Getty who was at that time the world's richest private citizen, is kidnapped in Rome by an organized crime ring. The kidnappers demand a ransom of $17 million. Flashbacks show that Paul's parents, Gail Harris and John Paul Getty Jr., were divorced in 1971 due to Getty Jr.'s drug addiction and that Gail rejected any alimony in exchange for full custody of her children in the divorce settlement; therefore she does not have the means to pay the ransom. She travels to Getty's estate to beseech him to pay the ransom but he refuses, stating that it would encourage further kidnappings on his family members. The media picks up on the story, with many believing Gail to be rich herself and blaming her for the refusal to pay the ransom. Meanwhile, Getty asks Fletcher Chace, a Getty Oil negotiator and former CIA operative, to investigate the case and secure Paul's release.\r\nPaul is kept hostage in a remote location in Italy. Initially his captors, particularly Cinquanta, are tolerant with him because his quiet and submissive demeanor causes them few problems. However, things grow increasingly tense as weeks go by without the ransom being paid, far longer than the captors anticipated. Arguments arise over whether to move Paul to a new location as winter is approaching and their hideout is not suitable for cold conditions. Things get worse when one of the kidnappers accidentally shows his face to Paul, prompting one of the others to kill the man for his foolish mistake. His burned and disfigured body is recovered in the river; investigators erroneously identify the body as Paul's, but Gail examines the body and refutes this.\r\nUsing the new lead of the body, Chace is able to pinpoint the hideout where Paul is being held. A raid is conducted with several kidnappers being killed, but Paul is no longer there; he had been sold on to a new crime organization. The new captors are much less patient with Paul and negotiate more aggressively with the Getty family to receive their payment. After repeated negotiations with Gail and Chace, and frustration from the captors at how long the process was taking, they lower the asking price to $4 million. Getty finally decides to contribute to the ransom, but only $1 million – this being the maximum amount that he can claim as tax deductible. Moreover, he also will only do so if Gail signs a legal document waiving her parental access rights to Paul and her other children, giving them to Getty's son, her ex-husband. She reluctantly signs them.\r\nThe kidnappers cut off one of Paul's ears and mail it to a major newspaper, claiming that they will continue mutilating him until the ransom is paid. Berated by an exasperated Chace, Getty finally relents and agrees to pay the full ransom, also voiding the parental agreement with Gail. Gail and Chace take the money to Italy and follow specific instructions from the captors, leaving the money in a remote location and receiving orders to pick up Paul from a construction site. However, a frightened Paul runs away from the site towards the nearest town, miles away. Meanwhile the captors realize that Chace has broken his word and led the police to them; angry, they decide to find and kill Paul. Chace, Gail, and the captors arrive at the town to look for Paul. One of the kidnappers finds Paul first, but Cinquanta attacks the man in order to allow Paul to escape. Chace and Gail find Paul and smuggle him out of the country to safety.\r\nGetty dies of unrelated causes, and Gail is tasked with managing her children's inherited wealth until they are of age. The company was set up as a charitable trust, which meant that Getty's income was tax-free but also not spendable. He had invested much of it in paintings, sculptures and other artifacts, most of them now reside in the Getty Museum in Los Angeles."
  },
  {
      "Release Year": 2017,
      "Title": "Molly's Game",
      "Origin/Ethnicity": "American",
      "Director": "Aaron Sorkin",
      "Cast": "Aaron Sorkin (director/screenplay); Jessica Chastain, Idris Elba, Kevin Costner, Brian d'Arcy James, Michael Cera, Chris O'Dowd, Bill Camp, Jeremy Strong",
      "Genre": "biography, crime, drama",
      "Wiki Page": "https://en.wikipedia.org/wiki/Molly%27s_Game",
      "Plot": "Molly Bloom is world-class mogul skier with Olympic aspirations, the result of years of enforced training from her overbearing father. In a qualifying event for the 2002 Winter Olympics, Molly is severely injured, ending her career.\r\nInstead of following her original plan of attending law school, Molly decides to take a year off and move to Los Angeles. Once she arrives, she becomes a bottle-service waitress at a club, where she meets Dean, an ostentatious but unsuccessful real estate developer. She becomes his office manager, and he soon involves her in running his underground poker games. Many famous and wealthy individuals, such as movie stars, investment bankers, and sports players, are involved in Dean's game. Molly earns large sums of money on tips alone.\r\nMolly is initially uninformed on poker topics but quickly learns how to appeal to the players to gain tips. In particular, she hopes to please the most successful player, Player X, by attracting new players to the game. Dean, upon seeing that Molly is becoming increasingly independent in running the games, attempts to control her, and then he fires her. Molly, having gained contacts through years of running the game, decides to create her own poker games. She rents a penthouse at a hotel and hires a staff to help her run games. Additionally, she contacts employees at clubs and casinos to try and spread word about her poker games. Player X, along with many other players, decides to leave Dean's games to play at Molly's game. Molly becomes increasingly successful, gaining more money while being pressured by Player X to raise the stakes for her games. Harlan Eustice, a skilled, conservative, and successful player, joins Molly's game. One night, after accidentally losing a hand to the notorious worst player in Molly's circle, Harlan becomes increasingly compulsive, suffering heavy losses (later, Molly finds out that Player X, who enjoys ruining people's lives more than the game itself, has been funding Harlan to keep him in the game). After Molly berates him for his unethical actions, Player X decides to change venue for his games, and the other players join him, leaving Molly.\r\nMolly moves to New York, with the hope of beginning a new underground poker game. After reaching out to many wealthy New Yorkers, Molly finds enough players for several weekly games. Despite continuous success, she is unable to cover her losses when players cannot pay. Her dealer convinces her to begin taking a percentage of large pots, allowing her to recoup her potential losses but making her game an illegal gambling operation. One of her Los Angeles players is indicted for running a Ponzi scheme; Molly is investigated and questioned as to who attended her games. At this time, Molly becomes increasingly addicted to drugs, as the games have increasingly taken their toll. Her players also begin to include wealthy individuals from the Russian mafia, among others. She is approached by several Italian mafia members who offer their services to extort money from non-paying players. After she declines, she is attacked in her home, where she is held at gunpoint and her mother's life is threatened. As she is about to return to her poker games, the FBI conducts a raid, a result of Douglas Downey, one of her players, acting as an informant. Molly's assets are seized, and she returns home to live with her mother.\r\nTwo years later, Molly has moved out and published a book where she names a few individuals that played in her games. She is arrested by the FBI and indicted for involvement in illegal gambling with the mafia. She enlists the help of Charlie Jaffey, a high-profile and expensive lawyer in New York, who agrees to help after he learns that she has been protecting innocent people who were affected by her poker games. While she is in New York awaiting trial, her father, Larry, seeks her out and attempts to reconcile with her. He admits that he was overbearing and that he treated Molly differently than her brothers because she had known about his affairs. Charlie reads Molly's book and becomes interested in helping her case, as he feels she has not committed serious enough wrongdoing to merit a prison term. Charlie negotiates a deal for Molly to receive no sentence and for her money to be returned in exchange for her hard drives and digital records from gambling. Molly declines this deal, fearing that the information about her players would be released, and she pleads guilty. The judge, deciding that she had committed no serious crimes, sentences her to community service, probation, and a $200,000 fine."
  },
  {
      "Release Year": 2017,
      "Title": "Phantom Thread",
      "Origin/Ethnicity": "American",
      "Director": "Paul Thomas Anderson",
      "Cast": "Paul Thomas Anderson (director/screenplay); Daniel Day-Lewis, Lesley Manville, Richard Graham, Vicky Krieps",
      "Genre": "drama",
      "Wiki Page": "https://en.wikipedia.org/wiki/Phantom_Thread",
      "Plot": "In 1954 London, renowned fashion designer Reynolds Woodcock creates dresses for members of high society. His charisma and genius are matched by his obsessive, controlling and sometimes abusive personality. Cyril, his sister, manages the day-to-day operations of his fashion house and has significant influence over his life. Reynolds is haunted by the death of their mother, and stitches hidden messages into the linings of the dresses he makes.\r\nAfter designing a new gown for a revered client, Reynolds visits a restaurant in the countryside and becomes interested in a waitress, Alma. He asks her on a date, and she accepts. Their relationship develops, and she moves in with him, becoming his assistant, muse and lover. Cyril initially distrusts Alma but comes to respect her willfulness and determination.\r\nAt first, Alma enjoys being a part of Reynolds' work, but he proves aloof and hard to please, and they bicker. When Alma tries to surprise him with a romantic dinner, Reynolds lashes out and they fight. Alma wonders aloud what she is doing in his house beyond either waiting for him to pay attention to her or ask her to leave.\r\nIn order to regain her power in their relationship and to punish and make Reynolds more vulnerable and needy, Alma laces his tea with a small amount of poisonous mushroom gathered outside his country house. The next morning, dizzy and sweating, while he readies a wedding gown for a Belgian princess, he collapses, damaging the dress and forcing his staff to work all night to repair it. He becomes gravely ill and sees his mother in the room; he tells her how much he misses her. Alma nurses him through his fever; when Cyril brings in a doctor, first Reynolds and then Alma tell the doctor to \"Fuck off.\" When Reynolds is well again, he asks Alma to marry him, telling her that there are things that he must do and he cannot do them without her. Alma accepts and they are married.\r\nOn vacation in the Swiss Alps, once again, Reynolds starts saying cruel and cutting things to Alma both privately and in front of their friends; they fight and defy each other again. As Reynolds' anxiety about his work increases, he complains to Cyril about Alma, who enters the room and overhears the conversation; neither Reynolds nor Alma is perturbed. We see Alma in the forest again, gathering mushrooms. One evening, she prepares a poisoned omelette as Reynolds watches her from the dining room table. As he slowly chews his first bite, she informs him that she wants him weak and vulnerable with only her to take care of him; after that, she wants him strong again. Reynolds implicitly consents by swallowing one bite of the omelette, responding, \"Kiss me, my girl, before I'm sick.\" In the next scene, they are in Reynolds' bedroom: Alma sits with Reynolds, in pajamas with a pan in his lap; they smile happily and kiss before he tells her that it's time for her to leave the room to which she responds, \"I'll be right outside the door.\"\r\nLater in a voiceover, Alma imagines their future with children, a rich social life, and her running the dressmaking business as a partner. We see Alma pushing a baby carriage which she hands over to Cyril so that she and Reynolds can go out. In the present moment, we see Reynolds with his head in Alma's lap as they enjoy the fireplace; Reynolds remarks that he is getting hungry."
  },
  {
      "Release Year": 2017,
      "Title": " Ali's Wedding",
      "Origin/Ethnicity": "Australian",
      "Director": "Jeffrey Walker",
      "Cast": "Osamah Sami, Don Hany, Helana Sawires",
      "Genre": "drama",
      "Wiki Page": "https://en.wikipedia.org/wiki/Ali%27s_Wedding",
      "Plot": "After a reckless lie sets off a catastrophic chain of events, Ali (Osamah Sami), son of a Muslim cleric (Don Hany), finds himself caught between his sense of duty and following his heart – to follow through with his arranged marriage, or be with the girl he loves.[5]"
  },
  {
      "Release Year": 2017,
      "Title": " Berlin Syndrome",
      "Origin/Ethnicity": "Australian",
      "Director": "Cate Shortland",
      "Cast": "Teresa Palmer, Max Riemelt, Matthias Habich",
      "Genre": "thriller",
      "Wiki Page": "https://en.wikipedia.org/wiki/Berlin_Syndrome_(film)",
      "Plot": "Clare (Teresa Palmer), a young Australian backpacker, is exploring Berlin when she meets a local man named Andi (Max Riemelt) and has a one-night stand with him. The next morning, however, she finds that he has locked her in his apartment. Clare believes Andi when he says he accidentally forgot to leave her a key, and she stays with him another night. Soon, however, Clare realises Andi has no intention of ever letting her go, discovering that he has written the word meine (mine) on her shoulder and stolen her SIM card from her phone. Clare tries to escape by smashing the windows but discovers they are double paned. To her amazement, when Andi comes home, he acts like nothing is wrong, offering her flowers and pesto. She attacks him but he physically restrains her, then keeps her tied up.\r\nWhile Clare is confined to his apartment, Andi goes to dinner with his father, a professor, and mentions that he's dating a new woman. Andi's father asks what happened to Natalie, and Andi tells him that she went back to Canada. His father mentions Andi's mother, prompting Andi to speak bitterly about how she defected to the west before the Wall came down. That night, when Andi lets Clare shower, she is horrified to find long blond hair clumped in the drain, and realises she is probably not his first victim. Meanwhile, Andi pretends that things are normal, cheerfully telling Clare, \"I told my father about us\" and \"I texted your mother for you.\" Clare uses a screwdriver to attack Andi and flee the apartment, but he catches up with her and brings her back after breaking her hand.\r\nOne night, Franka, a student at the sports school where Andi teaches, shows up at his apartment. When Franka sees a flash of Clare in a towel, Andi tells her it's his girlfriend and puts her down, causing her to leave. Meanwhile, Andi continues with his bizarre behaviour, taking Polaroids of Clare in disturbing positions and cutting off pieces of her hair. Some time later, Andi finds out his father has died in his sleep. Andi stays in his father's house in a depressed funk for a week, while Clare is left in the apartment with the power turned off. Unable to escape, she takes Polaroids of herself and eats what is left of the food until Andi finally returns. Clare, who appears to exhibit Stockholm syndrome, appears relieved as she thought he was not going to come back.\r\nAs the holidays approach, Clare's attitude seemingly changes and her mood brightens. She learns the accordion, bakes, cleans, and sleeps with Andi willingly. For Christmas, Andi gives her his father's old dog, which he kills a few days later as he is jealous of their relationship. Just after Christmas, Andi takes her out into the forest, planning to kill her with an axe. Before he does, a child cries out running toward them saying his brother has hurt his leg. She whispers to the boy to go to the police, but he does not understand English and is afraid of her. After the boy's mother appears, Andi takes Clare home. She eventually breaks into a locked room within the apartment and finds a photo book filled with Polaroids of what looks to be the blonde Natalie, who was presumably kidnapped and murdered before her.\r\nA man with a flashlight sees Clare in one of the unboarded windows and attempts to rescue her as she cries for help. Andi comes home just then and viciously kills the man. He then forces Clare to help wrap the body in plastic, telling her it's her fault. He takes the body outside and burns it. More time passes as Clare is held prisoner. Andi sees a column in the newspaper about Clare being searched as a missing person and decides to kill her. He tells her to pack her things into a backpack under the pretense that he is having the flat fumigated. Seeing a stack of workbooks that Andi is grading, Clare intentionally burns her hand on the stove and steals one of them when Andi goes to get her ointment. Later, Andi leaves for the final time, turning the power and water off as he goes.\r\nAt work, Andi hands out his students' workbooks, including Franka's. Inside hers, Franka discovers a Polaroid of a bound Clare that she had hidden for the girl to find. As Franka leaves the classroom in shock, the Polaroid falls to the floor and is discovered and passed around by the other students. Andi quickly realises that he has been exposed and leaves in a panic, speeding back to his house. Franka rides her bike to the apartment and finds Clare just before Andi arrives. In hiding, Clare is finally able to trap Andi in the part of the house where he had kept her. She is seen later riding in a taxicab, putting back on a necklace her mother had given her that Andi had stolen. The film ends with Clare crying happily as she lets her face feel the fresh air from the car window, finally free."
  },
  {
      "Release Year": 2017,
      "Title": " Breath",
      "Origin/Ethnicity": "Australian",
      "Director": "Simon Baker",
      "Cast": "Elizabeth Debicki, Simon Baker, Richard Roxburgh",
      "Genre": "drama",
      "Wiki Page": "https://en.wikipedia.org/wiki/Breath_(2017_film)",
      "Plot": "The film is set in the 1970s and two teenage boys form a connection with an older surfer.[1] The boys Pikelet and Loonie have grown up in a small town and through surfing met up with Sando, who challenges them to take greater and more dangerous risks.[2]"
  },
  {
      "Release Year": 2017,
      "Title": " The Butterfly Tree",
      "Origin/Ethnicity": "Australian",
      "Director": "Priscilla Cameron",
      "Cast": "Melissa George, Ewen Leslie, Ed Oxenbould, Sophie Lowe",
      "Genre": "drama",
      "Wiki Page": "https://en.wikipedia.org/wiki/The_Butterfly_Tree",
      "Plot": "Evelyn is an ex-burlesque queen who puts a curse on single dad Al and his son Fin with her zest for life. When both Al and Fin learn they are competing for Evelyn's love, their competition brings back memories over the death of Fin's mother."
  },
  {
      "Release Year": 2017,
      "Title": " Cargo",
      "Origin/Ethnicity": "Australian",
      "Director": "Ben Howling, Yolanda Ramke",
      "Cast": "Martin Freeman, Anthony Hayes, Caren Pistorius",
      "Genre": "thriller",
      "Wiki Page": "https://en.wikipedia.org/wiki/Cargo_(2017_film)",
      "Plot": "In a desperate bid to outrun a violent pandemic, Andy and Kay have holed up on a houseboat with their one-year-old daughter, Rosie. Their protected river existence is shattered by a violent attack, which sees Kay tragically die and Andy infected. Left with only 48 hours before he transforms into one of the creatures they have fought so long to evade, Andy sets out on a precarious journey to find a new guardian for his child. A flourishing Aboriginal tribe are Rosie's best chance of survival - but with their merciless attitude toward the afflicted, they also pose a grave threat. A young Indigenous girl becomes Andy's only chance of safe passage into this sacred community. But unfortunately the girl has no desire to return to her people - she is on a quest to cure her own infected father by returning his stolen soul. Each in their own way is seeking salvation, but they will need to work together if they hope to achieve it."
  },
  {
      "Release Year": 2017,
      "Title": " Hotel Mumbai",
      "Origin/Ethnicity": "Australian",
      "Director": "Anthony Maras",
      "Cast": "Armie Hammer, Dev Patel, Jason Isaacs",
      "Genre": "thriller",
      "Wiki Page": "https://en.wikipedia.org/wiki/Hotel_Mumbai",
      "Plot": "The story is about the victims and survivors of the 2008 Mumbai attacks at the Taj Mahal Palace Hotel in Mumbai, India."
  },
  {
      "Release Year": 2017,
      "Title": " Hounds of Love",
      "Origin/Ethnicity": "Australian",
      "Director": "Ben Young",
      "Cast": "Emma Booth, Ashleigh Cummings, Stephen Curry",
      "Genre": "crime",
      "Wiki Page": "https://en.wikipedia.org/wiki/Hounds_of_Love_(film)",
      "Plot": "Vicki Maloney, an intelligent and charismatic teenager inwardly struggling with her parents’ recent separation, spends the weekend at her mother’s house in outer suburbia. After a heated argument between them, Vicki defiantly sneaks out to attend a party and is lured into the car of a seemingly trustworthy couple, John and Evelyn White. Now at John and Evelyn’s house, Vicki soon finds herself held captive where she is forced into a dark world of violence and domination. With no way to escape and her murder imminent, Vicki realizes she must find a way to drive a wedge between them if she’s to survive her ordeal, and tries exploiting Evelyn’s desire to see her absent children. Unfortunately, John’s emotional hold over Evelyn is far beyond Vicki’s comprehension and her efforts to turn them against each other only fuels Evelyn’s will to see her die. Broken and tormented, Vicki accepts her fate may soon lie at the bottom of a shallow bush grave. Meanwhile Vicki’s desperate mother Maggie will stop at nothing to find her missing child. When Maggie’s search leads her to John and Evelyn’s street, Vicki finds the strength for one last attempt at survival by forcing Evelyn to realize if she ever wants to see her children again, she must break free from John’s evil spell."
  },
  {
      "Release Year": 2017,
      "Title": " Jasper Jones",
      "Origin/Ethnicity": "Australian",
      "Director": "Rachel Perkins",
      "Cast": "Hugo Weaving, Toni Collette",
      "Genre": "drama, mystery",
      "Wiki Page": "https://en.wikipedia.org/wiki/Jasper_Jones_(film)",
      "Plot": "Protagonist Charlie Bucktin is a 14-year-old boy living in the fictitious rural town of Corrigan in Western Australia. Charlie spends his days with his best friend Jeffrey Lu, a Vietnamese boy who shares Charlie's love of intellectual banter, and deals stoically with the constant race-hate inflicted on him and his family. Eliza Wishart, a local girl, and daughter of the President of the town hall becomes more and more endeared towards Charlie.\r\nOn Christmas evening Charlie is unexpectedly visited by Jasper Jones, an outcast in Corrigan due to his mixed White-Aboriginal heritage and rebellious lifestyle. Jasper begs for Charlie's help, and leads him to his private glade in the bush. Here Charlie is horrified to find the dead body of a young girl, Jasper's girlfriend Laura Wishart, battered and hanging from a tree. Jasper, aware that he is likely to be blamed for Laura's murder, convinces Charlie that they should hide the body, so they throw it into a nearby pond, weighted by a large rock.\r\nJeffrey is passionate about cricket, but his attempts to join the Corrigan team are thwarted by the racism of the coach and other players. Eventually fortune goes his way, and he finds himself batting in a game against a rival town, watched by Charlie, who has befriended Eliza, Laura Wishart's younger sister. As Jeffrey wins the game on the last ball, Charlie and Eliza hold hands and embrace.\r\nA search for the missing girl is soon organised, focused on the idea that she may have run away. Jasper is interrogated roughly by the local police, but he soon escapes. Meanwhile tension builds in the town, as parents fear more disappearances, and townspeople search for someone to blame. The tension is funneled into strict curfews for the children as well as racial attacks on Jeffrey's family. It is revealed that Charlie's mother, increasingly disillusioned with life in Corrigan and her marriage, is having an affair with the Sarge involved with the investigation into Laura's disappearance.\r\nJasper believes that Laura's murderer is Mad Jack Lionel, a reclusive old man who is rumored to have done terrible things in the past. Jasper determines to confront Lionel on New Year's Eve, and together with Charlie, goes to his house. Lionel manages to defuse Jasper's aggression, and the truth comes out: Lionel is actually Jasper's grandfather who had ostracised his son's family knowing that he had married with an Aboriginal woman when Jasper was a baby. His daughter-in-law then took care of him, spurring a change of heart towards her. One night, she needed medical attention, and Lionel had attempted to race her to hospital. In his haste, however, he accidentally crashed his car, causing her death. The incident has left him guilty, broken, and ostracized by the townspeople. Ever since, Lionel has been trying to reach out to Jasper and apologise for his actions.\r\nOn the same night, Charlie comes to Eliza's window. They go to Jasper's glade. Here Eliza tells Charlie that she knows everything about Laura's death and hands him the suicide note detailing the gruesome reasons for her apparent suicide. The note said that after rampant sexual abuse by her abusive father, leaving Laura pregnant, and after a particularly violent fight on Christmas day, Laura came looking for Jasper. Eliza followed her to the glade. Finding Jasper away, in despair Laura hanged herself, and Eliza, paralyzed by fear, could not save her. Charlie then confesses that he and Jasper had thrown Laura's body into the pond.\r\nCharlie's mother leaves Corrigan. Charlie remains close to Eliza, who exacts revenge on her father by setting fire to their house, injuring him. The secret about Laura's death remains with the three of them."
  },
  {
      "Release Year": 2017,
      "Title": " Jungle",
      "Origin/Ethnicity": "Australian",
      "Director": "Greg McLean",
      "Cast": "Daniel Radcliffe, Alex Russell",
      "Genre": "adventure",
      "Wiki Page": "https://en.wikipedia.org/wiki/Jungle_(2017_film)",
      "Plot": "In early 1980s, an Israeli adventurer named Yossi Ghinsberg (Daniel Radcliffe) travels to Bolivia for a journey into the heart of the Amazon rainforest. There, he meets Marcus Stamm, a Swiss school teacher, and Marcus's friend Kevin Gale, an American hiker and avid photographer. The three are staying in La Paz, where one of them has an apartment. Yossi is out in the market one day and a stranger asks if he is an American, he replied \"No\". This stranger is Austrian, Karl Ruprechter. During conversation Karl claims the existence of a Indian tribe in the jungle that they should go see. Karl says everything will be okay because he knows the jungle and he's friends with the tribe. Yossi, excited about the prospect of exploring the jungle, chooses to believe him. He heads back to the apartment to convince Marcus and Kevin to come along. Being skeptical of the stranger and his story, they refuse. Yossi continues to press them and they ultimately acquiesce.\r\nThe next day they meet Karl in a shop while he is gathering supplies for the hike. All three men are surprised when Karl leaves with the supplies and tells them they will pay for everything.\r\nYossi, Marcus, Kevin and Karl hike through the jungle for several days. They make it to a village where it's apparent Karl knows the villagers. They spend the day in the village and stay over night. They head back into the jungle the next morning. Marcus starts having trouble walking and it is discovered his feet are full of bloody sores. By now Kevin and Yossi are a little tired of Marcus' complaining. Yossi, Kevin and Karl are discussing how they all should proceed. Karl wants to leave the three while he goes and gets help but Kevin and Yossi disagree with that. At this point Marcus walks up and Kevin suggest an idea of building a raft and use the river so all of them can stay together. They build a raft and set off down the river. They hit some rapids, barely making it through. Karl gets upset at Kevin for taking control on the raft and floats the raft to shore and says something \"smart\" then says he's going hunting. Yossi goes to find him so he doesn't leave them. Marcus and Karl decide to leave the journey and go back to La Paz, which takes three days. Yossi and Kevin continue their journey until their makeshift raft is destroyed by a strong current, and Yossi is washed away by the river, leaving Kevin behind. Without a knife or any kind of survival training, he must improvise shelter and forage to survive. Ghinsberg begins to give up hope after losing all sense of direction, wondering if he will ever survive the jungle. Meanwhile, Kevin is discovered by people from the local town who take him to Rurrenabaque which is 120 miles from Yossi's location, Curiplaya. Arriving there, Kevin called for the help of the local authorities to find Yossi. They failed to find Yossi through a plane flyover, but Kevin believes that Yossi is alive. Kevin ropes in the help of the local boat driver to search for him. Kevin finally discovers a now-weak Yossi and takes him to Rurrenabaque.\r\nThe epilogue says that Karl and Marcus were never seen again and Karl was wanted by the authorities."
  },
  {
      "Release Year": 2017,
      "Title": " Killing Ground",
      "Origin/Ethnicity": "Australian",
      "Director": "Damien Power",
      "Cast": "Aaron Pedersen, Harriet Dyer, Maya Stange, Tiarnie Coupland",
      "Genre": "thriller",
      "Wiki Page": "https://en.wikipedia.org/wiki/The_Killing_Ground_(2017_film)",
      "Plot": "Ian Smith and Samantha \"Sam\" Shaw are a couple taking a romantic trip for New Year's Eve in the outback. They head to a remote beach for a weekend getaway from the pressures of city life. On the way, they meet German, a man who advises them to set up camp at a beach near a waterfall. When they arrive, they set up camp next to an abandoned campsite with no trace of its occupants. Sam suggests to Ian that they should get married and Ian happily agrees.\r\nAfter a few nights, they become concerned when they discover a traumatized baby on his own. Elsewhere, German tells his associate, Chook, about Ian and Sam, and the two begin to make plans. Chook is so excited to \"go hunting\" that he leaves early that morning without German. Chook finds Ian and Sam with the baby, Ollie, stuck at the campsite with a flat tire.\r\nThree days earlier, the Baker family - Robert, Margaret, their 16-year-old daughter Emily and their infant son, Ollie - had been camping at the same place. German and Chook showed up at the campsite and kidnapped Robert, Margaret, and Emily, unaware of Ollie’s presence. German and Chook raped Margaret and Emily, and torture the family before murdering them all. After spotting Ollie in a photo on Emily's cell phone, they returned to search for him, but he had wandered off.\r\nBack to the present, Chook persuades Ian to go and search for the missing family. However, he intends to take Ian up to the killing ground to taunt him with the corpses as part of his sick game. When they arrive, the pair discovers that Margaret didn't die from her injuries and crawled off to the creek. Ian tries to save her, but Chook shoots and kills her on the spot. As Chook explains his intent to rape Sam and kill him, Ian charges forward and knocks him down. But rather than fighting Chook, Ian runs off in a panic as Chook chases him.\r\nMeanwhile, German arrives at the campsite to find Sam alone with Ollie. German tries to abduct Sam from the car, but she slashes his wrist and escapes with Ollie into the woods. German releases his dog, Banjo, to attack them. However, Banjo gets distracted by a wild boar and leaves German to chase after them instead.\r\nChook mistakenly shoots German, thinking he is Ian. Chook apologizes to German as Ian watches from a hiding spot. Nearby, Ollie begins to cry, giving away Sam and Ollie’s location. Ian attempts to retrieve German's sniper rifle, but he is too afraid and returns to his hiding spot. Chook kills German, who begs him to end his suffering. Chook snatches Ollie from Sam before slamming him to the ground. Chook then takes Sam hostage and tells Ian he will be waiting at the killing ground.\r\nAfter Chook leaves with Sam, Ian stops hiding and notices German's car keys protruding from his pocket. Meanwhile, Chook grows impatient that Ian hasn't come to save Sam, so he threatens to rape her. Right then, he hears Ian escaping in German's truck. Chook angrily drags Sam off with him as they attempt to intercept Ian. When they pass German's corpse, Sam notices that Ollie is missing. Once inside Chook's car, he insults Ian for abandoning Sam, but Sam believes that Ian took Ollie with him. Sam tries to fight Chook, leading to him crashing into a tree, knocking them both unconscious.\r\nAs night falls, Ian arrives at the police station and asks for help. He accompanies two officers to the campsite. Sam awakens in the wreck of the car with her hands tied to the steering wheel and Chook absent. The officers spot the wreckage when Sam flashes the head beams on the car, but Chook kills them as they exit their police car. Chook shoots Ian in the arm and holds him hostage. He demands that Sam drive him to a safe location. Sam complies and runs up to save Ian from bleeding to death.\r\nSam asks Ian if Ollie survived, but Ian tells her that Ollie was never with him and he ran off to the police as he didn't know what to do. Ollie is shown to have crawled away from German's corpse as Banjo sits silently guarding him. His final fate remains unknown.\r\nWhile driving out of the campsite, Sam resolves to stop Chook and violently crashes the vehicle. Ian falls unconscious, and Chook - badly injured - manages to get away from the wreckage. Sam scuffles with Chook for his handgun before she smashes his head with a large rock, finally killing him.\r\nIn the end, Sam wakes up in a hospital and leaves her room to find Ian, recovering from his broken arm in another room. Sam stands silently beside his bed."
  },
  {
      "Release Year": 2017,
      "Title": "The Adventurers",
      "Origin/Ethnicity": "Chinese",
      "Director": "Stephen Fung",
      "Cast": "Andy Lau, Shu Qi, Zhang Jingchu",
      "Genre": "action / adventure",
      "Wiki Page": "https://en.wikipedia.org/wiki/The_Adventurers_(2017_film)",
      "Plot": "Infamous thief Dan Cheung (Andy Lau) miscalculated during a heist and was apprehended and imprisoned as a result. Five years later, Cheung enlists his longtime partner Po Chen (Tony Yang) and new recruit Red Ye (Shu Qi) to steal precious jewels in Europe under the watchful eyes of French detective, Pierre (Jean Reno), who has been hot on Cheung's trails for many years.\r\nAfter testing their skills and agility, Cheung finds the buyer of the jewels, King Kong (Eric Tsang), leader of a criminal organisation and a father figure to Cheung. After the two reunite, Cheung receives a new mission. At the same time, in order to bring Cheung and his gang to justice, Pierre persuades Cheung's ex-fiancée, Amber Li (Zhang Jingchu), who had developed hatred from love towards Cheung, to join the hunt.\r\nFrom Cannes to Prague, a game of cat and mouse across Europe begins. After a series of close combat, Pierre is able to gradually grasp Cheung's whereabouts. And as everyone is about to get close to the target, Cheung's true plan also gradually surfaces."
  },
  {
      "Release Year": 2017,
      "Title": "My Other Home",
      "Origin/Ethnicity": "Chinese",
      "Director": "Unknown",
      "Cast": null,
      "Genre": "drama",
      "Wiki Page": "https://en.wikipedia.org/wiki/My_Other_Home",
      "Plot": "Stephon Marbury, after his fall from grace in the National Basketball Association and subsequent depression, rediscovers himself in the Chinese Basketball Association. He also tries to rebuild the Beijing Ducks' dynasty."
  },
  {
      "Release Year": 2017,
      "Title": "Once Upon a Time",
      "Origin/Ethnicity": "Chinese",
      "Director": "Zhao Xiaoding Anthony LaMolinara",
      "Cast": "Liu Yifei, Yang Yang, Luo Jin",
      "Genre": "romance / fantasy",
      "Wiki Page": "https://en.wikipedia.org/wiki/Once_Upon_a_Time_(2017_film)",
      "Plot": "Bai Qian is the youngest of five in the Bai family, a family of fox deities and the rulers of the mystical land, Qing Qiu. One day, Bai Qian is invited to the East Sea to attend a party. There, she runs into a little boy who steals her fan. When she notices the boy missing, she spots a lady dropping the fan. The lady is recognized by Bai Qian to be Xuan Nu, the Demon Clan's Queen and a shapeshifter. Xuan Nu runs away, only for a man to come running to the boy. Bai Qian, thinking that he is Xuan Nu, tries to stop him from approaching the boy, named Ah Li. While fighting, the man stops and calls her Su Su, suddenly recognizing her as her mask comes off. The man is revealed to be Ye Hua, her betrothed, Ah Li's father, and the Heaven Tribe's Crown Prince. After Ye Hua apologizes, she leaves.\r\nBack in Qing Qiu, Ye Hua and Ah Li has decided to stay with Bai Qian. Ye Hua is determined to make her fall in love with him while Ah Li believes that she's his mother. While Bai Qian is with Zhe Yan, a family friend, Mi Gu, a tree spirit, informs her that someone has come to Qing Qiu to take Ah Li away. While Ah Li is running away from a lady, they both happen to stumble into a cave. The lady sees a man in an ice block and recognizes the man as Mo Yuan. When Bai Qian arrives, the lady introduces herself to be Su Jin, a princess consort of the Heaven Tribe, who happens to be in love with Ye Hua. Ye Hua walks in and tells both of them that Ah Li will be returning to the Heaven Tribe after celebrating his birthday in the mortal realm with his mom and dad.\r\nIn the mortal realm, Ye Hua explains that three hundred years ago, he was mortally wounded in a battle and was too exhausted to use his powers. Su Su, a human girl, ended up taking care of him, and as a repayment for her kindness, Ye Hua agreed to marry her. Ye Hua realizes that Su Su and Bai Qian are the same person and wishes that Bai Qian could remember and forget all that happened in the past.\r\nBack in Qing Qiu, Bai Qian visits Mo Yuan, the god of war and a highly respected person in the Heaven Tribe. She preserves him with her blood and talks to him, calling him her master. It is revealed that she has been waiting for him to awaken for seventy thousand years after he had trapped the Demon King, Qing Cang, in a bell. She tells him that she met someone recently who reminded her of Mo Yuan.\r\nAfter an incident involving Ah Li drinking too much alcohol, Bai Qian and Ye Hua argue. Bai Qian, having developed a close bond with Ah Li, wants them to stay a while longer and doesn't find fault in her actions. Ye Hua, an overprotective dad, dismisses Bai Qian's excuses and leaves for the Heaven Tribe.\r\nWhile Bai Qian is gone, Xuan Nu comes and steals Mo Yuan's body. Bai Qian and Zhe Yan then rush to the Demon Clan, planning to rescue Mo Yuan. During the fight, Ye Hua shows up and helps Bai Qian, only for the sake of taking Mo Yuan's body back to the Heaven Tribe. After rescuing him, Ye Hua recalls that in the books he studied, it was told that after locking up Qing Cang, Mo Yuan went to live in seclusion with his favorite disciple, Si Yin, who was Bai Qian. She tells him that after Mo Yuan died, she brought him here and waited for him to come back.\r\nThe two develop a mutual liking for each other and Ye Hua decides to bring Bai Qian to the Heaven Tribe, hoping to get married. During Bai Qian and Ye Hua's wedding, Su Jin tells Bai Qian more of the story between Su Su and Ye Hua. Ye Hua took Su Su to the Heaven Palace and abandoned her there, driving Su Su to commit suicide. Su Jin warns her and says that Ye Hua is only with her because of the guilt he feels for Su Su. Bai Qian, filled with doubt, leaves him at the altar.\r\nLater on, Bai Qian comes back planning to receive the soul-binding lamp from Ye Hua, so it could speed up the process of her master waking up. They both argue with Bai Qian saying that his heart still belongs to Su Su while Ye Hua claims that there has only been a place in her heart for Mo Yuan. He finally confesses that Su Su and Bai Qian are actually the same person. Finally, Ye Hua lends her the lamp and tells her that he hopes she can forgive him. Her memories are released and it is revealed that Su Jin, who was jealous, had Su Su's eyes removed to replace her own after Su Jin jumped into the execution platform, claiming that Su Su pushed her. When Su Su tried to beg Ye Hua to believe her, but he didnt. Su Su asked Ye Hua to name their baby after the word 'parting' and jumped off of the Execution Platform. When Su Su landed in Qing Qiu, her powers returned and she drank an amnesia potion to forget all the pain that happened to her while she was Su Su. After snapping back to reality, Su Jin approaches her and pushes her off the Execution Platform, but Ye Hua catches her. Ye Hua tries to console Bai Qian, but she leaves him and returns to Qing Qiu.\r\nNai Nai, Bai Qian/Su Su's maid in the Heaven Palace, pleads Bai Qian to forgive Ye Hua. Nai Nai tells Bai Qian the true story of what actually happened. All the time that Ye Hua abandoned her, he was trying to get permission from the heavenly lord to marry her. And when she jumped off the Execution Platform, Ye Hua jumped after her, harming himself. He even took the lightning punishment that was meant for her for 'pushing' Su Jin.\r\nYe Hua stays in Qing Qiu, refusing to leave until Bai Qian forgives him. For seven days and nights, Bai Qian refuses to see him or welcome him into Qing Qiu.\r\nAt the Bell, Su Jin awakens Qing Cang, hoping that he will kill Ye Hua and Bai Qian for mistreating her. Ye Hua decides to go fight Qing Cang. Bai Qian learns of the news and rushes to go help him, but she is too late. Ye Hua sacrifices himself, just like how Mo Yuan did, to lock up Qing Cang. The river, that the bell is on, freezes and Ye Hua floats away under the ice. Bai Qian follows him and screams, saying that she'll drink the potion again if he dares to die. Ye Hua watches her and sinks to the bottom, his last wish being that she could forget him for all the pain that he has cause her.\r\nLater on, Mo Yuan's ice block cracks and he awakens. As Bai Qian runs to finally see her master, she is stopped by Mo Yuan/Ye Hua standing there and asking her (Qian Qian, a nickname that only Ye Hua called her) to come closer."
  },
  {
      "Release Year": 2017,
      "Title": "Kung Fu Yoga",
      "Origin/Ethnicity": "Chinese",
      "Director": "Stanley Tong",
      "Cast": "Jackie Chan, Aarif Rahman, Lay",
      "Genre": "comedy / action / adventure",
      "Wiki Page": "https://en.wikipedia.org/wiki/Kung_Fu_Yoga",
      "Plot": "Jack (Jackie Chan), a renowned professor of archaeology at the Terracotta Warriors Museum in Xi'an, teams up with young Indian professor Ashmita (Disha Patani) from National Museum Institute, Rajasthan to locate India's lost Magadha treasure in Tibet. Their team find the treasure underneath a frozen lake using modern technology. However, they are interrupted by a group of mercenaries led by Randall (Sonu Sood) who steals the treasure and leaves them there to die. In the chaos, Jones – a member from Jack's team who is more a treasure hunter than an archaeologist smuggles away with a diamond artifact. Jack's and Ashmita's team manage to escape from the underground icy cavern through an opening.\r\nTwo weeks later, the 212 carat diamond artifact pops up in Dubai for auctions at the black market. To save his job, Jack attempts to take back the artifact with the help of a rich friend. Jack wins the auction but Randall strikes again with his goons which result in a high speed car chase through heavy traffic in Dubai. In the ensuing chase, Ashmita snatches it from them. Jack traces about Ashmita's whereabouts and finds she isn't who she claimed to be before but the youngest descendant of Magadha royalty. Ashmita explains the diamond artifact is known as the \"Eye of Shiva\" in their family chronicles and it is the key to immense treasure hidden somewhere.\r\nShe asks Jack to help her find the real treasure and protect it from wrong hands. They further find the diamond artifact is a part of a scepter that opens a map room built using vastu shastra and astronomical positions of that period in a closed part of a sacred temple. Randall kidnaps Jack and Ashmita, demands to find the treasure for him because it belonged to his family. They all together find the map room which happens to be a puzzle room where a wrong move can cost lives.\r\nThey reach to an underground Shiva temple made out of gold that is nearby a secluded waterfall. Reaching there, Randall's group begins to extract gems and diamonds from the temple decorations and searches for the treasure, but to his despair, they find the treasure that the legend says is ancient knowledge about medicine, Buddhism, mechanical structures, and many more. In despair, Randall tries to destroy everything, but Jack, Ashmita and their team start a fight to stop them. Jack fights using principles of yoga and kung fu to beat down Randall and convinces him the significant importance of this finding. Meanwhile, a group of Sannyasis comes down through the new opening above ground and by seeing the magnificence of the deity in underground temple, they start to sing and dance in joy. The groups that were fighting, realizing their pettiness, stop fighting and happily join with the joyous expression and costume changes."
  },
  {
      "Release Year": 2017,
      "Title": "Duckweed",
      "Origin/Ethnicity": "Chinese",
      "Director": "Han Han",
      "Cast": "Deng Chao, Eddie Peng, Zhao Liying",
      "Genre": "drama / comedy",
      "Wiki Page": "https://en.wikipedia.org/wiki/Duckweed_(film)",
      "Plot": "The film tells the story about the reconciliation between a father and his son. Ah Lang, a youth from a small town, thinks that his father Ah Zheng never understood his occupation and life. In a fateful occurrence, he is able to experience his father's legendary and interesting life in the past.\r\nMovie started with Xu Tailang (Deng Chao) winning the 2022 China Rally Championship as his aging father, Xu Zhengtai (Eddie Peng) watches. Following this, while taking his father for a speed drive an oncoming train crashes into the side at rear end of his car as it jumps over the railway track As he lies on the gurney being pushed along the corridor of a hospital, he sees himself transported back in time to 1998 in the town where he was born. Thus, begins his comical adventures with his young father (Eddie Peng) and the people during that time period, at the same time meeting his mother whom he has never seen in person because she committed suicide due to postpartum depression after giving birth to him. Through it all, he learns how his father lived his life then, how much he loved his mother (Zanilia Zhao), why he went to prison for six years, understands his father better and gains respect for him."
  },
  {
      "Release Year": 2017,
      "Title": "Buddies in India",
      "Origin/Ethnicity": "Chinese",
      "Director": "Wang Baoqiang",
      "Cast": "Wang Baoqiang, White. K, Yue Yunpeng",
      "Genre": "comedy / action / adventure",
      "Wiki Page": "https://en.wikipedia.org/wiki/Buddies_in_India",
      "Plot": "An acrobatic monkey loving circus guy accompanies son of a recently deceased CEO to India to recover his will. His uncle sends many thugs to eliminate them but by sheer luck and dedication of the acrobatic circus man, the young heir of the corporation escapes with his life. Reaching their destination point they understand the acrobat was a long lost son of the CEO's friend and he send his son to India with the aim to fulfill his promise to his friend who is staying in India."
  },
  {
      "Release Year": 2017,
      "Title": "Boonie Bears: Entangled Worlds",
      "Origin/Ethnicity": "Chinese",
      "Director": "Ding Liang",
      "Cast": "Shang Wenjie, Bao Chunlai, Sun Jianhong",
      "Genre": "animation / children",
      "Wiki Page": "https://en.wikipedia.org/wiki/Boonie_Bears:_Entangled_Worlds",
      "Plot": "Boonie bears and the gang, (Da Ya, Big Vince and Small Yukun) Try to stop the Catherine from getting the golden antliers."
  },
  {
      "Release Year": 2017,
      "Title": "Backkom Bear: Agent 008",
      "Origin/Ethnicity": "Chinese",
      "Director": "Unknown",
      "Cast": null,
      "Genre": "comedy / animation / family / adventure",
      "Wiki Page": "https://en.wikipedia.org/wiki/Backkom_Bear:_Agent_008",
      "Plot": "With the human exploitation of natural resources, the Arctic environment is completely destroyed, leaving only the last polar bear to survive. A human girl named Jessica adopts the polar bear and names him Backkom."
  },
  {
      "Release Year": 2017,
      "Title": "Khaidi No. 150",
      "Origin/Ethnicity": "Telugu",
      "Director": "V.V. Vinayak",
      "Cast": "Chiranjeevi, Kajal Aggarwal, Tarun Arora",
      "Genre": "action drama",
      "Wiki Page": "https://en.wikipedia.org/wiki/Khaidi_No._150",
      "Plot": "In Kolkata, prisoner Kathi Seenu (Chiranjeevi), a petty criminal, helps the police capture an escaping prisoner, but he himself escapes afterwards. He goes to Hyderabad and decides to escape to Bangkok. However, he drops this plan after meeting and falling in love with Lakshmi (Kajal Aggarwal), his childhood friend at the airport, who dupes him into believing that she gave him her phone number realizing that he is having a crush on her. Later, Seenu and Malli (Ali), his friend notice a doppelgänger of Seenu named Shankar (Chiranjeevi), being shot by a group of thugs. They admit him to a hospital, following which Seenu decides to impersonate the injured Shankar to escape from the police. Under the name of his doppelgänger, Seenu and Malli enter an old-age home run by Shankar with the aim of collecting ₹25 lakhs (which is meant for the inmates of the old-age home) for their Bangkok trip, until he learns about his doppelgänger's mission. Shankar is a post-graduate in hydrology from the arid village of Neeruru in Rayalaseema who had discovered groundwater under some lands of the village which could be used as an irrigation source not only for the village, but for the entire Rayalaseema and the neighbouring areas as well. But, an MNC owned by Aggarwal (Tarun Arora) cheated the villagers into giving their lands for the construction of a factory. Shankar was arrested by the police and the six villagers as for convince the issue with media and release of Shankar commit mass suicide. On learning of the plight of Shankar and the villagers, Seenu decides to fight for their cause while still under the name of Shankar. The people of the old home and Seenu go to the jury and try to convince him to go in favour of them, but Seenu starts stating rules and scares the main jury person (whom Aggarwal had bribed). Seenu then sends a person (disguised as a hairdresser) to Aggarwal and makes him lay a fingerprint on Aggarwal's neck. After that Aggarwal sends 50 men to kill Seenu but he soon defeats them using the coins the Lion Club member gave when he was attending a ceremony for him.\r\nMeanwhile, the real Shankar gains consciousness and finds himself in the Kolkata prison where Seenu was locked up. With the help of the man who Seenu helped capture, who has heard his story and has plans to kill Seenu in revenge for getting him caught and thrown back into prison, he soon escapes along with the prisoner's henchmen.\r\nNot knowing that Shankar and the henchmen are headed for Hyderabad, Seenu makes efforts to convince the media to bring the plight of the villagers to national consciousness, but the media is not interested as they feel that it is not a sensational news. A few days later, at the high court, the judge declares the verdict in favour of Seenu and the villagers, but adds that Aggarwal has claimed that certain villagers who are working abroad have shown their support for the factory. If they cannot prove that their support was faked by Aggarwal within the next five days, the verdict will then go in favour of Aggarwal and the villagers will lose their lands. Since the villagers, who have denied supporting the factory, are abroad and cannot come to Hyderabad within five days to rebut Aggarwal's claims as their passports are held by their contractors, and the verdict is to be decided within five days, Seenu decides to take drastic measures to sensationalize the issue. He, Lakshmi, Malli and the inmates of the old-age home block water supply to Hyderabad by sitting on the pipelines which carry water to Hyderabad. With the plight of the Hyderabad people due to no water supply having gained national attention, Seenu comes out of the pipeline after a few days and highlights the villagers' plight in an emotionally charged speech to the media, which is telecast nationwide and moves many people.\r\nMeanwhile, Shankar and the henchmen reach Hyderabad, but Shankar is soon kidnapped by Aggarwal's henchmen. While in Aggarwal's custody, he sees Seenu's speech on television and is moved by the efforts made by his doppelgänger to help the villagers. On the night before the verdict, Seenu's bluff is exposed, but Seenu assures the old men that he is genuinely interested in their cause, that Shankar is alive and that he will rescue Shankar from Aggarwal and hand him back over to the villagers with the assurance of a positive verdict. Seenu goes to Aggarwal's office, where Shankar is being held. He rescues Shankar and fights Aggarwal. Shankar kills Aggarwal when he was about to kill Seenu.\r\nThe next day, the verdict is declared in favour of Shankar and the villagers. The Kolkata police find Seenu and arrest him. Seenu assures Lakshmi that he will be back shortly."
  },
  {
      "Release Year": 2017,
      "Title": "Gautamiputra Shatakarni",
      "Origin/Ethnicity": "Telugu",
      "Director": "Krish",
      "Cast": "Nandamuri Balakrishna, Shriya Saran, Hema Malini, Shiva Rajkumar",
      "Genre": "historical drama",
      "Wiki Page": "https://en.wikipedia.org/wiki/Gautamiputra_Satakarni_(film)",
      "Plot": "Gautamiputra Satakarni (Nandamuri Balakrishna) is 2nd century AD Satavahana ruler of Amaravati who has a dream from his childhood that to unite all the 32 kingdoms in the country under one roof, to stop internal collisions between the rulers to establish peace. He takes oath on his mother Gautami Balashri (Hema Malini) and starts his mission at the age of 18 and he gives only two options to the kings on his way either peace by surrendering their sword to him or war. It takes 18 long years to achieve his goal and takes entire South India under his control. Time being Satakarni marries Vashishthi Devi (Shriya Saran) and they have a son Pulumavi (Master Snehit Chowdary).\r\nNahapana (Kabir Bedi) important ruler of the Western Kshatrapas, who is very powerful & crooked king, who forcibly puts all the princes of his feudatory kingdoms as royal prisoners and keeps a condition that they all should obey his orders and protect his kingdom from 4 sides. So it is a very difficult and final task to Satakarni to reach Nahapana for that he uses a strategy and decides to take his son Pulumavi along with him to the war field but his wife Vashishthi does not agree to it even then he ruthlessly takes his son. On the other hand Demetrius (David Manucharov) the Greek Emperor is waiting at the border to conquer India, he is just waiting for the result of the battle between Satakarni & Nahapana. Meanwhile, Satakarni starts moving towards Nahapana’s dynasty along with his son and promises all the feudatory kings on the way that he will safeguard & secure their children and definitely brings them back. Finally, he reaches Nahapana’s fort destroys him, protects the princes and brings the entire country under one flag.\r\nAfter that Satakarni returns to Amaravathi along with 32 swords of the entire rulers of India, his mother Gautami Balashri orders to make a powerful sword by melting all these 32 swords. Everybody welcomes him with great enlightenment & joy, but his wife Vashishthi is fed-up his dictatorial mentality and decides to leave him along with the children. But now he has to perform Rajasuya Yaaga, a grand ritual made by the ruler who defeated all other kings in the earth and eligible to rule the whole world, which is impossible without a wife. So, on her mother-in-law’s request, Vashishthi agrees to stay until the completion of ritual. During the time of ritual the Emperor has to give Agra Pooja special honor to the top most person in the kingdom, Satakarni gives it to his mother by spreading the greatness of women and from that day he keeps his name Gautamiputra Satakarni and he also name’s his son as Vasishthiputra Pulumavi where his wife Vasishthi also realizes her mistake and understands greatness of her husband. From that day Satakarni starts a new era calling Salivahana Sakha and the day starting as Ugadi. On that night Kanjira (Milind Gunaji) one of the feudatory kings mixes hands with Demetrius and helps his men to enter into the fort to kill Satakarni but his mother protects him by breaking up their tactics.\r\nNow Satakarni comes to know that Demetrius has arrived into to the borders of Sindhu Kingdom to conquer India whose army is 10 times more than his. Even then he decides to get ready for the final battle at that time his wife Vashishthi gets some bad signs that someone has given poison to her husband. So she requests him not to go to the battle where Satakarni explains her regarding his childhood dream of uniting the entire country which he had done so, now he has to protect it from invaders by exorcising them. So he doesn’t have any other choice except to go to the battle. Gauthami Balasri consults a Bhikkhu explains him regarding these bad signs and he answers that may come true, so he gives anti-dote to the poison.\r\nAt last Satakarni reaches the Sindhu Kingdom along with his feudatory kings, during the first day of the war Satakrani destroys almost half of Greek army. Now Demetrius understands it is difficult to conquer India until Satakarni is alive. So plays a dirty trick by sending a women Athena (Farah Karimaee) as a messenger for peace who gives poison to Satakrani. Next day morning Satakarni is under treatment all other Kings are under dichotomy whether to go to war or go back, but they understands the real aim of Satakarni is not only to win the country but he also want to develop unity among the kingdoms, so they all decides either to win or die in the battle. Meanwhile, Satakarni wakes up from the deathbed, reaches the battlefield, defeats Demetrius and leaves him alive by finally saying a word that no one can destroy the unity of India"
  },
  {
      "Release Year": 2017,
      "Title": "Shatamanam Bhavati",
      "Origin/Ethnicity": "Telugu",
      "Director": "Satish Vegesna",
      "Cast": "Sharwanand, Anupama Parameswaran, Prakash Raj, Jayasudha",
      "Genre": "romantic drama",
      "Wiki Page": "https://en.wikipedia.org/wiki/Shatamanam_Bhavati",
      "Plot": "Raghavaraju (Prakash Raj) is a farming landlord in Atreyapuram village of Andhra Pradesh. He lives with his wife Janakamma (Jayasudha), along with Ragahvaraju's son Bangararaju (Naresh) his wife, and his son Raju (Sharwanand). Raghavaraju lives in this ancestral house built by his forefathers consisting of many generations living in the same household as a Joint family. However with changing times Ragahvarju's NRI son's and NRI daughter live in the United states, Canada, and Australia as nuclear families. After a gap of ten long years, all his children arrive in the village during the holiday season of Makar Sankranti, under mysterious circumstances after they receive an email from Raghavaraju who expresses his wish to divorce his wife Janakamma. What happens next and the events leading to this mysterious situation, and how Raghavaraju convey's his midlife crisis to his children forms the crux of the story."
  },
  {
      "Release Year": 2017,
      "Title": "Nenu Local",
      "Origin/Ethnicity": "Telugu",
      "Director": "Trinadha Rao Nakkina",
      "Cast": "Nani, Keerthy Suresh, Naveen Chandra, Sachin Khedekar",
      "Genre": "romantic comedy",
      "Wiki Page": "https://en.wikipedia.org/wiki/Nenu_Local",
      "Plot": "The story revolves around Babu(Played by Nani).Babu struggles to clear his final exam for completing his Engineering Degree until the exam supervisor(Sachin Khedkar) helps him to copy and clear his course ultimately.After that,incidentally Babu meets Keerthy (Played by Keerthy Suresh) and just falls in love,at the first sight.After few encounters with Keerthy,Babu finally impresses her specially after he helps her best friend to marry her boyfriend.The story is all set to have a happy ending when Siddharth Verma makes an entry and claims that only he could marry Keerthy.Babu gets to know that Siddharth was the same person who vowed to get a job for marrying Keerthy,and these all happenings were four years ago.Keerthy gets more confused when her father wants her to marry Siddharth.But,tactfully,Keerthy tells Babu to convince her father about his love for her.Only then she could marry Babu.Days pass gradually,but,Babu gets no 'special moment' to convince Keerthy's father who despises Babu for his carefree attitude.However,on the day of Keerthy's wedding,the man whose daughter's marriage got abandoned due to Babu,comes to the ceremony and asks for Keerthy's would be husband.Keerthy's father calls Siddharth whereas Keerthy's mother calls Babu.Even in front of impending death,Babu tells the irritated man about his story and quite convinced him that the man's daughter could never be happy after marriage because her future husband only loved Keerthy's best friend.Keerthy's father however thinks Babu's speech to be just a drama and taunts him.an embittered Babu shoots himself with the irritated man's gun,and gets severely injured.Keerthy's father gets convinced about Babu's love for his daughter.The film ends with Babu and Keerthy getting married happily."
  },
  {
      "Release Year": 2017,
      "Title": "Om Namo Venkatesaya",
      "Origin/Ethnicity": "Telugu",
      "Director": "K. Raghavendra Rao",
      "Cast": "Nagarjuna Akkineni, Anushka Shetty, Jagapati Babu, Saurabh Raj Jain",
      "Genre": "devotional-biographical",
      "Wiki Page": "https://en.wikipedia.org/wiki/Om_Namo_Venkatesaya",
      "Plot": "Rama (Akkineni Nagarjuna) born in Ayodhya, India, leaves his house in childhood itself in search of God. Soon he meets a saint Anubhavananda Swamy (Sai Kumar) who assures him that he will definitely see the God one day and also plays with him, so he teaches him to play the dice. Then he advises Rama to meditate to see the god. After 15 years Lord Venkateswara appears in a form of child and disturbs his meditation, Rama scolds the kid and asks him to go away. After that, he reaches back the hometown and his parents (Tanikella Bharani & Sudha) arrange the marriage with his cousin Bhavani (Pragya Jaiswal). Before the marriage one night Rama gets a call in the dream from his guru that time has arrived to play with god. So he cancels the marriage reaches his guru and he says that the boy appeared to him is none other than Lord Venkateswara. He immediately realizes his mistake and heads towards Tirumala Hills in search of God.\r\nKrishnamma (Anushka Shetty) is another ardent devotee who believes herself as the wife of Lord Venkateswara and dedicated her entire life to his service. Govindarajulu (Rao Ramesh) a corrupt person who is representative of Raja Giridhara Raaya (Sampath Raj) looks after temple and pilgrim town’s maintenance who does a lot of corruption, misuses temple income for his personal use and makes the workers as slaves.\r\nRama reaches Tirumala and calls the Lord in the name of Balaji. But he is not allowed to see the god and thrown out of the temple by baddies of Govindarajulu. Rama sits outside seeing towards temple for 7 to 8 days without having any food or sleep. Govindarajulu orders his men to remove him up from the Tirumala, they beat him up very bad, but an elephant nearby comes to his rescue. Later Krishnamma treats him in her Ashram.\r\nBy Krishnamma’s guidance, Rama decides to begin a new horizon at Tirumala. He starts reading Sthala Puranam (History of the temple) and campaigns it to the pilgrims create awareness among the people about the true nature of the Lord. He also encounters Govindaraju by protecting pilgrims & employees of the temple from his illegal activities. Rama decides to construct his own Ashram’ at the hill top and starts cultivating their own flowers & fruits and growing byre (Goshala) for milk products to the temple. Govindarajulu takes this to Giridhar Raaya’s notice, he visits the temple when he recognizes the honesty in Rama he makes him as administrator of the temple and demotes Govindarajulu as a sweeper. From that day Rama changes entire attire of the temple by putting everything in order - a new form of prayers (Poojas), services (Seva), offering Harathi with butter (Navaneetha Harathi), everyday marriage (Nitya Kalyanam) to the god, amenities for devotees and make sure that the temple flourishes with all rituals are performed as per the Holy Scriptures.\r\nAll these things impress Lord Venkateswara (Saurabh Raj Jain) so much that he comes down to earth to play dice with Rama. From that time the god visits every day to spend some time with Rama and Rama starts calling Lord Venkateswara in the name Balaji. First god bets his ring which was given to him by Padmavati (Vimala Raman) as a token of love but eventually Rama won the game and the bet, but Rama fails to understand that the event which had occurred was real and he understands it as a dream, but later craves for another glimpse of lord, the exact moment Balaji appears before him and plays the game of dice with Rama, in the game Balaji Lord loses his entire jewelry in the bet. Next day, when the temple doors are opened, the statue of the Lord is found empty without jewelry which is found in Rama’s Ashram. King Giridhara Raaya arrives to conduct interrogation and Rama says the truth that God himself has given the jewelry to him. Everybody says that it's a cock & bull story, so King keeps a test to Rama to prove his innocence keeping him in a prison with full of sugar cane inside, and asks him to eat every bit of it before dawn. Lord Venkateswara arrives in a form huge elephant and finishes the sugar cane within moments, and disappears. In the morning, the king was surprised to see all the sugar cane eaten. He then realizes that the Lord himself had appeared to save his devotee. From that day Rama becomes famous in the name of Hathiram Bhavaji.\r\nAfter that Lord Venkateswara, himself makes Rama more popular than him and all the pilgrims start visiting him before seeing the god, Rama gets fed-up with this and decides to leave the Tirumala. Lord rushes behind him and takes a promise that he will never leave the hill, Rama accepts it on one condition that he should be buried alive (Sajeeva Samadhi) with his own hands because of the vow Lord has to compulsorily do so. After that when he returns back his wives Padmavati & Bhudevi (Ashmitha) angrily ask why he had done this thing. Finally, the Lord replies that Hathiram Bhavaji is immortal who lives forever in the day to day services offered to him at the temple."
  },
  {
      "Release Year": 2017,
      "Title": "Ghazi",
      "Origin/Ethnicity": "Telugu",
      "Director": "Sankalp Reddy",
      "Cast": "Daggubati Rana, Taapsee Pannu, Kay Kay Menon, Atul Kulkarni",
      "Genre": "inspired by true event",
      "Wiki Page": "https://en.wikipedia.org/wiki/The_Ghazi_Attack",
      "Plot": "The Indian Navy decodes a secret code sent from Pakistan to then-East Pakistan (modern-day Bangladesh) and intelligence report of a Pakistan Navy's submarine called PNS Ghazi, a much more advanced submarine than S21 or any other Indian submarine, being sent through the Bay of Bengal under the command of Cdr. Razak Khan (Rahul Singh). The top command dispatches S21, a submarine, under the command of Capt. Ranvijay Singh (Kay Kay Menon) for surveillance. To temper Singh's belligerent tendencies, the Indian Navy Admiral assigns Lt. Commander Arjun Varma (Rana Daggubati), with orders to ensure that Singh does not confront any Pakistani warships and trigger a war.\r\nGhazi blasts a merchant ship to divert attention of the Indian Navy, that has been sent to sink the sole Indian air-craft carrier, INS Vikrant. Arjun saves a girl child and a woman (Taapsee Pannu), who are Bangladeshi refugees. During surveillance, S21 acquires a sonar signal of Ghazi.\r\nSingh believes that they should track down Ghazi and attack, while Arjun obstructs. Singh then orders the ship's XO, Santosh Devraj (Atul Kulkarni) to conduct a drill and target Ghazi while doing so. They miss their target narrowly and in the process alert Ghazi of their presence. Razak, orders his crew to head towards Visakhapatnam Port at full speed and to set up mines en-route so that S21 is destroyed in their pursuit.\r\nS21 pursues Ghazi's path and realizes at the last moment that it is headed into mines. It tries to change its course but a mine explodes and damages most of the batteries, propellers and circuits and the compartment with the front torpedoes gets flooded. Singh dies while trying to save Arjun as S21 sinks to the sea-bed.\r\nMeanwhile, Arjun, who by now is in charge of the mission, regroup and work towards reviving S21. The crew notices that the ship is incapable of moving in any direction, except up or down. Since they cannot chase Ghazi, the crew artificially triggers a one of the naval mines in its vicinity to make Ghazi return. Razak, sensing that Ghazi could be walking into a trap, diverts the ship's path and starts attacking S21.\r\nSix torpedoes fired by Ghazi are avoided by S21 through depth changing maneuvers. S21 dives to 350m so that it is no longer within Ghazi's sonar range despite being designed for a maximum of 250m depth. With very limited battery support, Arjun instigates Ghazi into attacking by transmitting his crew singing 'Saare Jahaan se Achchha' and the Indian National Anthem. Riled up by S21's defiance, Razak orders another torpedo attack on S21, for which Ghazi will have to turn by 180 degrees. Arjun, dives into the flooded compartment to manually trigger the torpedoes and successfully triggers a torpedo. Ghazi also launches its torpedo at the same time. The Ghazi torpedo misses S21 narrowly, but it is hit by an S21 torpedo and disintegrates in water. Arjun is later saved alive from the flooded compartment."
  },
  {
      "Release Year": 2017,
      "Title": "Winner",
      "Origin/Ethnicity": "Telugu",
      "Director": "Gopichand Malineni",
      "Cast": "Sai Dharam Tej, Rakul Preet Singh, Jagapati Babu, Mukesh Rishi",
      "Genre": "action",
      "Wiki Page": "https://en.wikipedia.org/wiki/Winner_(2017_film)",
      "Plot": "The movie starts off with horse racing, Dharmendra Reddy (Mukesh Rushi) is a number one business magnet in this business his only son Mahender Reddy (Jagapathi Babu) is the number one jockey in the country, leaves the house after marrying his love interest Lakshmi (Kalyani) against his father’s wish. Mahendra leads a happy life, after some time Lakshmi dies giving birth to a baby boy Siddharth Reddy / Siddu (Master Charith), from that time Mahendra was everything to him both of are bound in a doting love bondage.\r\nAfter his son left the house Dharmendra Reddy’s business comes almost to zero level, so he has no other choose except to get back his son. After that he decides to separate Siddu from his father, therefore he constructs a barrier between them and separates them by a meticulous plan of making remarriage to his son with his friend’s daughter (Sonia Agarwal) and makes Siddu forcibly to run away from home.\r\nSiddu (Sai Dharam Tej) grows up to be a father-hating, works as a creative head of a newspaper and he hates races and horses. On another hand, for several years Mahendra relentless tries to find his runaway child. Siddu falls in love with Sitara (Rakul Preet Singh) in the first sight itself. But her goal to become a successful athlete to win National Champion Ship in running race that’s why she under the training by bluffing to her parents that she is studying. While he tries to impress her she shows aversion towards him. So, Siddhu meddles with her life by revealing her secret to her father Rajeev Reddy (Suresh). So he immediately settles her marriage with The Best Jockey (Thakur Anoop Singh). Siddu also reaches to the marriage where Sitara comes up with a plan to escape the marriage that she is loving Siddu and introduces him as a number one racer, so she wants to conduct a race between them and she will marry how will win it. In between this quarrel suddenly Mahendra Reddy arrives and shocking says the jockey as his separated son Siddhartha Reddy and accepts the challenge.\r\nSiddu is completely confused with this incident he wants to know the truth so kidnaps Dharmendra Reddy’s PA (Raghu Babu) and Siddu is flabbergasted, realizing that the person is Aadi not only a jockey but also a criminal by profession impersonated and settled with his family by his grandfather as a returned son to stop unnecessary expenditure in the search of the separated son. Now Siddu decides to take up the challenge by becoming a professional jockey. Rest of the story is how Siddu gains Sitara love, comes close to his father, teaches the lesson to his grandfather and becomes a Winner both in challenge & life."
  },
  {
      "Release Year": 2017,
      "Title": "Gunturodu",
      "Origin/Ethnicity": "Telugu",
      "Director": "S. K. Satya",
      "Cast": "Manchu Manoj, Pragya Jaiswal, Rajendra Prasad, Kota Srinivasa Rao, Sampath Raj",
      "Genre": "romance / action",
      "Wiki Page": "https://en.wikipedia.org/wiki/Gunturodu",
      "Plot": "Kanna (Manch Manoj) is a slacker of Guntur, who passes the time hanging out with his group of friends. So, his father Suryanarayana (Rajendra Prasad) decides to get him married to set him on the right path. After his engagement, Kanna falls in love with his fiancee's friend Amrutha (Pragya Jaiswal), so he creates a mess and cancels the engagement. After few funny incidents, Amrutha also begins to love him.\r\nSeshu (Sampath Raj) is a leading criminal lawyer who is highly short-tempered and egoistic person. One day, at a party, a tiff arises and Kanna beats up Seshu after Seshu asks Kanna and his friends to vacate the party. Since Kanna has cake cream on his face they don't recognize him. Seshu orders his men to find out and kill him at any cost. Things become complicated day by day when Seshu starts targeting Kanna & his father Suryanarayana. The situation becomes even more chaotic when Kanna comes to know Amrutha happens to be Seshu's sister. Rest of the story is how Kanna escapes from Seshu's target and succeeds in his love."
  },
  {
      "Release Year": 2017,
      "Title": "Katamarayudu",
      "Origin/Ethnicity": "Telugu",
      "Director": "Kishore Kumar Pardasani",
      "Cast": "Pawan Kalyan, Shruti Hassan, Kamal Kamaraju",
      "Genre": "action",
      "Wiki Page": "https://en.wikipedia.org/wiki/Katamarayudu",
      "Plot": "Kattula Katamarayudu (Pawan Kalyan) is a brave person living in a village called Oddaanchatram, who lives with his four brothers. The elder brother loves the younger ones to the core, and sacrifices his happiness for their good. They are often caught in fights and they are proud of it. Advocate Bail Lingam (Ali), who bails them out whenever legal issues arise because of their brawls. Katamarayudu hates the idea of marriage as he feels that his wife might create disharmony among brothers. Though the four younger brothers say that they don't want to either fall in love or get married, when Kattula Katamarayudu is not around, they all have their secret lovers. Now, in order to get the green light for their love stories, they learn through his brother's childhood friend Collector that Kattula Katamarayudu, in school, was in love with a girl named Avantika (Shruti Hassan) and his brothers hatch a plan to find her and reintroduce her to Kattula Katamarayudu, so he can fall for her all over again. But she's married now and has kids. So the brothers conspire to do the most logical thing, which is to find another woman named Avantika, because, you see, Kattula Katamarayudu was not in love with that girl so much as her name, and when he meets another (completely random) girl with that name, he is sure to lose his heart to her, just because she bears that name. Though initially reluctant later Kattula Katamarayudu himself falls in love with her. He clashes with a businessman called Radia (Pradeep Rawat) to take care of market in the village. Radia tries to kill Kattula Katamarayudu's brothers while Kattula Katamarayudu kidnaps Radia's son Juttu Ranga (Ayyapa Sharma) after clashing, Kattula Katamarayudu orders Radia to leave this village.\r\nWhile travelling in train to Avantika 's village, Avantika narrates her family background to Kattula Katamarayudu. Avanthika's father Bhupathi(Nassar) is a respected man in the village who hates violence, while his son (Ravi Prakash) is exact opposite who kills people but when he is killed, Bhupathi refuse to bury his body and decided to make his village with peace and harmony. Few goons enter into train but Kattula Katamarayudu bashes all the rowdies, Avantika is shocked to see Kattula Katamarayudu whom she thought as a non-violent person. Kattula Katamarayudu and his brothers arrive at Avantika's village with clean shaven look, he says that he has changed and he would never harbor violence, he and his brothers are welcomed and respected by her family. Bhupathi is touched and impressed by their love, affection and hospitality. Kattula Katamarayudu comes to know that a illegal goon named Yelasari Bhanu (Tarun Arora) wants to kill Bhupathi and his family, reason is revealed through flashback that Yelasari Bhanu's father (J. Mahendra) is responsible for blast of matchstick factory. Bhupathi complains against Yelasari Bhanu's father and is arrested, commits suicide by getting hit by a lorry.\r\nYelasari Bhanu swears revenge against Bhupathi. Kattula Katamarayudu finishes all the goons and solves all their problems without the knowledge of Bhupathi and family. When Bhupathi's granddaughter finds sickle under Kattula Katamarayudu's jeep, Bhupati orders Kattula Katamarayudu to go out of the town. Yelasari Bhanu who escapes from death sentence arrives to kill Bhupathi but Kattula Katamarayudu keeps him and his family in a safe place. Yelasari Bhanu informs Kattula Katamarayudu that he had kidnapped one of his brothers Sivarayudu (Siva Balaji), Kattula Katamarayudu arrives at the nick of time and saves his brother but instead gets attacked by Yelasari Bhanu. Bhupathi and his family who arrives at the place comes to know about risk taken by Kattula Katamarayudu to save him from the mess. Brutally attacked Kattula Katamarayudu rises steadily, kills Yelasari Bhanu and his henchmen. Bhupathi who is impressed with Kattula Katamarayudu's valor decided to give his hand to his daughter Avantika. The film ends with the marriage of Kattula Katamarayudu and his brothers."
  },
  {
      "Release Year": 2017,
      "Title": "Guru",
      "Origin/Ethnicity": "Telugu",
      "Director": "Sudha Kongara Prasad",
      "Cast": "Daggubati Venkatesh, Ritika Singh",
      "Genre": "action",
      "Wiki Page": "https://en.wikipedia.org/wiki/Guru_(2017_film)",
      "Plot": "Aditya alias Aadi (Venkatesh) is a failed boxer who, despite being very talented, falls victim to the dirty politics in the boxing association. Many years later, Adi now coaching the women's boxing teams is extremely angry and frustrated with the partiality in selection. Due to his rift with the association head Dev Khatri (Zakir Hussain), he is falsely charged with sexual harassment and transferred to Vizag. Despite the very poor infrastructure, Aadi manages to find talent in a roadside vegetable seller Rameswari alias Ramudu (Ritika Singh), who he along with his assistant coach Punch Ponds (Nassar) notices while she is thrashing the judges during her sister's tournament.\r\nIgnoring Rameswari's elder sister Lakshmi alias Lux (Mumtaz Sorcar) who has been boxing for 8 years, Aadi offers to train Rameswari for 4 hours daily. But the two don't get along due to Aadi's ruthless training methods and Rameswari's aggressive nature. As a result, Rameswari intentionally loses a local match. Aadi later asks Lakshmi and Rameswari's parents, to send them to stay in a hostel with him so their daughters can work hard on training. Rameswari misunderstands him, but later regrets when she finds out that Aadi has sold his bike to buy new training equipment for her. Rameswari then starts training with Aadi rather intensely with dedication and develops feelings for him. On the day of a qualifying match, she reveals her feelings to Aadi and he promptly rejects her. During the warm-up before the match Lakshmi,who is now jealous of her sister,injures Rameswari's hand causing Rameswari to lose.Aadi thinks that Rameswari lost intentionally again and throws her out of training camp.\r\nDev Khatri takes advantage of the situation by calling Rameswari to Delhi for a cultural exchange tournament and makes her fight with a heavyweight Russian boxer, who knocks out Rameswari in a few seconds. A demotivated Rameswari is then approached by Dev Khatri with an indecent proposal, to which she reacts by injuring him. Dev Khatri takes revenge by getting her arrested on false theft charges.\r\nAadi comes to the rescue and bails her out. He later takes Rameswari to Delhi to get her a wild-card entry into the World Boxing Championship. Rameswari works hard and goes on to win the semifinal. On the day of finals, Dev Khatri removes Rameswari's name from the list and asks Aadi to resign immediately if he wants to see Rameswari in the final, with the same Russian boxer who knocked her out in Delhi. Rameswari gets to fight in the final round but is dejected after learning about Aadi's resignation. She keeps losing points in the early rounds and gets badly injured before Aadi shows up at the stadium and indicates her to attack her opponent's arms to make her weak. Rameswari follows the game plan and knocks out the opponent with seconds to go in the final round. Dev Khatri quickly attempts to take the credit for training Rameswari but she punches him and runs towards Aadi and hug's him, showing emotional reunion of a coach and student."
  },
  {
      "Release Year": 2017,
      "Title": "Mister",
      "Origin/Ethnicity": "Telugu",
      "Director": "Srinu Vaitla",
      "Cast": "Varun Tej, Lavanya Tripathi , Hebah Patel",
      "Genre": "action",
      "Wiki Page": "https://en.wikipedia.org/wiki/Mister_(film)",
      "Plot": "The movie initially starts off in Spain at chey's(Varun Tej) lavish home.The movie starts off with Rahul vadayar(Nikitin Dheer) finds a new hide out for his forest smuggling business to take over control on the forest he gives a hand to gundappa naidu (thanikella bharani) who is dreaming to take over power from Pichayya Naidu (Nassar) who resides at a village in the midst of Andhra-karnataka border, requesting his son K.J.Rao (anand) to send his grandson to India and chey rejecting their parent's proposal of him going to India and that he hates his grandfather because his first mother was died through an accident because of him.\r\nLater he is sent to the airport to receive his cousin Priya whom he has not met before. Amidst a confusion at the airport, chey instead receives Meera (Hebah Patel) and falls for her at the first sight, and brings her to his home. Later, when he reaches home, he realizes it is Meera, not Priya. Meera reveals that she has to be received at the airport from someone who works as a Museum coordinator at Spain and that she could not contact them as she has lost her phone and that she will be here for five days.The duo starts visiting all museums, and when chey finds the Museum coordinator, he manages him to convince Meera to stay at chey's home.\r\nWhen chey's mother realizes his love towards Meera, she encourages him to express his love. Meera and chey meet at Meera's best friend Andy's headstone where she reveals that she is in love with Siddharth (Prince Cecil), who is very much like chey, that does everything for the family. chey treasures Meera as his first love, and not revealing that he is in love with Meera, sends her off at the airport to India.Some days later, chey receives a call from Meera, revealing that Siddharth has cheated her. chey then decides to leave for India when his parents suggest him to visit his grandfather and they secretly hope for Meera to come back to him.\r\nThe setting changes to India, where chey visits Siddharth and gets to know that Meera's brother muthappa gouda (Harish Uthaman) threatened Siddharth and his family to marry him off to another girl and that gouda's men are at his house and though he loves Meera very much, he is helpless. chey convinces Siddharth and his family to escape and promises him to bring Meera along.Later, he visits Meera's place and explains her Siddharth's position and escapes with her.\r\nOn their way to meet Siddharth, the duo encounter chandramukhi (Lavanya Tripathi), who is the daughter of Sri veera narasimha rayalu (Murali Sharma) who belongs to king Sri Krishna Devaraya's dynasty, who runs a private government. she escapes from her marriage arranged Rahul vadayar who is also belongs to other royal family later it reveals that he is the son of Hajarappa (nagineedu) who is a trusted aid of rayalu and dhewan of their palace. who is very vicious and vengeful against the rayalu because he killed his first son on Hajarappa's hands on a punishment for molesting a girl. later chandramukhi knows about Rahuls character and she escapes from the palace. Goons start attacking her suddenly, when chey saves her and she eventually falls in love with him. It is later revealed in flashback that,chandramukhi has been house arrested since she was a young girl by her father and that he deeply bases all his actions based on words of Swamiji who in turn is controlled by Hajarappa.\r\nThe trio meet Siddharth as promised, however they are attacked by rayalu's men and are brought to palace. chey and Meera are treated very well at the palace and the two get elated.During their days at palace, Meera slowly falls for chey.Later, chandramukhi asks chey to escape as they will be sacrificed very soon. During the day of sacrifice, chandramukhi's brother Bhukkaraya (Bharat) notices a Rudraksha shaped mole on chey's lower back and reveals that chandramukhi's life is destined with chey and they both are set to marry as Swamiji has mentioned.\r\nThis makes Hajarappa angry and he send men to kill chey.The three along with Bhukkaraya escape to chey's grandpas home. Later it is revealed by pichayya naidu's brother (Chandra mohan) revealed that in the accident which is happened by chey's father then pichayya naidu takes blame on him in front of chey because chey don't want to hate his father. Finally, chey unites with his grandpa.However, it is later revealed that, chey does not really have a mole and this plan has been hatched by Bhukkaraya and his mom (satya krishna), to save chey and marry off chandramukhi to chey. On hearing this, Meera expresses her love to chey, fearing that she might lose him to chandramukhi. Later meera tells her story to chandramukhi. After hereing her story chandramukhi with a broken heart accepts her love and decides to left chey. But, chey convinces Meera that Siddharth loves her as much, and that he really loves chandramukhi. Then a fight arouse between Hajarappa and pichayya naidu in the process chandramukhi kills Hajarappa by the way all the facts were known to rayalu. Meanwhile in the challange day (Rahul vadayar challenges pichayya naidu in a dual for the support of gundappa naidu to take over power from him) Chey enters on behalf of pichayya naidu reveals that his full name is pichayya naidu. In the dual with Rahul, chey bashes him to death.\r\nFinally, Meera marries Siddharth with the consent of muthappa and chey marries Chandramukhi, with their all families united."
  },
  {
      "Release Year": 2017,
      "Title": "Lanka",
      "Origin/Ethnicity": "Telugu",
      "Director": "Sri Muni",
      "Cast": "Raasi, Sai Ronak, Ina Saaha, Sijju, Supreeth, Leena Siddhu, Rajesh, Sathya, Sudarshan",
      "Genre": "thriller",
      "Wiki Page": "https://en.wikipedia.org/wiki/Raasi",
      "Plot": "This film is about the family of Kumar (Ajith) and his Uncle Bala Singh (Rambha's father). The problem between two families start when Kumar is unable to spend too much money for an occasion in his uncle's family. Whether Kumar and Meena (Rambha) get united after solving out all the problems forms the crux of the story."
  },
  {
      "Release Year": 2017,
      "Title": "Radha",
      "Origin/Ethnicity": "Telugu",
      "Director": "Chandra Mohan",
      "Cast": "Sharwanand, Lavanya Tripathi, Aksha Pardasany",
      "Genre": "masala",
      "Wiki Page": "https://en.wikipedia.org/wiki/Radha_(film)",
      "Plot": "Radhakrishna grows up admiring lord Krishna. He does not miss any chance to know about Krishna and his stories of protecting Dharma. An incident makes him believe that he can help people in need by becoming a police officer just like Krishna did. After completing his studies, he helps the police bust a gang and gets a police job with a special permission. He completes his training in Hyderabad and gets posted to a small village in Warangal district. He feels unhappy in the beginning that he had not got any adventurous work that he had always dreamt of, but later sees a girl named Radha and tries to win her heart.\r\nThe home minister (Ashish Vidyarthi) of the state wants to become a chief minister and tries to influence the party observer (Kota Srinivasa Rao). However the party observer declares his aide M. L. A Sujatha (Ravi Kishan) as a candidate for the post of Chief minister a very honest leader. Then Radha krishna transfered to old city Hyderabad. Then bomb blasts were occurred in the election campaign of M.L.A sujatha.In the bomb blast Radha loses his colleagues and promises to take revenge on the responsible for the bomb blasts.Then it is revealed that bomb blasts were planned by sujatha itself to gain sympathy from the people as a Chief Minister aspirant. After that he get suspicious on Radha's actions and promoted him to his personal security. Then after that it is revealed by his henchmen that radha is well aware of his plans and actions. Then after some comical circumstances and fights Radha reveals sujatha true nature in the public and pushes him in a stampede. Sujatha died in the stampede. Finally he says that public must respect police because at the time of Mahabharata Lord Krishna protects the good but now police is only protects the good. Police is the Lord. Then the film ends that Radha is again transferred to another place."
  },
  {
      "Release Year": 2017,
      "Title": "Keshava",
      "Origin/Ethnicity": "Telugu",
      "Director": "Sudheer Varma",
      "Cast": "Nikhil Siddharth, Ritu Varma, Isha Koppikar, Rao Ramesh",
      "Genre": "action thriller",
      "Wiki Page": "https://en.wikipedia.org/wiki/Keshava_(film)",
      "Plot": "The movie begins with a family of 4 going in a car when they are suddenly hit by a police car. The woman dies on spot and the man is heavily injured. A police officer comes out of the car and has a look at them when the injured man asks for help but the police officer ignores and tells other officers in the car to keep moving forward. Keshava, the boy in the car is also alive. He is shocked to see his family dead right in front of his eyes.Then he wakes up in a hospital and starts to search for his family members, where he gets to know that his parents are dead but his sister is alive but has lost her legs. The movie now moves to the present where Keshava (Nikhil Siddharth) is in a forest road walking and asking for lift. Then a man on bike gives him lift. After moving some distance he stops along roadside to attend the nature call and Keshava kills him on the spot. Keshava now tells us about himself that he is a law student who has his heart on his right side, and an increase in his heart rate may result in his death. He thus can't play sports or do anything that may get his heart rate up, so he has to do everything calmly, even a murder. A fisherman happens to be on a boat catching fish near by the river area where Keshava killed the police officer, when he sees the murdered body hanged to a tree near the river. He calls the police immediately, and they arrive and try searching for some clues, where they get to know that he was a police officer. Keshava is now in his college. Satyabhama (Ritu Varma) now joins the college and is in the same class as Keshava. Satyabhama is Keshav's childhood friend, but he doesn't speak a word to her. After the class, Satyabhama hears someone call out Keshava, and again has a doubt whether he was her long lost childhood friend. She goes to him and asks him, but he disagrees. The police still try finding clues, but aren't successful. The commissioner now appoints a special officer called Sharmila mishra (Isha Koppikar) to solve this case. Keshava now sees another police officer, and remembers him from his childhood, when his sister and him were admitted in the hospital, and that police officer searched them to kill on the order by someone.Keshava had then run away with his sister, but now, he follows the police officer and kills him in a stylish way. Officer Sharmila reaches the spot and sees the police officer's body hanged to a construction crane. She then concludes that the culprit of both these murders is the same, and that he is trying to communicate with them. She says so because the culprit could have hidden both the bodies easily, as the murders took place in secret areas, but the culprit chose to hang them. She studies both the bodies, and concludes that the culprit is left-handed, which actually happens to be true. In the college, Satya as well sees Keshava writing with his left hand, and is sure that he is her long lost friend, but doesn't understand why he doesn't agree. She follows him for a couple of days, and sees him reading newspapers about murders about police officers. She takes the attendance register from the person and sees that Keshava was absent on both the days when the murders took place. She reaches his home and makes him admit that he is her long lost friend. Keshava, Satyabhama and his friends go to Annavaram and there he comes across another police officer (Raja Ravindra) and recognises him to be the one who had left his family to die even after seeing their status. He reaches his home and after a small fight, he kills that police officer as well. But while escaping, he is seen by two other people who throw a stone towards him causing an injury on his head at the back. When he returns his room, his friends confront him to which he confesses his past and his activites. His friends decide to join hands with him and help him. Due to the clue of his head injury, he gets caught next day and police takes him to Visakhapatnam for interrogation. During interrogation, he completely denies murdering anyone and to his surprise, ex cop (Rao ramesh) is again attempted to murder while he is in custody. So he gets released.After that keshava meets the officer he says that he is one of the officer who are responsible for his parents death. He explains that they were came to security in election duty after completion of election Nakul(ajay) and his co. were in drunken state they neglected the request to drive of him instead he droved. Finally they get with an accident. he confess that he tried to stop them but they neglected his words. He saved keshava because this people want to be punished for their deeds and he promise to him that he will help him on whichever extent. Sharmila later meets Keshava and Keshava admits that he is the murderer and tells her that his revenge is not only because of the accident but because that the police team came back and ran their jeep over the bodies of Keshava's family causing paralysis to his sister and death of his parents. And then he kills other officer (Brahmaji), Nakul tries to locate kesava in various circumstances and fails. Meanwhile in an eventual circumstance sharmila got suspicion on the Rao ramesh. He observed it and kidnaps her. At the same time keshava is kidnaped by nakul's henchman on the spot nakul is killed by kesava with the help of one of his henchmen.In a hideout the heated argument between the shamila and rao ramesh he admits that his remaining half truth which he didn't told to kesava. He observed the murders of his ex-colleagues he remembered about that incident. Remaining half truth is that the cops all were in drunken state including him. Actually he was in the driver seat when the accident were took place and he confess that he was the prime culprit behind the death of kesava's parents. He saved kesava because he is a binami holder of nakuls property, if he dies he can take over the properties of nakul and to save himself from kesava. Meanwhile in the process he found the hideout of him and he heard the entire confession of him. Then in a rough chase rao ramesh met with an accident, then kesava meets in the spot and warns him that don't drunk and drive in his next life and he fires the car through petrol and left. Then sharmila makes it as a car accident and finally she closes the case. Then kesava starts a new life with his sister and his lady love."
  },
  {
      "Release Year": 2017,
      "Title": "Rarandoi Veduka Chudham",
      "Origin/Ethnicity": "Telugu",
      "Director": "Kalyan Krishna Kurasala",
      "Cast": "Naga Chaitanya, Rakul Preet Singh, Jagapati Babu, Sampath Raj, Vennela Kishore, Posani Krishna Murali, Balireddy Pruthviraj",
      "Genre": "romance/drama",
      "Wiki Page": "https://en.wikipedia.org/wiki/Rarandoi_Veduka_Chudham",
      "Plot": "The story begins in a village as a tale of three best friends Krishna (Jagapathi Babu), Adi Narayana (Sampath Raj), and Prabhakar (Irshad). Adi Narayana has a huge family, and one day, his elder sister Priya (Priya) gets engaged. Ten days before her wedding, she elopes, leaving behind a letter that she has loved another man, and has gone to live with him. Due to some misunderstanding, Krishna is suspected, and the friendship turns into enmity.\r\nThe story moves forward twenty five years, with Bhrahmaramba (Rakul Preet Singh), the innocent and heavily pampered only daughter of Adi Narayana, who has little to no exposure to the outside world. She dreams of getting married to a groom who has the qualities of a prince, as said by her grandmother. Siva (Naga Chaitanya), the son of Krishna, meets Bhrahmaramba in his brother Kishore's (Vennela Kishore) marriage with Bhramarambha's friend and falls in love with her at first sight. After playful encounters, they separate ways. Bhramarambha eventually comes to Vizag, Siva's hometown, for her studies. She quickly finds out that Siva lives in Vizag and they spend a lot of time together, with her sharing everything with him. She tells him that she is not interested in a relationship with him. Siva loves her, but in fear of rejection , doesn't reveal his love. Later they get into an argument, with Siva revealing his love for her and being frustrated on her not having a clarity on her life and that she keeps waiting for a prince and doesn't realize what she has. Bhramarambha furiously returns home, and accepts a marriage proposal by her cousin out of anger. Rest of the story is how Siva finally makes Brahmaramba realize him as her Prince and resolves disputes between both families."
  },
  {
      "Release Year": 2017,
      "Title": "Journey to the West: The Demons Strike Back",
      "Origin/Ethnicity": "Chinese",
      "Director": "Tsui Hark",
      "Cast": "Kris Wu, Lin Gengxin, Yao Chen",
      "Genre": "comedy / fantasy / adventure / costume",
      "Wiki Page": "https://en.wikipedia.org/wiki/Journey_to_the_West:_The_Demons_Strike_Back",
      "Plot": "The monk Tang Sanzang (Kris Wu) finds himself as a giant in a city in India. His master congratulates him on reaching India and retrieving the Sutras, and gives him a halo as a reward. The halo, however, malfunctions and Tang awakes from his dream to find himself in an alley in a village of circus performers with his three disciples: Sun Wukong (Lin Gengxin); Zhu Bajie (Yang Yiwei); and Sha Wujing (Mengke Bateer). Tang encourages Sun Wukong to perform for the villagers, but the disciple refuses. Angered by this stubbornness, Tang provokes Sun Wukong by calling him a \"bad monkey\", which causes Sun Wukong to smash the village and damage the villagers' homes in his temper. The terrified villagers present the group with money and food for their travels, but Sun Wukong continues wreaking havoc, sending Zhu Bajie and Tang flying through the air. That night, Tang whips Sun Wukong for his disobedience.\r\nThe next morning, Tang goes to find water for their breakfast congee and comes across a house. Its host, a beautiful woman in a splendid outfit (Wang Likun), welcomes them all in for breakfast with her companions. Sun Wukong, however, sees through their disguises as spider demons; he purposely provokes them, until she and the others show their true form. During the subsequent battle, the demons come together to form one huge spider. After being poisoned by the spider, Sha Wujing falls ill and slowly bloats into a fish-like creature. Sun Wukong defeats the spider and Tang attempts to exorcise her, but Sun Wukong smashes in the demon's head with one blow. Once more, Tang is annoyed at Sun Wukong's disobedience and whips him again that evening. Later that night, the enraged Sun Wukong discusses with the other disciples his plans to kill Tang, but the others fear Tang's mighty Buddha Palm powers. Tang overhears this conversation and prays to Buddha to help him and also confesses that he actually does not know, or have, Buddha Palm powers. Zhu Bajie overhears this admission and tells Sun Wukong, who challenges Tang to a fight. Just as Sun Wukong is about to strike, a blinding ray of light shines from the heavens and he retreats.\r\nThe next day, the group pass into the capital city of the Biqiu Kingdom and a minister (Yao Chen) comes out to greet them and bring them to see the king: an immature and childlike man who likes to play games. The king orders Tang to perform for him but the monk doesn't have anything to showcase. Sun Wukong therefore pastes an \"obedience sticker\" on Tang allowing Tang to copy his actions and perform stunts for the king. Sun Wukong, however, goes too far and makes Tang slap the king continuously, who throws them all out. Tang orders Sun Wukong to return and apologize, but it is revealed that Sun Wukong purposely provoked the king to make him reveal his form as the demon Red Boy. They fight and Sun Wukong defeats Red Boy, also freeing the true king of Biqiu (Bao Bei'er) from his cage under the throne. As a reward for helping him, the king presents them with a beautiful girl, Felicity (Lin Yun), to accompany them on their travels. As Felicity dances for them, Tang is reminded of his deceased lover, Ms Duan (Shu Qi).\r\nThe group set off and on the way, Sun Wukong realizes that Felicity is actually a demon. Tang, however, does not believe him, so they set off to visit Felicity's home village. Sun Wukong becomes enraged with Tang's lack of trust in him and that night he destroys the whole village, killing everyone. Tang stops him from killing Felicity, further angering Sun Wukong, who attacks Tang, but Felicity finally confesses that she is actually the demon White Bone Spirit and that the whole village was an illusion conjured by her. Sun Wukong flares up and turns into a giant gorilla and swallows Tang. At that moment, the minister and Red Boy arrive and see that Monkey has fallen for their trick.\r\nThey had deliberately sent Felicity with the group to cause strife between Tang and Sun Wukong, so Sun Wukong would kill his master. Sun Wukong spits Tang out, however, as they had, in fact, known this all along, but played along with story, so that the minister would reveal her true form. They battle and the minister creates an illusion of Buddhas surrounding Monkey, using them to fight him. The real Buddha, however, uses his giant palm to destroy the false Buddhas and reveals the minister's real identity as the Immortal Golden Vulture.\r\nAfter the battle, Tang heads back to find Felicity. He has no choice but to free her soul as there is too much demon in her. When Felicity asks Tang if he loves her, Tang replies that he has only one person in his heart. The animosity between Tang and Sun Wukong has finally dissolved; Sha Wujing sneezes out the poison and turns back to his human form. All three along with Zhu Bajie continue their journey to the West through a desert."
  },
  {
      "Release Year": 2017,
      "Title": "The Village of No Return",
      "Origin/Ethnicity": "Chinese",
      "Director": "Chen Yu-hsun",
      "Cast": "Shu Qi, Wang Qianyuan, Joseph Chang",
      "Genre": "drama / comedy / fantasy / costume",
      "Wiki Page": "https://en.wikipedia.org/wiki/The_Village_of_No_Return",
      "Plot": "It is an unusual day for the remote and isolated Desire Village. A mysterious Taoist priest brings a magical equipment that can erase one's memory. Since then, all the villagers have forgotten their past, living \"happily ever after\", while the dangerous plot behind their back is just about to be."
  },
  {
      "Release Year": 2017,
      "Title": "The Founding of an Army",
      "Origin/Ethnicity": "Chinese",
      "Director": "Andrew Lau",
      "Cast": "Liu Ye, Zhu Yawen, Huang Zhizhong",
      "Genre": "drama / history",
      "Wiki Page": "https://en.wikipedia.org/wiki/The_Founding_of_an_Army",
      "Plot": "The story begins in 1927 at the beginning of the Nanchang uprising, known as the first major Kuomintang–Communist engagement."
  },
  {
      "Release Year": 2017,
      "Title": "Cook Up a Storm",
      "Origin/Ethnicity": "Chinese",
      "Director": "Raymond Yip",
      "Cast": "Jung Yong Hwa, Ge You, Nicholas Tse, Tiffany Tang",
      "Genre": "drama / action",
      "Wiki Page": "https://en.wikipedia.org/wiki/Cook_Up_a_Storm",
      "Plot": "The story focuses on two young talented chefs, Sky Ko (Nicholas Tse), a southern-style Chinese chef, and Paul Ahn (Jung Yong-hwa), a Michelin-starred Korean chef trained in France. Both with reasons to climb the culinary ladder as top chefs. In the past, when Sky was ten years old, his father, Mountain Ko ( Anthony Wong), left him behind with his friend, Uncle Seven (Ge You), master chef of Seven Restaurant. When asked why, Mountain told Sky that he has no talent as a cook and Mountain would only take him back if he can prove to be a great cook. In reality though, Mountain chose to pursue his culinary career over being a father and made the excuse that Sky can't even make a decent bowl of noodles right to make him a worthy son. Because of that, Sky spent the next twenty years to become a great chef under Uncle Seven's training. On the other side, Paul made a promise to his dying father that he would become a great cook. Through that journey, he became a highly successful chef in Europe and decided to run his own restaurant in Hong Kong, Stellar. However, this would bring conflicts to both Paul and Sky.\r\nIn an old area of Hong Kong, Sky is now an acclaimed chef at Seven. However, the Li Management Group arrived and started buying various properties of the old sector, including developing Stellar for Paul. The opening of Stellar proved to be a threat to Sky as these two chefs find themselves fighting for the best ingredients in the markets and maintaining their clientele. Stellar's fine haute cuisine represented a form of aggressive gentrification to the neighborhood and a threat to traditional Chinese cuisine. Their rivalry began with a challenge for the best fish and the culinary masters agreed to face each other in a culinary duel. Sky made a traditional salt-baked duck while Paul made a foie gras sorbet. While both tied in points, the judges gave victory to Paul as his dish presentation was superior to Sky's bland plating. Although the victory should've solidified Paul's abilities as a cook, things didn't go as expected.\r\nMayo is Paul's sous chef and girlfriend. It was while celebrating their victory that the manager of Li Group tells Paul he wants to replace him with Mayo, reasoning that a woman is far more appealing on media than a man. Betrayed and confused, Paul tried to defend his position as head chef, but Mayo exposed his dark secret: he can't taste everything. Paul has problems tasting certain flavors, especially saltiness. To compensate, he would utilize a notebook that contains all his recipes and have others test taste to compensate for his poor sense of taste. To make matters worse, the manager announces that he and Mayo are romantically involved. Mayo explained to Paul that she never loved him and only sided with him to surpass him. Now that she can take the title as executive chef of Stellar, she doesn't need Paul anymore. Angry that he has lost everything, Paul left.\r\nIt was while at an event stadium, Sky would bump into Paul drinking. Both shared their past and troubles and found mutual respect for each other. Both have a common goal of reaching to the culinary top and decided to team up. At Seven, the Li Group wants Uncle Seven to sign away his restaurant as the group is buying off the old sector to make it their own. Unrelenting to surrender, Uncle Seven refused. It was then Paul and Sky appeared, announcing their partnership. Paul reminded the manager that he was the winner of the competition, which makes him eligible to compete at the culinary championship, not the Li Group. Surprised by that technicality, the Li Group left, not before the manager called Paul a traitor. Sky would train Paul in the ways of Chinese cooking as well as developing Paul's limited palate to help create something new for the competition.\r\nIn Macau, at the Studio City Casino, attending the 7th International Culinary Competition, Sky and Paul use both their culinary strengths to compete against four other great chefs. Whoever wins the competition will gain the chance to face the current God of Cookery, Mountain Ko. In this competition, they have a French team, Indian team, a Japanese chef, and Mayo to face off. Mayo somehow still got into the competition and now uses her training against Paul. The French team made a roasted squab dish, the Indian team made a five-flavor curry, the Japanese chef made koi nigiri, Mayo made an oyster dish with frozen foam, and the duo made a deconstructed mapo tofu. Paul used Sky's sense of taste to help him determine the flavor of the ingredients they used to cook and Sky relied on Paul's knowledge of molecular science and culinary artistry to create a traditional dish with a modern design. The winner goes to Paul and Sky. Although Paul had limited tasting ability, his artistry and cooking imagination exceeds Mayo and she lost, visibly embarrassed.\r\nThe next round is to face Chef Ko. Paul pointed out only one chef can compete against Mountain and he realized Sky's desire to beat Mountain was a very personal one. Grateful he managed to make it this far with his condition, Paul gave Sky the chance to face his father. In the final competition, Sky finally faces his father and the judges allow the two to cook anything they wanted as long as it is considered the highest expression of cooking. While Mountain began cooking, Sky was at a stand, thinking about how Seven and the people in the neighborhood means the most to him. Mountain angrily splashed water at his son's face, demanding him to focus and show him something. Mountain created a beautiful artistic sugar display of molten lava with a single flower on top. Sky went for something far more personal, it was a personal interpretation of the original noodle dish that Mountain made all those years ago before abandoning Sky. Before the judges could even score the dish, Sky gave the bowl of noodles to Mountain and he was moved as he remembered what the noodles meant. Acknowledging his skills as a chef, Mountain called his son brilliant before Sky walked off the stage. Mountain would continue to emotionally eat his noodles, unclear of a victor.\r\nSome time has passed and the people at Seven are getting ready for a poon choi Chinese New Year party with the neighborhood's people. Much of the ending is left to personal interpretation, as the culinary championship, personal relations, and the fate of the neighborhood are left unresolved. The movie ends with the staff of Seven announcing: We wish you all 2017 a happy rooster year!"
  },
  {
      "Release Year": 2017,
      "Title": "Wolf Warriors 2",
      "Origin/Ethnicity": "Chinese",
      "Director": "Wu Jing",
      "Cast": "Wu Jing, Frank Grillo, Celina Jade, Wu Gang, Hans Zhang",
      "Genre": "action",
      "Wiki Page": "https://en.wikipedia.org/wiki/Wolf_Warriors_2",
      "Plot": "After the events of Wolf Warrior, Leng Feng and members of his special-ops team bring his comrade's remains back to his home town and his comrade's family for his funeral, only to see it on the verge of being torn down completely. A real estate company is pulling down his house and that of his comrade's family during the funeral. The boss of the real estate company confronts them with a gun and sneers at them for presenting the remains to the family, only for the boss to be kicked to the ground. The boss calls on his henchmen to attack them but they are all swiftly disabled by Feng and the other soldiers. Police arrive shortly after and ask Leng Feng to put down the gun he confiscated from the boss. The boss gets back up and boasts that he will \"make the family wish they were dead\", enraging Feng to a point that he kicks the boss in the stomach, sending him crashing onto the windshield of a police car and killing him. Leng Feng is sent to a military prison for two years and discharged from the Chinese army.\r\nAfter release from prison, Feng leaves for Africa, planning to wander for the rest of his life. While serving as a mercenary providing security on a freighter delivering relief supplies to Africa, he foils an attempted hijacking by Somalian pirates by defeating them in hand-to-hand combat underwater. The freighter arrives safely at its destination. For three years Feng has been carrying a bullet which he found, a clue to the kidnapping of his fiancée, Lieutenant Colonel Long Xiaoyun, that happened while she was on a mission.\r\nFeng and some locals are partying on a beach one day when they are attacked by rebel forces aiming to overthrow the government of the African nation. Shortly after the arrival of the Rebels and mercenaries who overrun the government troops, the Chinese fleet arrives to evacuate Chinese nationals caught up in the civil war. While on board, a Chinese shop owner that he helped rescue tells him that the bullet he is carrying belongs to European mercenaries who are helping the rebels. After overhearing guards talking about needing someone to rescue workers at a factory and an important doctor who knows the vaccination for Lamanla (Dr Chen), Leng Feng volunteers. However, he is on his own as no other personnel can follow him while they are on foreign soil without permission from the Chinese military's higher authorities. He travels to the hospital, 60 kilometres away from the dock and enters the hospital building just as Dr Chen is accidentally killed by the mercenaries. With his dying breaths Dr Chen tells him to take his daughter, an African girl named Pasha. Leng Feng and Pasha, along with a female doctor Rachel Smith, escape the grip of the mercenaries. While escaping, he cuts his hand in a pile of Lamanla infected bodies but shakes it off and moves on. They continue their mission of saving Chinese as Leng Feng also goes to save his good friend's mother, who's working in the Hanbound factory.\r\nUpon arriving at the Hanbound factory, Feng is confronted by security and the factory's owner's son, Zhou Yifan, a cocky fuerdai who is also an army fanatic. Big Daddy's mercenaries attack the factory to capture Pasha, thinking she is the one who has the cure for Lamanla. At the factory, Feng tells everyone that the Chinese fleet will be sending a helicopter to rescue them. The women and children will evacuate via helicopter and everyone else will walk to the fleet. Feng with his old pal and Yifan saved the factory crew members from the red scarf members and deadly mercenaries. Feng is about to be killed when Big Daddy, the other mercenaries and rebels are ordered to fall back. The leader tells Big Daddy that no Chinese can die because he needs China when he is in power, since China is part of the United Nations Security Council. Big Daddy kills the leader of the rebellion and takes over as leader. He orders everyone to go back to the factory to retrieve Pasha and kill Feng. In the factory, Feng chooses to leave as the factory workers learn of his infection with Lamanla. He is injected with a cure for the virus and learns from Rachel that Dr Chen manufactured a cure using infected patients that built immunity to the virus, in this case Pasha.\r\nBig Daddy and the others arrive at the factory to capture Pasha and kill Feng. They round up the workers and wait for the Chinese helicopter to arrive. Feng arrives with Rachel and Pasha to rescue everyone trapped in the factory. The workers are saved and the helicopter arrives. Pasha and Rachel leave via helicopter, but it is shot down. The battle continues with everyone taking cover. Seeing the massive casualties taking place, the Chinese fleet fire missiles taking out the tanks. Meanwhile in the battle while confronting Big Daddy, Feng learns that the bullet which killed his fiancée belonged to Big Daddy and, driven by rage over his fiancée's death, kills Big Daddy and saves all the crew members by taking them to UN camps.\r\nIn the mid-credits scene, Feng is allowed by his commander to return to his military squadron, but is shown in a video that his fiancé Long Xiaoyun is still alive."
  },
  {
      "Release Year": 2017,
      "Title": "Brotherhood of Blades 2",
      "Origin/Ethnicity": "Chinese",
      "Director": "Lu Yang",
      "Cast": "Chang Chen, Yang Mi, Zhang Yi",
      "Genre": "action / martial arts / costume",
      "Wiki Page": "https://en.wikipedia.org/wiki/Brotherhood_of_Blades_2",
      "Plot": "The film starts with the Battle of Sarhu, where the Ming dynasty army has been overrun by the Later Jin forces. A Ming soldier, Shen Lian, saves Lu Wenzhao from Jin soldiers who were rounding up and executing any remaining Ming soldiers.\r\n8 years later, Shen Lian(Chang Chen) is a Captain of the guards in Southern Beijing. Lu Wenzhao is his superior officer who endears himself to the higher-ups by using any possible way. On a case related to the death of Master Guo, he is forced by a rival Lieutenant Ling, to pursue and arrest his subordinate Yin Cheng for an alcohol-induced rant against the Emperor. However, Yin Cheng commits suicide.To pray for his subordinate's soul to be released from purgatory, Shen Lian buys Bei Zhai paintings from a monk, Master Jinghai, who commends Shen Lian on his frequent purchase of Bei Zhai paintings. On his way, he gets caught in the rain, and is offered shelter under an umbrella by an unknown woman, who, despite him being in the Imperial uniform, is not afraid of him.\r\nAt the same time, Lu Wenzhao is trying to appease the powerful court eunuch Master Wei to gain his favor. Accordingly, he orders Lieutenant Ling, Master Wei's nephew to kill Bei Zhai, who is maligning Master Wei's reputation through her paintings. Shen Lian tags along to see if its Bei Zhai, the painter. On reaching the house, they discover that Bei Zhai(Yang Mi) is a woman, the same one who gave Shen Lian shelter from the rain. When Lieutenant Liang tries to rape Bei Zhai before killing her, Shen Lian protests, and a fight erupts between the two, which culminates in Shen Lian accidentally killing Ling. Bei Zhai, having witnessed this, escapes, with Shen Lian too injured to pursue her. Shen Lian covers up his role in Ling's murder and gives a statement that two assassins ambushed them and killed Ling. The case is being handled by Captain Pei Lun, who seems to have a dislike for Captain Shen Lian. It is later revealed that Yin Cheng was Pei Lun's only friend, and that he hates Shen Lian for the death of Yin Cheng.\r\nA group of assassins contact Shen Lian to reveal that they know of his role in Ling'g murder, and that they will expose him using Bei Zhai if he does not set fire to the Imperial Archives. Left with no other choice, Shen Lian complies, but deduces that the assassins were targeting to destroy a ship construction log book, which could be used as evidence in an investigation on the attempt on the life of the current Emperor, who has been bedridden with pneumonia ever since. Shen Lian burns the archive, but keeps the log book. When the assassins, having seen that the archive has been burnt, try to kill Shen Lian, he threatens them with the exposure of the log book if anything happens to his life. He offers to exchange Bei Zhai for the log book and leaves. Shen Lian later encounters Bei Zhai at his home looking for the log book which is important to keep the name of the man she loves being maligned. Captain Pei Lun mistakes her for Shen Lian's wife.\r\nAfter imprisoning Master Jinghai, who is the only known person who sells Bei Zhai paintings, Pei Lun deduces Shen Lian to be involved in Ling's murder, and presents his findings to Lu Wenzhao privately. However, it turns out that Lu Wenzhao is working with the assassins and stabs Pei Lun in the back, who escaped barely alive to be found by Shen Lian and Bei Zhai, who nurses him and reveals her true identity. Bei Zhai tells that person she loves had saved her life years ago when her family was murdered for expressing their views against the emperor, and that he had promised her to end the brutal rule of Master Wei and all those associated with him. Seeing that Bei Zhai intends to go to any length for the man she loves, Shen Lian allows her to leave with the log book, but she returns to him to help him and Pein Lun on seeing that they have been branded as criminals.\r\nShen Lian deduces that the Prince Zhou Youjian was Bei Zhai's lover, and goes to him to return the log book and keep Bei Zhai safe. However, the Prince, on seeing that Bei Zhai might be a loose end which could be used against him, offers Shen Lian freedom in exchange for him killing Bei Zhai. Shen Lian refuses, and leaves Beijing with Pei Lun and Bei Zhai, intending to go to Suzhou. However, the Prince orders his assassins, including Lu Wenzhao and Ding Baiying to pursue and kill them. At the same time, the Prince succeeds in convincing the eunuch Master Wei that he is being targeted by Lu Wenzhao, which prompts Master Wei to order the soldiers to eliminate Lu Wenzhao and everyone associated with him.\r\nWhen Lu Wenzhao catches up to Shen Lian's group, Shen Lian convinces Bei Zhai to cross over to Yi mountain alone via a rope bridge, with him and Pei Lun staying behind to stop the pursuing forces. Though Shen Lian and Pei Lun get the better of Lu Wenzhao and Ding Baiying, the imperial forces ambush both groups, and Lu Wenzhao realizes that he has been played for a fool by the prince. Both groups try and fight back the imperial forces together. On seeing that Shen Lian might be in danger, Bei Zhai returns, which prompts Shen Lian to cut off the rope bridge to keep her safe. While Pei Lun, Ding Baiying and Lu Wenzhao are killed, Shen Lian is revealed to have survived and in prison. When the Prince comes to power, he expels Master Wei from the Royal Court, and reinstates Shen Lian as an Imperial soldier, though this time as a Lieutenant, which is the premise for the first movie, Brotherhood of Blades."
  },
  {
      "Release Year": 2017,
      "Title": "Meow",
      "Origin/Ethnicity": "Chinese",
      "Director": "Benny Chan",
      "Cast": "Louis Koo, Ma Li, Liu Chutian",
      "Genre": "comedy / fantasy",
      "Wiki Page": "https://en.wikipedia.org/wiki/Meow_(film)",
      "Plot": "In the distant corners of the universe, a planet of cats known as \"Meow\" exists where its creatures are more civilized than earthians. Thousands of years ago, the king of Meow has been sending messengers to inquire the Earth, hoping to prepare for an invasion. However, over the years, every messenger sent to Earth never returned forcing the king to put aside his plans.\r\nToday, the king decides to re-ignite his plan and selects the bravest and mightiest warrior of Meow, Pudding, as a vanguard to Earth. However, during the journey, Pudding loses a divine Meow device that can resist the particles of Earth and loses his divine powers. As a result, the lean-built Pudding becomes a giant fat cat Sai-sai-lei. Sai-sai-lei is then adopted by as a pet by a family consists of Ng Sau-lung (Louis Koo), his wife Chow Lai-chu (Ma Li), their elder son Ng Yau-choi (Andy Wong) and younger daughter Ng Yau-yau (Jessica Liu). Sai-sai-lei has no choice but to hide in the Ng household before finding his device to invade Earth. In order to start the invasion, Sai-sai-lei plans to cause chaos to the Ng family but after living and getting along together, Sai-sai-lei is moved by the family's love and sincerity and loses his desire for warfare. However, one day, Sai-sai-lei suddenly recovers his device."
  },
  {
      "Release Year": 2017,
      "Title": "Wu Kong",
      "Origin/Ethnicity": "Chinese",
      "Director": "Derek Kwok",
      "Cast": "Eddie Peng, Ni Ni, Oho Ou, Shawn Yue, Zheng Shuang",
      "Genre": "action / fantasy / costume",
      "Wiki Page": "https://en.wikipedia.org/wiki/Wu_Kong",
      "Plot": "Set 500 years before the Monkey King wreaks havoc in the heavenly kingdom, it tells the stories of Wukong who, unwilling to bow down to his own destiny, sets out to rebel against the gods."
  },
  {
      "Release Year": 2017,
      "Title": "Reset",
      "Origin/Ethnicity": "Chinese",
      "Director": "Chang",
      "Cast": "Yang Mi, Wallace Huo, Chin Shih-chieh",
      "Genre": "action / science fiction",
      "Wiki Page": "https://en.wikipedia.org/wiki/Reset_(2017_film)",
      "Plot": "Xia Tian (Yang Mi) is a research scientist with Nexus Corporation. Her team, under the leadership of the Director (King Shih-Chieh), are working on wormhole technology to allow people to travel to parallel universes. However, the technology in its current state causes test animals to become aggressive and their cells to break down. IPT Lab, a competing agency that was working on the same technology, hires Tsui Hu (Wallace Huo) to steal Nexus's research.\r\nTsui Hu kidnaps Xia Tian's son, Dou Dou (Hummer Zhang) and gives Xia Tian one hour to bring him all the research. Xia Tian gets the research but is late reaching Tsui Hu, so he kills Dou Dou. Unable to live without her son, Xia Tian returns to the Nexus building, where she uses the particle accelerator to travel to a parallel universe, but back in time by one hour and fifty minutes.\r\nIn the second universe, Xia Tian takes her doppelgänger's place and, knowing how events play out, is quicker about getting the research to Tsui Hu. She recovers Dou Dou, but tricks Tsui Hu by giving him fake data. Tsui Hu chases the pair down and kills Dou Dou.\r\nXia Tian travels to a third universe, which now has three versions of her. The original Xia Tian (#1), who has become highly aggressive, arrives just as her second doppelgänger (#2) has cheated Tsui Hu and recovered Dou Dou. The two Xia Tians work together to avoid Tsui Hu and his goons, and Dou Dou is safely sent away to a hospital.\r\nThe three Xia Tians then learn that the Director is working with Tsui Hu, out of anger from being fired and the project handed over to Xia Tian. The Director suggested kidnapping Dou Dou to punish Xia Tian and force her to prove that the technology worked. Tsui Hu is also revealed to have been one of the test subjects at IPT Lab, and hopes to travel to a universe where he can save his wife and child. In a confrontation over the research data, Tsui Hu kills the Director, and is shot himself by Xia Tian #1. As he dies, Tsui Hu warns the women that the test subjects at IPT Lab turned on each other, and the women will do the same.\r\nThe three women have a standoff in the Nexus lab, with Xia Tian #1 determined to be the only one left to be with Dou Dou. She is killed by Xia Tian #2, who has accepted that she will die from cell deterioration. Xia Tian #3, who has not traveled across universes and is unchanged, is allowed to leave for the hospital, where she is reunited with Dou Dou. Left alone in the Nexus Lab which is about to explode, Xia Tian #2 turns on the particle accelerator, but it is unclear if she traveled to another universe, or if she died in the explosion.\r\nA year later, the surviving Xia Tian is unemployed but living a happy, simple life with Dou Dou."
  },
  {
      "Release Year": 2017,
      "Title": "God of War",
      "Origin/Ethnicity": "Chinese",
      "Director": "Gordon Chan",
      "Cast": "Vincent Zhao, Sammo Hung, Wan Qian",
      "Genre": "action / biography / history / war / costume",
      "Wiki Page": "https://en.wikipedia.org/wiki/God_of_War_(2017_film)",
      "Plot": "In 1557, Japanese samurai warriors involved in wokou piracy terrorized and took control of the coastline villages in China. The Chinese General Yu Dayou (Sammo Hung) with the help of General Qi Jiguang (Vincent Zhao) had to create strategic methods and weapons to defeat the pirates.[citation needed] To prepare for battle against the ruthless pirates, General Qi convinces his leader to allow him to train a new army. General Qi then recruits and trains some brave villagers to become his new army."
  },
  {
      "Release Year": 2017,
      "Title": "China Salesman",
      "Origin/Ethnicity": "Chinese",
      "Director": "Tan Bing",
      "Cast": "Ethan Li, Janicke Askevold, Mike Tyson",
      "Genre": "drama / action",
      "Wiki Page": "https://en.wikipedia.org/wiki/China_Salesman",
      "Plot": "A young Chinese engineer discovers a conspiracy and is the only one who can stop it."
  },
  {
      "Release Year": 2017,
      "Title": "Dealer/Healer",
      "Origin/Ethnicity": "Chinese",
      "Director": "Lawrence Ah Mon",
      "Cast": "Sean Lau, Gordon Lam, Louis Koo",
      "Genre": "action / crime",
      "Wiki Page": "https://en.wikipedia.org/wiki/Dealer/Healer",
      "Plot": "During the 1960s-70s in Hong Kong, when the police were corrupt and triads ruled the city, it was the glorious days days for Chan Wah (Sean Lau), La Ba (Gordon Lam), Kitty (Zhang Jin) and their brothers. Chan, who was very arrogant, was regarded as the leader of the \"Thirteen Naughty Children of Tsz Wan Shan\". Chan later meets the love of his life, Ho-yau (Jiang Yiyan), and spent his sweetest times with her. However, good times do not as long as Chan was being hunted down for drug trafficking. Fortunately, Chan was able to escape from death with the help of his frienemy, Halley (Louis Koo), who is the leader of the Anti-Drug Unit of the police force, but was unable to escape from the law. After being released from prison, Chan's father died while Ho-yau went missing, causing him to greatly blame himself. Chan realized his past mistakes and is determined to turn over a new leaf. Not only does he actively participate in helping youths rehab from drugs, he was also awarded as one of the Ten Outstanding Young Persons of Hong Kong. He also influenced La Ba and Kitty to the right path and helped mediate disputes among the triads and garnered great respects from both the triads and the police. Once while attending a drug treatment lectures in Japan, Chan encounters Ho-yau and once again wants to be together with her."
  },
  {
      "Release Year": 2017,
      "Title": "Shock Wave",
      "Origin/Ethnicity": "Chinese",
      "Director": "Herman Yau",
      "Cast": "Andy Lau, Jiang Wu, Song Jia",
      "Genre": "action / suspense / crime",
      "Wiki Page": "https://en.wikipedia.org/wiki/Shock_Wave_(film)",
      "Plot": "Cheung Choi-san (Andy Lau) is a superintendent of the Explosive Ordnance Disposal Bureau (EOD). Seven years ago, he went undercover and became the undercover protege to Hung Kai-pang (Jiang Wu), a wanted criminal specializing in bombs. During a cash vault robbery, Cheung revealed his undercover identity and whilst coordinating with the police, successfully disposed a bomb, preventing from being detonated. In the event, Hung's criminal gang, in the car where Cheung was in, was captured including Hung's younger brother. However, during the explosive commotions, Hung managed to escape and threatened to return for revenge.\r\nSix months later after the resumption of his position in EOD, Cheung is quickly promoted as a bomb disposal expert in the Hong Kong police force. A year later, a series of bombings occur in Hong Kong, while the police also receive intel that a large number of explosives have been smuggled into Hong Kong, all indications that a major case will occur. As Hong Kong citizens are panicking, the city's busiest underwater tunnel, the Cross-Harbour Tunnel, was blocked by ruthless criminals, with hundreds of citizens taken hostage. Hung, who has nicknamed himself \"Blast\", finally appears, threatening to blow up the tunnel. Facing this counter-terrorism crisis, Cheung must bring Blast to justice and dismantle the devastating conspiracy behind it."
  },
  {
      "Release Year": 2017,
      "Title": "Battle of Memories",
      "Origin/Ethnicity": "Chinese",
      "Director": "Leste Chen",
      "Cast": "Huang Bo, Xu Jinglei, Duan Yihong, Yang Zishan, Hsu Wei-ning",
      "Genre": "drama / suspense / horror / crime",
      "Wiki Page": "https://en.wikipedia.org/wiki/Battle_of_Memories",
      "Plot": "Jiang Feng, a writer, underwent a procedure to erase some of his memories. At the memory center, there was an incident and he dropped his memory-restore-key card. He delivers divorce papers to his wife, but she refuses to sign the divorce papers until he restores his memories back. After his memory restoration procedure, he finds himself in the mind of a serial killer.[5]"
  },
  {
      "Release Year": 2017,
      "Title": "This Is Not What I Expected",
      "Origin/Ethnicity": "Chinese",
      "Director": "Derek Hui",
      "Cast": "Takeshi Kaneshiro, Zhou Dongyu, Sun Yizhou",
      "Genre": "comedy / romance",
      "Wiki Page": "https://en.wikipedia.org/wiki/This_Is_Not_What_I_Expected",
      "Plot": "29-year-old Gu Sheng Nan (Zhou Dongyu) is a chef at Western restaurant in a hotel who is in a secret relationship with the hotel's general manager. After a financial crisis hit the hotel, the manager breaks up with her and she loses her job at the same time. In this state of distress, she meets the picky and arrogant Lu Jin (Takeshi Kaneshiro), who is there to take over the hotel, and forms a relationship with him. They become a couple despite their wildly different personalities, bonding over their love for food."
  },
  {
      "Release Year": 2017,
      "Title": "Mr. Pride vs Miss Prejudice",
      "Origin/Ethnicity": "Chinese",
      "Director": "Li Haishu Huang Yanwei",
      "Cast": "Dilraba Dilmurat, Leon Zhang, Vengo Gao",
      "Genre": "comedy / romance",
      "Wiki Page": "https://en.wikipedia.org/wiki/Mr._Pride_vs_Miss_Prejudice",
      "Plot": "Online writer Tang Nan Nan crosses path with Zhu Hou, a second-generation rich boy “sea turtle”, resulting in hilarious situations and face-offs.[citation needed]"
  },
  {
      "Release Year": 2017,
      "Title": "The Missing",
      "Origin/Ethnicity": "Chinese",
      "Director": "Xu Jinglei",
      "Cast": "Bai Baihe, Stanley Huang, Ming Dao",
      "Genre": "action / crime",
      "Wiki Page": "https://en.wikipedia.org/wiki/The_Missing_(2017_film)",
      "Plot": "The story occurs in the year 2015 in the fictional city of Xuanyu. In the wake of a series of disappearances of children, a police officer named Lin, whose daughter was among the victims, receives a phone call at night from a random man driving a car, who claims to know her daughter's location. However, a truck collides with the man's car, injuring him and resulting in amnesia. According to the man's identity-card, his name is Yang, but the card is noted by the police to be fake. At the hospital, an assassin approaches Yang's room, murdering the police guards, and attempts to murder Yang, but Yang kills him in self-defense. A police officer named Lu attempts to apprehend Yang, but Yang flees the scene and steals enough money from pedestrians to pay for food, clothes, and a hotel room. He proceeds to infiltrate the police station where his belongings were confiscated.\r\nLin realizes that Yang has amnesia, and investigates by herself, despite orders to recuse herself from the case, since she is the mother of one of the victims. She reasons that Yang's priority would be to rediscover his identity by retracing his steps. Noting that among Yang's belongings was a lighter from a KTV club, she follows Yang to the KTV club, where the latter learns that he had a partnership of some kind with Mr Lei. At this point, Yang fights with several assassins before Lin discovers and arrests him. Instead of bringing Yang to the station, however, Lin attempts to interrogate Yang privately, but Yang seizes her gun and escapes again. Yang discovers that Mr Lei is a casino owner, and goes to meet him. It is revealed that Mr Lei is a mob boss who is furious at Yang for somehow double-crossing him. As the mobsters chase Yang, seeking to kill him, Lin appears and rescues him.\r\nAfter one more assassination attempt, occurring at a hotel, Yang and Lin head to a private yacht owned by Mr Lei, hoping to find Lin's daughter. However, they are assaulted by numerous armed mobsters. They resist for a time, and are rescued by a SWAT team, but Yang absconds once more. Meanwhile, Mr Lei is killed by a car-bomb. This time around, by tracking the finger-print of the dead assassin from the hospital, they arrive at an MMA club. Yang eventually regains his memory, realizing that he is an undercover agent from the central government, that the child disappearances were part of an organ harvesting ring conducted by Mr Lei, and that Lu was working with Mr Lei in exchange for an organ transplant for a relative. Lu murdered Mr Lei using the car-bomb in order to protect his own reputation. In the final scene, Lu attempts to murder Lin, but is shot by Yang and dies."
  },
  {
      "Release Year": 2017,
      "Title": "Extraordinary Mission",
      "Origin/Ethnicity": "Chinese",
      "Director": "Alan Mak, Anthony Pun",
      "Cast": "Huang Xuan, Duan Yihong, Lang Yueting, Zu Feng",
      "Genre": "drama / action / crime",
      "Wiki Page": "https://en.wikipedia.org/wiki/Extraordinary_Mission",
      "Plot": "The film tells the story of an undercover police officer, Lin Kai (Huang Xuan), who accepts an assignment to take down a drug trafficking syndicate from the inside. His mission takes him to the Golden Triangle, where a heroin grower has been holding a police officer prisoner for ten years."
  },
  {
      "Release Year": 2017,
      "Title": "The Devotion of Suspect X",
      "Origin/Ethnicity": "Chinese",
      "Director": "Alec Su",
      "Cast": "Wang Kai, Zhang Luyi, Ruby Lin",
      "Genre": "suspense / crime",
      "Wiki Page": "https://en.wikipedia.org/wiki/The_Devotion_of_Suspect_X_(film)",
      "Plot": "Shi Hong is a brilliant mathematics teacher who is a recluse but likes the active company of his neighbor, divorcee Chen Jing and her young daughter through the thin walls. When Fu Jian, Chen Jing’s abusive ex-husband, suddenly shows up trying to extort money from Chen Jing, threatening both her and her daughter, the situation spirals out of control and Fu Jian is killed. Shi Hong offers to help Chen Jing and her daughter cover up the crime, but when his former classmate and police consultant, Tang Chuan, becomes involved in investigating the murder, Shi Hong must betray his friend’s trust and involve himself in a dangerous cat-and-mouse game that reveals the depths of his feelings for Chen Jing and her daughter. Tang Chuan catches him but only to later understand it was on his own terms and resumes their teenage years friendship which was based on mathematics.[3]"
  },
  {
      "Release Year": 2017,
      "Title": "The Summer Is Gone",
      "Origin/Ethnicity": "Chinese",
      "Director": "Zhang Dalei",
      "Cast": "Kong Weiyi, Zhang Chen, Guo Yanyun",
      "Genre": "drama",
      "Wiki Page": "https://en.wikipedia.org/wiki/The_Summer_Is_Gone",
      "Plot": "The film follows the story of a 12-year-old boy (Kong Weiyi) living in China's Inner Mongolia Autonomous Region.[3]"
  },
  {
      "Release Year": 2017,
      "Title": "Lord of Shanghai",
      "Origin/Ethnicity": "Chinese",
      "Director": "Sherwood Hu",
      "Cast": "Hu Jun, Yu Nan, Rhydian Vaughan",
      "Genre": "drama / action / romance",
      "Wiki Page": "https://en.wikipedia.org/wiki/Lord_of_Shanghai_(film)",
      "Plot": "In the early 20th century. Xiao Yuegui (Yu Nan) is sold as a maid to a Shanghai brothel, where Madam Dai Yu (Bai Ling) doesn't like her because she has a no-count big foot with big breasts. But soon she becomes a lover of Chang Lixong (Hu Jun), who is the gang leader of Hong society. After meeting with Huang Peiyu (Qin Hao), a leader of the secret society and underground resistance movement Tongmenghui, Chang Lixong is assassinated. Xiao Yuegui becames helpless and then goes to the countryside, where she gives birth to a daughter.[3]\r\nYears later, Xiao Yuegui organizes a theatrical troupe named \"Tanhuang Banzi\", and she returns to Shanghai. Under the patronage of the second generation lord of Shanghai Huang Peiyu, she rose to prominence. After falling in love with Huang she learns that he was involved in the assassination of her husband Chang Lixiong. Xiao Yuegui persuades Yu Qiyang (Rhydian Vaughan), an attendant to both lords of Shanghai, to promote justice. After Huang's death, Yu Qiyang replaces him to become the third generation lord of Shanghai.[3]"
  },
  {
      "Release Year": 2017,
      "Title": "Revenge for Love",
      "Origin/Ethnicity": "Chinese",
      "Director": "Chung Siu-hung",
      "Cast": "Yue Yunpeng, Yuan Shanshan, Oscar Sun",
      "Genre": "comedy / romance",
      "Wiki Page": "https://en.wikipedia.org/wiki/Revenge_for_Love",
      "Plot": "A boy had a crush on a girl, but was rejected big time in front of an audience. Many years later, the girl becomes a well known art designer, and the boy becomes a caretaker in a rehab. He befriends a billionaire for saving the old man's life. Backed by the billionaire to go after his love once again, but instead the man wants to get his revenge for the rejection that scared him all those years. He hires a company which specializes in match making, hoping that his dream girl would fall in love with him, so that he could take his turn rejecting her. As the story goes, old feelings come back and the man decides to abandon his plan. Before the man can come clean, his lies are discovered by the girl's ex, who wants to win her love back. With a regretted heart, despite the girl's disappointment in him, he convinces the billionaire to help the girl opening her own art exhibition. She finds out the truth, and finally realizes where her heart should be ..."
  },
  {
      "Release Year": 2017,
      "Title": "Love Contractually",
      "Origin/Ethnicity": "Chinese",
      "Director": "Liu Guonan",
      "Cast": "Sammi Cheng, Joseph Chang, Lam Suet",
      "Genre": "comedy / romance",
      "Wiki Page": "https://en.wikipedia.org/wiki/Love_Contractually",
      "Plot": "Bo is the new assistant to Jin, a beautiful CEO. But he is yet to know her real motive of hiring him. In a trip to Paris, the pair is romantically involved. Jin gets pregnant and breaks up with Bo. Bo goes to Paris again to discover the hidden truth"
  },
  {
      "Release Year": 2017,
      "Title": "Pitch Perfect 3",
      "Origin/Ethnicity": "American",
      "Director": "Trish Sie",
      "Cast": "Trish Sie (director); Kay Cannon (screenplay); Anna Kendrick, Anna Camp, Rebel Wilson, Brittany Snow, Hailee Steinfeld, Alexis Knapp, Ester Dean, Hana Mae Lee, Chrissie Fit, Kelley Jakle, Shelley Regner",
      "Genre": "musical, comedy",
      "Wiki Page": "https://en.wikipedia.org/wiki/Pitch_Perfect_3",
      "Plot": "Three years after the events of the second movie, the Bellas have graduated college, but have jobs which they all hate. Desperate to see each other again to sing once more, Beca (Anna Kendrick), Fat Amy (Rebel Wilson), Chloe (Brittany Snow), Aubrey (Anna Camp), Lilly (Hana Mae Lee), Stacie (Alexis Knapp), Cynthia-Rose (Ester Dean), Florencia (Chrissie Fit), Jessica (Kelley Jakle), and Ashley (Shelley Regner) are all thrilled to learn that Emily (Hailee Steinfeld), now a senior at Barden and leader of the Barden Bellas, has seemingly asked for the Bellas to reunite at an event in New York Aquarium to sing with each other once more. Upon arriving at the reunion they are told that the reunion was not for the Bellas to sing together, but to watch Emily sing with the new Bellas.\r\nThey later gather at a bar in disappointment and Emily apologizes as she thought it would be the only way for them to see each other again. They all express how much they miss each other. Suddenly, Aubrey convinces them to join a USO performance accessed by her Army officer father. If they win the competition, they get to open for DJ Khaled. The Bellas gladly accept, all except for Stacie who is eight months pregnant at the moment and is unable to go with them. The Bellas later arrive at a hangar where two soldiers, Chicago (Matt Lanter) and Zeke (Troy Ian Hall) introduce them to their competition, revealed to be three other groups who use instruments, unlike the Bellas. When the band Evermoist, led by their leader Calamity (Ruby Rose) begin to mock and belittle the Bellas, the competitors are challenged to a riff-off by the Bellas, who leave defeated when the other groups compete using their musical instruments.\r\nThe Bellas are taken to a fancy hotel in Spain, where Chloe begins to catch an eye for Chicago. Fat Amy finds an old stuffed bunny sitting in her bed, which she recognizes as an old toy she used to hold when she was very little as her father Fergus (John Lithgow) sang her to sleep every night. Amy then realizes that her father is staying in the same hotel she is in and is shocked upon the discovery, seeing as how Fergus is a ruthless international crime lord. Later that night, the Bellas are invited to a party at DJ Khaled's suite at the hotel, where Fat Amy splits with the group when she is called to be at a poker tournament. The tournament was set up by Fergus, who promptly begs for Amy to be back in his life. A hesitant Amy finally agrees to do so after seeing how much he has changed. Beca, after having her breasts grabbed by Chloe, who develops a friendship with DJ Khaled's music producer Theo (Guy Burnet), is taken to DJ Khaled's music editing room. Beca produces a mix which impresses Theo who is prompted to send the mix to DJ Khaled. Moments later, the party is thrown into chaos when Aubrey accidentally sets the suite on fire.\r\nThe Bellas are left in disgrace after the incident with no hopes of winning the competition until Stacie calls the girls to inform she has given birth to a baby girl and named her Bella. This motivates the Bellas to just perform their hearts out without trying to win. Back at the USO competition, the Bellas perform tremendously to adoring crowds through different performances, repairing their reputation and chances to win in the process. Fergus is accepted by Amy, who believes he came to one of their performances to see her. He accidentally reveals that he has not seen her perform at all, while confessing that he is only trying to acquire an offshore account Amy's mother set up which contains US$180 million. After Amy shuts out Fergus again, Chicago and Zeke escort her away from her father, who swears revenge on her. Meanwhile, only Beca is asked personally by DJ Khaled to open for him, disregarding the other Bellas. Beca politely declines the offer and leaves to her room. Later, the Bellas are taken away by a Frenchman in a dark grey van out onto a yacht in a nearby harbor. The yacht belongs to Fergus, who is using the Bellas as a means to get Amy to come for him. Amy and Beca hear of the kidnapping and decide to rescue the Bellas. Beca distracts Fergus by having the Bellas perform \"Toxic\" for him and two of his men, just as Amy sets the yacht to explode. The Bellas escape the yacht just before it blows. Fergus survives the explosion and is arrested for his crimes.\r\nAfter the Bellas are rescued by the military, Fat Amy reveals DJ Khaled's proposition to Beca to the others. They encourage her to take the chance, and they all agree that now it's time to move on with their lives, with Amy using her bank account for multiple tributes to singers named Amy, Aubrey trying to be a birthing coach, Flo's juice cart becoming part of an international brand, Chloe getting accepted into vet school, Cynthia-Rose staying at the base to get into flight school, Emily going back to Barden to prepare for her upcoming abnormal psychology test while continuing her songwriting, and Lilly revealing that the reason she was quiet was because she was possessed by Satan and the yacht incident snapped her out of it, and that her real name is Ester. They know very well they'll be separated, but still be connected to each other as a family. Later at the USO's final performance, Beca opens for DJ Khaled and sings on stage, and afterwards brings up the Bellas onstage for the girls to sing their final performance with the other competitors gladly watching the Bellas sing \"Freedom! '90\" to their hearts' content.\r\nGail (Elizabeth Banks) and John (John Michael Higgins) (who were the Bellas' public announcers in the previous installments) finish filming the Bellas as part of a documentary they have been making about the girls throughout the whole film, only to be appalled when John realizes they didn't record the Bellas' final performance, which was supposed to be the documentary's big ending. A series of mid credit scenes reveal the Bellas' separate story arcs closed out to their mostly happy endings, with Lilly hanging around with DJ Dragon Nutz, whom she flirted with earlier, Aubrey reconnects with her father and Chloe and Chicago share a passionate kiss, much to the amusement of Beca, who is now the boss of Theo."
  },
  {
      "Release Year": 2017,
      "Title": "The Greatest Showman",
      "Origin/Ethnicity": "American",
      "Director": "Michael Gracey",
      "Cast": "Michael Gracey (director); Jenny Bicks, Bill Condon (screenplay); Hugh Jackman, Zac Efron, Rebecca Ferguson, Michelle Williams, Yahya Abdul-Mateen II, Zendaya",
      "Genre": "biography, musical, drama",
      "Wiki Page": "https://en.wikipedia.org/wiki/The_Greatest_Showman",
      "Plot": "P. T. Barnum and his troupe perform a show at the circus. (\"The Greatest Show\") In a flashback to Barnum's childhood where he and his father Philo, a tailor, work for the Hallett family, and he becomes infatuated with their daughter, Charity. Though Charity is being sent to finishing school, Barnum reassures her they will not be separated. The two keep in touch through letters until they meet again in adulthood (\"A Million Dreams\"), eventually marrying and raising two daughters, Caroline and Helen, in New York City (\"A Million Dreams\" reprise). They live a humble life; though Charity is happy, Barnum dreams of more.\r\nBarnum loses his job as a clerk at a shipping company after the company goes bankrupt. Taking a risky bet, he takes out a large loan from a bank, deceiving the bank into accepting his former employer's lost ships as collateral. He uses this loan to buy Barnum's American Museum in downtown Manhattan, an attraction showcasing various wax models. Initially, sales are slow; on the suggestion of his children to showcase something \"alive\", Barnum searches for \"freaks\" to serve as performers for his museum (\"Come Alive\"). This attracts a large audience despite protests and poor reviews, prompting Barnum to rename his venture \"Barnum's Circus\".\r\nSearching for ways to further his reputation amongst the upper class, Barnum meets playwright Phillip Carlyle and convinces him to join his venture (\"The Other Side\"). Carlyle is enchanted with Anne Wheeler, an African-American trapeze artist, but he hides his feelings. During a trip Carlyle arranged for Barnum and his troupe to meet Queen Victoria, Barnum meets Jenny Lind, a famed Swedish singer, whom he convinces to perform in America, with him serving as her manager. Lind's first American performance is a rousing success (\"Never Enough\"). While Barnum gains favor with the aristocratic patrons, he begins to distance himself from his original troupe, refusing to socialize with them. Dejected, they decide to stand against their local harassers (\"This Is Me\").\r\nCarlyle and Wheeler attend the theatre together one night, only to run into Carlyle's parents, who insult Wheeler's lowly status, causing her to leave. Carlyle chases her and tries to convince her that they can be together, but she rejects him despite her feelings towards him (\"Rewrite the Stars\"). As Barnum takes Lind on a US tour, Charity feels isolated from her husband as she stays home with their daughters (\"Tightrope\"). While on tour, Lind begins falling in love with Barnum, but when he refuses her advances, she calls off the tour and kisses him at the end of her last show, which is photographed by the press (\"Never Enough\" reprise). Barnum returns home to find his circus on fire, caused by a fight between the protesters and the troupe. Carlyle, who had tried to save Anne not knowing she had already escaped, is rescued by Barnum amid the chaos but suffers severe burns. Most of the sets and props are destroyed. Word of Lind's cancellation and Barnum's public intimacy also reaches New York, resulting in his mansion being foreclosed upon and Charity taking Caroline and Helen to her parents' home.\r\nDepressed, Barnum retreats to a local pub, where his troupe find him there and persuade him to rebuild the circus. Barnum has an epiphany that causes him to realize the circus was for his friends and family rather than for himself (\"From Now On\"). Meanwhile, the injured Carlyle wakes in a hospital with Wheeler by his side and they share a kiss.\r\nBarnum leaves and finds his estranged wife, and they decide to mend their relationship. Faced with the financial difficulty of rebuilding the circus, the recovering Carlyle steps in, offering to use his earnings from his share of the circus's profits to rebuild it under the condition of becoming partners, which Barnum happily accepts. As rebuilding the circus in its original location would be too expensive, Barnum rebuilds it as an open-air tent circus by the docks. The revamped circus is a huge success, and Barnum gives full control of the show to Carlyle so he can focus on his family (\"The Greatest Show\" reprise)."
  },
  {
      "Release Year": 2017,
      "Title": "Jumanji: Welcome to the Jungle",
      "Origin/Ethnicity": "American",
      "Director": "Jake Kasdan",
      "Cast": "Jake Kasdan (director); Scott Rosenberg (screenplay); Dwayne Johnson, Kevin Hart, Jack Black, Nick Jonas, Karen Gillan",
      "Genre": "action, fantasy, adventure, comedy",
      "Wiki Page": "https://en.wikipedia.org/wiki/Jumanji:_Welcome_to_the_Jungle",
      "Plot": "In 1996 in Brantford, New Hampshire, teenager Alex Vreeke receives the Jumanji board game which was found by his father on a beach after it was thrown over a bridge by Alan Parrish and Sarah Whittle 27 years earlier. Alex sets the game aside. That night, it transforms into a video game cartridge which catches Alex's attention when he is awakened by the Jumanji drums and he is transported into the game.\r\nTwenty years later, in 2016, four Brantford High School students serve detention: Spencer Gilpin, caught writing an essay for former friend Anthony \"Fridge\" Johnson (also in detention); Bethany Walker, who made a video call during an English-class quiz and Martha Kaply, who refused to participate in gym class. They are sent to the school basement to prepare magazines for recycling and to think about their future. Fridge discovers Alex's discarded video-game system when he explores the basement, and he and Spencer set up the game. Although it has five playable characters, the first one cannot be selected. Spencer and Fridge choose two characters, and the girls choose their own. When Spencer presses \"Start\", they are transported into the game.\r\nThey are in a jungle, in the forms of their game avatars. Spencer is tough, muscular explorer and archaeologist Smolder Bravestone; Fridge is diminutive zoologist Franklin \"Mouse\" Finbar, whom he chose after misreading \"Mouse\" as \"Moose\"; Bethany is chubby male cartographer and intellectual Sheldon \"Shelly\" Oberon (whose nickname she mistook for a woman's), and Martha is beautiful commando and martial arts expert Ruby Roundhouse. They each have three lives; Spencer deduces that if they lose all three, they really die.\r\nThey learn the game's story from NPC Nigel: corrupt archeologist Russel Van Pelt stole the Jaguar's Eye (a magic jewel) from its shrine, cursing Jumanji. Nigel escaped Van Pelt with the jewel, and the players must return it to a jaguar statue and call \"Jumanji\" to lift the curse. Nigel warns them that Van Pelt will stop at nothing to retrieve the jewel, which gives him control of Jumanji's animals. They begin tackling the game's increasingly-difficult \"levels\", losing lives as they do so. The four are rescued by Alex (the missing fifth player, whose avatar is pilot Jefferson \"Seaplane\" McDonough). Taking shelter in a jungle house built by Alan Parrish, Alex believes that he has been in the game for a few months and is distressed to learn that it is really twenty years. The newcomers vow to help him return home. They break into a transportation shed, commandeering a helicopter to fly to the jaguar statue and return the jewel, but Fridge drops the jewel into a herd of white rhinoceros. Spencer uses one of Fridge's lives, pushing him out of the helicopter as a distraction, and retrieves the jewel. Alex loses his last life when a mosquito bites him, but Bethany performs CPR and transfers one of her lives to him.\r\nAt the statue, the players are surrounded by a pack of jaguars and Van Pelt's forces. They outmaneuver their opposition while Spencer and Martha race to the statue. Van Pelt confronts Martha (trapped in a pit of mambas) and demands the jewel, but she sacrifices one of her lives to re-spawn and get it to Spencer. With the players on their last lives, they end the game with Van Pelt disintegrating into a bunch of rats and return to the real world; Nigel bids them farewell, but Alex does not appear with them. They find the formerly-dilapidated Vreeke home restored and decorated for a Christmas family gathering. An adult Alex arrives, returning to where he left off in 1996. Now married with children, he named his eldest daughter after Bethany out of gratitude for saving his life and introduces them to his infant son, Andy.\r\nSpencer and Fridge reconcile, Bethany begins caring for others than herself and plans a summer backpacking adventure, Martha and Spencer become romantically involved and the four are now friends after their experiences in the game. When they hear Jumanji's drumbeats, they bring the game behind the school and Fridge destroys it with a bowling ball (also found in detention) to prevent anyone from playing it again."
  },
  {
      "Release Year": 2017,
      "Title": "Beach Rats",
      "Origin/Ethnicity": "American",
      "Director": "Eliza Hittman",
      "Cast": "Eliza Hittman (director/screenplay); Harris Dickinson, Madeline Weinstein, Kate Hodge",
      "Genre": "drama",
      "Wiki Page": "https://en.wikipedia.org/wiki/Beach_Rats",
      "Plot": "Frankie (Harris Dickinson) struggles to escape his Brooklyn home life. He balances his time with a new girlfriend (Madeline Weinstein), his friends, and chatting with older men on the Internet, whom he meets up with for sex and drugs. He does not, however, identify as bisexual or gay to his girlfriend or male friends. He just \"has sex with men,\" in the words of one of his Internet partners. Frankie attempts to compartmentalize his life by having sex with older men, to avoid them happening to know his friends. This becomes increasingly difficult, however, as he moves about the area and he happens to run into them, or lures them to meetings for drugs."
  },
  {
      "Release Year": 2017,
      "Title": "Unlocked",
      "Origin/Ethnicity": "American",
      "Director": "Michael Apted",
      "Cast": "Michael Apted (director); Peter O'Brien (screenplay); Noomi Rapace, Orlando Bloom, Toni Collette, John Malkovich, Michael Douglas, Jessica Boone",
      "Genre": "action, thriller",
      "Wiki Page": "https://en.wikipedia.org/wiki/Unlocked_(2017_film)",
      "Plot": "After an operation in Paris failed on her watch, CIA interrogation officer Alice Racine now works in an undercover capacity at a community centre in London. The area is a hotspot for Islamic extremism, and information she discovers in her capacity at the centre is passed on to the security services, including MI5 Intelligence Chief Emily Knowles. Her former station chief and mentor Eric Lasch meets with her, and tells her that she shouldn’t feel guilty for the failed operation (which resulted in Algerian suicide bombers killing 24 people) and that she needs to get back into the field. Meanwhile, the Central Intelligence Agency and MI5 receive intel that radical preacher Imam Yazid Khaleel is planning a biological attack on an American target on British soil in collaboration with terrorist and American born Islamic convert David Mercer. Racine is approached by Frank Sutter, an officer from the CIA’s London Station, who tells her she has orders from Europe Division Chief Bob Hunter to help them interrogate and break Khaleel’s courier they have captured.\r\nIn a hotel, Racine begins to interrogate the courier, a British-Moroccan man named Lateef, and is able to coax the message he is due to deliver to Mercer’s representative to confirm the attack. However, before divulging the details of the message to Sutter, she receives a call from her handler Ed Romley, who confusingly gives her the same mission brief as Sutter. Realising she has been tricked and the men she is working with are not CIA, she attempts to remove Lateef from their custody, but in an ensuing gunfight he is killed. She retreats to Lasch's apartment, but that is soon also attacked by the operatives, with Racine witnessing Lasch be fatally shot as she escapes to a safe house he informed her of previously. Upon arriving at the safe house, she apprehends burglar Jack Alcott, who is in the process of robbing the apartment. Restraining him in the bedroom, she contacts Hunter and Romley, who despite claiming to believe her, per protocol, send SCO19 officers to apprehend and bring her in. After fighting two of the officers and being tasered, she is saved by Alcott and the two manage to escape. Revealing he is a former Royal Marine who served in the Iraq War, Racine reluctantly decides to allow him to accompany her. Racine also seeks the help of Amjad, a friend and client from the community centre who drives a taxi.\r\nShe and Alcott confront Khaleel in a Moroccan restaurant, where he confesses he no longer believes in the radical extremism he promotes (with the courier message being a stand down order), but anticipates that Mercer will still go ahead with the attack. Following an associate of Lateef, Racine discovers Alcott is working with Sutter and the two fight, with Racine managing to escape after Alcott is killed by an aggrieved third party. Racine approaches Knowles, who agrees to help her and sets up an operation where Amjad stands in as the courier to meet with Mercer's representative. She reveals to Racine that intelligence from the French DGSI suggests senior parties in the CIA allowed the Paris attack to take place, as one of the victims killed in the bombings was a CIA whistle blower. Meanwhile, Romley's team track the bullets used in the killing of their men who apprehended Lateef to a AT308C sniper rifle, which is revealed to have been checked out of a Metropolitan Police armoury by corrupt MI5 operative John Wilson. Wilson is shown to be part of the team providing cover for Knowles operation, and guns down his fellow operatives as well as injuring Knowles whilst trying to kill Racine. Amjad is also killed in the crossfire.\r\nHaving survived the attack, Racine heads to a meeting point organised by Sutter, where it is revealed that Lasch is not only alive but is the main conspirator. After a brief struggle, he escapes, but is tracked by her to a warehouse outside of Wembley Stadium, where a sold out game of American football is due to be played between Portland and Oklahoma. Lasch reveals he wants the biological attack to take place, and the visiting Americans to transport the virus back home, in order to force the US Government to take the threat of biological warfare seriously. After shooting Wilson, Racine and Lasch engage in a brief fight, which ultimately results in him falling to his death and Racine disarming the virus canisters. Knowing that in light of the attack failing Mercer will attempt to flee to Syria, she is instructed by Hunter to intercept him en route. In Prague, Mercer is about to meet with a contact who will take him on the next leg of his journey, but is accosted by Racine at a tram station where she slices his femoral artery, killing him."
  },
  {
      "Release Year": 2017,
      "Title": "It",
      "Origin/Ethnicity": "American",
      "Director": "Andrés Muschietti",
      "Cast": "Andrés Muschietti (director); Chase Palmer, Cary Fukunaga, Gary Dauberman (screenplay); Bill Skarsgård, Jaeden Lieberher, Finn Wolfhard, Jack Dylan Grazer, Sophia Lillis, Wyatt Oleff, Chosen Jacobs, Jeremy Ray Taylor",
      "Genre": "horror, fantasy, drama",
      "Wiki Page": "https://en.wikipedia.org/wiki/It_(2017_film)",
      "Plot": "In October 1988, Bill Denbrough gives his seven-year-old brother, Georgie, a paper sailboat. Georgie sails the boat along the rainy streets of small town Derry, and is disappointed when it falls down a storm drain. As he attempts to retrieve it, Georgie sees a clown in the sewer, who introduces himself as Pennywise the Dancing Clown. The clown entices Georgie to come closer, then severs his arm and drags him into the sewer.\r\nThe following summer, Bill and his friends—Richie Tozier, Eddie Kaspbrak, and Stan Uris—run afoul of older bully Henry Bowers and his gang. Bill, still haunted by Georgie's disappearance and the resulting neglect from his grief-stricken parents, discovers that his brother's body may have washed up in a marshy wasteland called the Barrens. He recruits his friends to investigate, believing his brother may still be alive. Ben Hanscom learns that the town has been plagued by unexplained tragedies and child disappearances for centuries. He is targeted by Bowers' gang, after which he flees into the Barrens and meets Bill's group. They find the sneaker of a missing girl, while a member of the pursuing Bowers Gang, Patrick Hockstetter, is killed by Pennywise while searching the sewers for Ben.\r\nBeverly Marsh, a girl ostracized over rumors of promiscuity, also joins the group; both Bill and Ben develop feelings for her. Later, the group befriends Mike Hanlon after defending him from Bowers. All the while each member of the group has encountered terrifying phenomena in various forms; these include the same menacing clown who attacked Georgie, a headless boy, a fountain of blood, a diseased and rotting man, a creepy painting come to life, Mike's parents burning alive, and a phantom Georgie.\r\nNow calling themselves \"The Losers Club\", they realize they are all being terrorized by the same entity. They determine that \"It\" assumes the appearance of what they fear, awakens every 27 years to feed on the children of Derry before returning to hibernation, and moves about by using sewer lines, which all lead to a well currently under the abandoned house at 29 Neibolt Street. After an attack by Pennywise, the group ventures to the house to confront him, only to be separated and terrorized. Eddie breaks his arm, while Pennywise gloats to Bill about Georgie. As they regroup, Beverly impales Pennywise through the head, forcing the clown to retreat. After the encounter, the group begins to splinter, with only Bill and Beverly resolute in fighting It.\r\nWeeks later, after Beverly confronts and incapacitates her sexually abusive father, she is abducted by Pennywise. The Losers Club reassembles and travels back to the Neibolt house to rescue her. Henry Bowers, who has killed his father after being compelled into madness by It, attacks the group. Mike fights back and pushes Bowers down the well to his apparent death. The Losers descend into the sewers and find It's underground lair, which contains a mountain of decayed circus props and children's belongings, around which the bodies of missing children float in mid-air. Beverly, now catatonic after being exposed to It's true form, is restored to consciousness as Ben kisses her. Bill encounters Georgie, but recognizes that he is Pennywise in disguise. Pennywise attacks the group and takes Bill hostage, offering to spare the others if they let It keep Bill. The Losers reject this and reaffirm their friendship, overcoming their various fears. After a brief battle, they defeat Pennywise and it retreats, with Bill declaring that It will starve during its hibernation. Bill finally accepts his brother's death and is comforted by his friends.\r\nAs summer ends, Beverly informs the group of a vision she had while catatonic, where she saw them fighting the creature as adults. The Losers create a blood oath by cutting each other's hands and forming a circle, swearing to return to Derry in adulthood if It returns and destroy the creature once and for all. Stanley, Eddie, Richie, Mike, and Ben make their goodbyes as the group part ways. Beverly tells Bill she is leaving the next day to live with her aunt in Portland. As she leaves, Bill runs up to her and they kiss."
  },
  {
      "Release Year": 2017,
      "Title": "9/11",
      "Origin/Ethnicity": "American",
      "Director": "Unknown",
      "Cast": "Charlie Sheen, Whoopi Goldberg",
      "Genre": "drama",
      "Wiki Page": "https://en.wikipedia.org/wiki/9/11_(2017_film)",
      "Plot": "On the morning of September 11, 2001, a messenger sings \"Happy Birthday to You\" to his daughter, a billionaire argues with his wife in a divorce hearing, a maintenance man begins his day, and a young Russian decides she's breaking up with her sugar daddy. When the first plane hits the World Trade Center, these five elevator passengers find themselves trapped. Forced to band together, they fight against all odds to escape before the imminent and inevitable collapse occurs.\r\nBased on Patrick James Carson's award-winning play Elevator, which premiered in October 2011 at the Red Barn Theater of Tucson, Arizona."
  },
  {
      "Release Year": 2017,
      "Title": "The Good Catholic",
      "Origin/Ethnicity": "American",
      "Director": "Paul Shoulberg",
      "Cast": "Paul Shoulberg (director/screenplay); Zachary Spicer, Wrenn Schmidt, John C. McGinley, Danny Glover",
      "Genre": "comedy",
      "Wiki Page": "https://en.wikipedia.org/wiki/The_Good_Catholic",
      "Plot": "Three Catholic priests live in a rectory together. Young Father Daniel runs daily and lost his father in the past year. Father Ollie really likes food and is a big fan of Indiana University basketball. More elderly Father Victor is completely devoted to the church with little outside interests. He finds comfort in setting up the candles and the church for mass by himself in his own specific way. They eat together, set the weekly schedule for baptisms and church services and run the general work of the church. They also discuss scripture, their proposed homilies, and the meaning of God in their lives.\r\nOne Friday night young Father Dan meets Jane through the confessional box. She tells him she is a musician and is dying. She is new to the church thing but over the weeks they become friends to the point of playing \"battleship\" in the confessional. Jane explains how she wants to die but changes her mind at times. Dan gives her a gift of a Bible after a night of Bingo and she is offended. She invites Dan to hear her sing at her coffee house and he goes. One night they reverse roles and she wants him to unburden himself. He tells her that he is happy to be a man of God and help people but he does not see God. They become friends.\r\nThroughout the movie each priest gives a sermon. Dan teaches that death gives meaning to life. Enjoy life now for we all die. Father Ollie teaches on compassion. We all need compassion that means to suffer with another. We need to comfort the sick and be there with the dying. Father Victor preaches that no one sees God but he lives inside each of us. God is love. You find God in the love of man. God, love, and man are one.\r\nOne night Father Dan invites Jane over for dinner at the rectory. Father Ollie is enjoying the food cooked by Dan. Serious Father Victor wants to know what Father Daniel's primary passion is. A Priest has a duty to Christ and cannot be fooled by young love. Jane, offended, leaves. Victor asks Daniel if he has lost his faith; Father Daniel says no, that he never had faith until he met Jane. He has helped her not be alone. By loving her and helping her as a friend he is loving God. He now sees God."
  },
  {
      "Release Year": 2017,
      "Title": "Gun Shy",
      "Origin/Ethnicity": "American",
      "Director": "Simon West",
      "Cast": "Simon West (director); Toby Davies, Mark Haskell Smith (screenplay); Antonio Banderas, Olga Kurylenko",
      "Genre": "action",
      "Wiki Page": "https://en.wikipedia.org/wiki/Gun_Shy_(2017_film)",
      "Plot": "Aging rock star Turk Enry's supermodel wife is kidnapped while they are vacationing in Chile and he undertakes to rescue her equipped with skills better suited to playing bass, playing the field and partying."
  }
]