[
  {
    
    "Release Year": 2017,
    "Title": "Nabab",
    "Origin/Ethnicity": "Bangladeshi",
    "Director": "Joydeep Mukherjee",
    "Cast": "Shakib Khan, Subhasree Ganguly, Amit Hasan, Rajatava Dutta",
    "Genre": "action",
    "Wiki Page": "https://en.wikipedia.org/wiki/Nabab",
    "Plot": "A group of people travelling in a bus, later the bus stops for a tea break and the hooligans arrive at the same time when suddenly a passing convoy is attacked and the assassins try to kill the man inside one of the cars. The man using his swiftness foils the attack and manages to nab and arrest one of the attackers while killing another.The rest manage to escape the scene.\r\nThis man is Chief Investigating Officer Rajib Chowdhury (Shakib Khan) and the person in the car turns out to be Chief Minister Ananya Chatterjee (Aparajita Adhya) who was impressed with Rajib and delegates to him the task of locating the people behind recent terrorist conspiracy to Rajib. Rajib promises to fulfill the job to the best of his ability.\r\nMasud (Sagnik Chatterjee) a Muslim ACP is taken off from the Special Action Team when a notorious gangster Mustaq escapes his clutches. Despite being an honest and upright police officer with the best intelligence gathering network in the force, Masud is rueful that he is being given low class treatment because he is a Muslim and is being perceived as having let Mustaq escape because he was a Muslim as well.Rajib wants Masud on the team, but Masud refuses.It is revealed that Rajib's father Constable Shymal Chowdhury was killed by terrorist in Bangladesh which motivated Rajib to join police force.\r\nIt is shown that Avoy Mandal(Kharaj Mukherjee) the Deputy CM was the one who committed the fraud and is trying to ensure that he is not caught and hence he had asked the assassins to attack the CM. Rajib tries to break the back of crime and this starts irritating Mandal who senses how close Rajib is getting. Mandal then frames Rajib for the murder of Meghla(Meghla), daughter of the Police Commissioner Gautom(Rajatava Dutta).\r\nRajib escaped prison then went to the Commissioner's house to tell him the truth, but there he accused for the murder of Commissioner.With the help of his love interest Rajib reached to Mandal. But imprisoning his mother and few colleagues Mandal trapped Rajib to kill CM in a high security zone."
}
  
]
